{"warezcdn":{"imdb":"tt0463281","name":"Air Master","href":"https://embed.warezcdn.net/serie/tt0463281","title":"Air Master"},"imdb":{"id":"tt0463281","review_api_path":"/reviews/tt0463281","imdb":"https://www.imdb.com/title/tt0463281","contentType":"TVSeries","productionStatus":"Released","title":"Air Master","image":"https://m.media-amazon.com/images/M/MV5BNmJlOGIwY2YtYTZhZC00MmM1LThjY2EtNzExNWY3ODZmZDI4XkEyXkFqcGdeQXVyMjc4OTQ1OTA@._V1_.jpg","images":["https://m.media-amazon.com/images/M/MV5BODA1NDIwOTQzM15BMl5BanBnXkFtZTgwODQwMzc4NzE@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTk5NDM3MDYyNV5BMl5BanBnXkFtZTgwNzQwMzc4NzE@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTAzMzIzODI2MzBeQTJeQWpwZ15BbWU4MDU0MDM3ODcx._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMjE5ODA4NzM1NF5BMl5BanBnXkFtZTgwNzMwMzc4NzE@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMjExMTU1MjcxM15BMl5BanBnXkFtZTgwNDQwMzc4NzE@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BODEzOTIyMTIzN15BMl5BanBnXkFtZTgwOTMwMzc4NzE@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMjM2MzQyODkwOF5BMl5BanBnXkFtZTgwMTQwMzc4NzE@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTc0NTYzOTYyOF5BMl5BanBnXkFtZTgwMjQwMzc4NzE@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BNjI3NjU0MDgxN15BMl5BanBnXkFtZTgwMzQwMzc4NzE@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTk1MDAzNzMyM15BMl5BanBnXkFtZTgwODMwMzc4NzE@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTcwOTc5NzgyOV5BMl5BanBnXkFtZTgwMDQwMzc4NzE@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMzQzMzEyMTk0Ml5BMl5BanBnXkFtZTgwNjk1NDUyMjE@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMjA0MzMyNzU2NV5BMl5BanBnXkFtZTgwMzAwMzUyMjE@._V1_.jpg"],"plot":"\"Maki Aikawa is tall, with a nice model-like figure, but is also quiet and looks like an ordinary high school girl. However, her unique life style includes being a street fighter within the dark alleyways and back streets of Tokyo...","rating":{"count":176,"star":6.8},"award":{"wins":0,"nominations":0},"contentRating":"TV-14","genre":"Animation,Action,Comedy","year":2005,"runtime":null,"releaseDeatiled":{"day":15,"month":3,"year":2005,"releaseLocation":{"country":"United States","cca2":"US"},"originLocations":[{"country":"Japan","cca2":"JP"}]},"spokenLanguages":[{"language":"English","id":"en"},{"language":"Japanese","id":"ja"}],"filmingLocations":[],"actors":["Romi Park","Katie Griffin","Bryn McAuley"],"directors":[],"top_credits":[{"name":"Stars","value":["Romi Park","Katie Griffin","Bryn McAuley"]}],"seasons":[{"id":"1","name":"Season 1","episodes":[{"idx":1,"no":"S1, Ep1","title":"Tobe! Ea masutâ","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Former gymnast, Aikawa Maki has turned her skills to street fighting. Violence being the only thing that makes her feel truly alive. With growing skill, she fights opponent after opponent, repeatedly demonstrating her signature gymnastic style which gives her the name that echos through the fighting community, \"Air master\".","publishedDate":"1 Apr. 2003","rating":{"count":8,"star":5.4}},{"idx":2,"no":"S1, Ep2","title":"Ero! Sakiyama Kaori!","image":"https://m.media-amazon.com/images/M/MV5BNzUzMDA3NDE0M15BMl5BanBnXkFtZTgwODk5MjUyMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNzUzMDA3NDE0M15BMl5BanBnXkFtZTgwODk5MjUyMjE@.jpg","plot":"From the scene that took place the other day, several girls (also known as a ko-gal group) immediately began to voice their acceptance in having Maki join their circle of friends. The group include Yuu, Michiru, Mina, and Renge. Maki was nicknamed Maki-chan.The ko-gal group planned an outing to a pool where they could showoff some new and very revealing bathing suits. A few days later, each of them were modeling their new bathing suit. During the pool outing, a girl named Kaori Sakiyama also noticed the girl and became jealous, challenging the entire group to a ...","publishedDate":"8 Apr. 2003","rating":{"count":0,"star":0}},{"idx":3,"no":"S1, Ep3","title":"Challenge! Tokita Shinnosuke","image":"https://m.media-amazon.com/images/M/MV5BMTc0OTA2NjgzNV5BMl5BanBnXkFtZTgwMTAwMzUyMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTc0OTA2NjgzNV5BMl5BanBnXkFtZTgwMTAwMzUyMjE@.jpg","plot":"Yuu, Michiru, Mina, Renge, and Maki went to Shibuya. When on the street, a young man named Shinnosuke Tokita whose goal was to beat the Air Master, presented his challenge. This man who challenged Maki carried a Sansetsukon, a deadly weapon that he had trained with since the age of five.Before the fight with Shinnosuke could commence, Kaori Sakiyama shows up unexpectedly to challenge Maki to the first fight.","publishedDate":"15 Apr. 2003","rating":{"count":0,"star":0}},{"idx":5,"no":"S1, Ep5","title":"Cry! Sakamoto Juliet","image":"https://m.media-amazon.com/images/M/MV5BMjA0MzMyNzU2NV5BMl5BanBnXkFtZTgwMzAwMzUyMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjA0MzMyNzU2NV5BMl5BanBnXkFtZTgwMzAwMzUyMjE@.jpg","plot":"Maki is confronted by a man named Julietta Sakamoto who Tsukio knows and calls a strong man. Approaching Maki, he begins to whisper words of love into her ear and gently kisses her hand. Maki is quite surprised while her friends Yuu and Michiru drop their jaws at the sight of this. Renge uncontrollably eats a snack that was given to her by Julietta. And as for Mina, she blurts out \"I am Maki's lover!\"Maki and her companions are completely caught off guard by the actions of Julietta. And as for Maki who wants to fight Julietta, she knows to get involved further might ...","publishedDate":"29 Apr. 2003","rating":{"count":0,"star":0}},{"idx":6,"no":"S1, Ep6","title":"Ride It! Maki","image":"https://m.media-amazon.com/images/M/MV5BNzQxNTg0MDkyM15BMl5BanBnXkFtZTgwMzA0MjUyMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNzQxNTg0MDkyM15BMl5BanBnXkFtZTgwMzA0MjUyMjE@.jpg","plot":"Maki's involuntary encounter with Julietta Sakamoto left her confused. She spaces out and decided not to go to school because something still doesn't feel right. She wants the challenge of battle but knows it is not possible.Mina begins to worry about Maki who did not come to school and decides to visit her, even thought she does not know her address. Michiru, Yuu, Shinnosuke and the very strangely dressed Renge follow Mina. Renge casts a strange spell and impressively locates Maki. As they begin to approach Maki, she's walking through the rain without an umbrella ...","publishedDate":"6 May 2003","rating":{"count":0,"star":0}},{"idx":7,"no":"S1, Ep7","title":"Don't Make Me Say It Twice!","image":"https://m.media-amazon.com/images/M/MV5BMTc2ODY1MjQ0N15BMl5BanBnXkFtZTgwNTkzMjUyMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTc2ODY1MjQ0N15BMl5BanBnXkFtZTgwNTkzMjUyMjE@.jpg","plot":"Maki challenges Julietta to a fight. The appointed time is three o'clock and that's when she wakes up. \"I overslept!\" said Maki. However, the man who arrived at the appointed place on time was Maki's father, \"Shiro Saeki\". Without Maki's presence, Shiro challenges Julietta to a fight, but to Julietta, Shiro was not the one he was eagerly waiting for. Julietta begins to plant a sequence of kicks that were filled with fury. As Maki proceeds as quickly as possible to the appointed place, she is stopped on route and challenged to another fight by a girl named Miori Saeki....","publishedDate":"13 May 2003","rating":{"count":0,"star":0}},{"idx":8,"no":"S1, Ep8","title":"Roar! Nakanotani Mina","image":"https://m.media-amazon.com/images/M/MV5BMTY4NzA2MTczNl5BMl5BanBnXkFtZTgwMzgzMjUyMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTY4NzA2MTczNl5BMl5BanBnXkFtZTgwMzgzMjUyMjE@.jpg","plot":"The beach! Maki, Mina, Yuu, Michiru, and Renge had come to hang out and sun bathe together. Of course, Mina and her unbelievable breasts stood out conspicuously to attract the attention of anyone who passed by.While at the beach, Renge decided to enter Mina in the beach queen contest without ever telling her. Mina, who is very large breasted and a natural for such a competition is also very shy and at first, refuses to participate. However, Maki encourages Mina to partake and she agrees and then becomes determined to win the contest.At the same time, another ...","publishedDate":"20 May 2003","rating":{"count":0,"star":0}},{"idx":9,"no":"S1, Ep9","title":"Go! Black Alliance of Justice and Sincerity","image":"https://m.media-amazon.com/images/M/MV5BMTc1MzM0OTI3NF5BMl5BanBnXkFtZTgwNDkzMjUyMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTc1MzM0OTI3NF5BMl5BanBnXkFtZTgwNDkzMjUyMjE@.jpg","plot":"A group of high school students in their school uniforms came to Tokyo on a field trip. They call themselves the \"Black Alliance of Justice and Sincerity\". While the Black Alliance enjoy fighting, they also have aspiration of becoming Japan's number one fighting group. Immediately, they begin to challenge the students of the Tokyo area. To their surprise, the Tokyo students present little challenge and are defeated quite easily. Quickly gaining confidence, the Black Alliance begin to say that the people of Tokyo are weak. However, while still in Tokyo, the members of ...","publishedDate":"27 May 2003","rating":{"count":0,"star":0}},{"idx":10,"no":"S1, Ep10","title":"Blaze! Kitaeda Kinjiro","image":"https://m.media-amazon.com/images/M/MV5BMTYzOTYxMzA5MV5BMl5BanBnXkFtZTgwNzkzMjUyMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTYzOTYxMzA5MV5BMl5BanBnXkFtZTgwNzkzMjUyMjE@.jpg","plot":"Although the kidnapped Mina was rescued from the hands of the Black Alliance, Tsukio, Reiichi, and Shinnosuke are soon overwhelmed by the growing number of the Black Alliance. Tsukio realizes that they would soon be annihilated and orders Shinnosuke and Reiichi to flee from the scene carrying Mina. However, they are soon cornered by the growing number of Black Alliance members. At the same time, there is a man with a dignified look sitting in a caf?' calling out the leaders of the Black Alliance. He is the president of Black Alliance of Justice and Sincerity \"Kinjiro ...","publishedDate":"3 Jun. 2003","rating":{"count":0,"star":0}},{"idx":11,"no":"S1, Ep11","title":"A Fight to Remember! Maki Vs. Kinjirou","image":"https://m.media-amazon.com/images/M/MV5BMTYyNjgyMTMxMl5BMl5BanBnXkFtZTgwMDkzMjUyMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTYyNjgyMTMxMl5BMl5BanBnXkFtZTgwMDkzMjUyMjE@.jpg","plot":"Maki's anger erupted into a violent rage when she saw Mina! After defeating several of the Black Alliance members, Maki is challenged to a fight by their leader, Kinjiro, who is also known as \"Kin-chan.\" As Maki and Kinjiro prepare to battle drawing closer to each other, Nagato, another member from the Black Alliance, steps in gesturing that he want to be the next to fight the Air Master. Maki quickly accepts Nagato's challenge. Julietta, who was sitting nearby noticed Maki and proceeded to approach her, to his surprise, Nagato quickly lands a kick to Julietta's body....","publishedDate":"10 Jun. 2003","rating":{"count":0,"star":0}},{"idx":13,"no":"S1, Ep13","title":"Shine! Sky Star","image":"https://m.media-amazon.com/images/M/MV5BMzQzMzEyMTk0Ml5BMl5BanBnXkFtZTgwNjk1NDUyMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMzQzMzEyMTk0Ml5BMl5BanBnXkFtZTgwNjk1NDUyMjE@.jpg","plot":"An out-of-this-world tag team is born! And they're called the Fami-Wrestlers!Ignoring the matches listed on the card, this duo starts attacking one team after another! Kaori Sakiyama grabs a mic in the stunned crowd and gives an all-out performance! Feeling she should stop their fighting, a blood-thirsty pro wrestler named Mio Hayase appears. Sakiyama yells to her over the mic, \"you look like you poisoned theprincess in the dragon castle and switched places with her!\" No one can stop Sakiyama from egging on the fight! Or so they thought. Mio hits Sakiyama in the head ...","publishedDate":"24 Jun. 2003","rating":{"count":0,"star":0}},{"idx":14,"no":"S1, Ep14","title":"Pierce Through! Kai and Maki","image":"https://m.media-amazon.com/images/M/MV5BMTcwOTc5NzgyOV5BMl5BanBnXkFtZTgwMDQwMzc4NzE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTcwOTc5NzgyOV5BMl5BanBnXkFtZTgwMDQwMzc4NzE@.jpg","plot":"Air Master vs. Sky Star, the mid-air battle extravaganza has finally begun! But Kai is a cut above Maki when it comes to the ring. Maki is about to collapse! But then, Sakiyama yells from ringside, \"What the hell are you doing in there?!\" But then Maki is smacked! Mio, Kai and the spectators are all stunned. Sakiyama is screaming to kick Kai and Mio's butts! Sakiyama goes to unleash her Hua Jing on Kai but it misfires. Then Kai and Mio explode in a magnificent combination attack! Sakiyama and Maki are knocked into their corner. Kai hits with her Missile Kick and Mio ...","publishedDate":"1 Jul. 2003","rating":{"count":0,"star":0}},{"idx":15,"no":"S1, Ep15","title":"Conquer! Roach Queen","image":"https://m.media-amazon.com/images/M/MV5BMTAzMzIzODI2MzBeQTJeQWpwZ15BbWU4MDU0MDM3ODcx._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTAzMzIzODI2MzBeQTJeQWpwZ15BbWU4MDU0MDM3ODcx.jpg","plot":"After the pro wrestling event, everyone slowly starts to change. Shinnosuke makes a resolution in his heart and leaves on a solitary voyage. Maki, on the other hand, is rendered completely dumb after the match. She isn't giving off the same aura she had while in the ring! Dumbfounded by this, Kaori Sakiyama begins to preach to Maki and confesses that she was fired from her job. Kaori then drags Maki to work the same part-time job she took up. Her job is to play the villain in the High Rangers hero show at the amusement park. Maki is up there, dumb as ever, with a ...","publishedDate":"8 Jul. 2003","rating":{"count":0,"star":0}},{"idx":16,"no":"S1, Ep16","title":"Fight! Fukamichi Ranking","image":"https://m.media-amazon.com/images/M/MV5BMjM2MzQyODkwOF5BMl5BanBnXkFtZTgwMTQwMzc4NzE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjM2MzQyODkwOF5BMl5BanBnXkFtZTgwMTQwMzc4NzE@.jpg","plot":"A mysterious man calling himself Fukamichi suddenly appears in front of Tsukio and Reiichi asking them to join the Fukamichi Ranking. Tsukio is annoyed at his attitude but invites Lucha Master to take his place. Right when they think the fight is about to start, Fukamichi calls out the 36th ranked fighter in the Fukamichi Ranking and he defeats Lucha Master in one second. The three of them are disappointed and shocked by this. While this is going on, a man who says he is in the Fukamichi Ranking appears before Kai and Mio. This man is named Yashiki. He appears to want...","publishedDate":"15 Jul. 2003","rating":{"count":0,"star":0}},{"idx":17,"no":"S1, Ep17","title":"Gather! Street Fighters","image":"https://m.media-amazon.com/images/M/MV5BODEzOTIyMTIzN15BMl5BanBnXkFtZTgwOTMwMzc4NzE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BODEzOTIyMTIzN15BMl5BanBnXkFtZTgwOTMwMzc4NzE@.jpg","plot":"Maki's strength is fully tested by the Fukamichi Ranking. Maki easily defeats the 17th ranked fighter but waiting at the side is a dangerous looking fighter, her opponent. He says \"Welcome to the Sniper Karate course.\" There is also a man who has come to Tokyo after hearing of Maki's spectacular fights. The leader of the Ranking, Fukamichi himself, invited him and it's none other than Kinjiro Kitaeda. Instead of fighting a rematch with the Air Master he opts to join the Fukamichi Ranking. Nagato overhears Fukamichi say \"Kinjiro Kitaeda, I want you,\" while recruiting ...","publishedDate":"22 Jul. 2003","rating":{"count":0,"star":0}},{"idx":18,"no":"S1, Ep18","title":"Cosplay! Komada Shigeo","image":"https://m.media-amazon.com/images/M/MV5BNjI3NjU0MDgxN15BMl5BanBnXkFtZTgwMzQwMzc4NzE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNjI3NjU0MDgxN15BMl5BanBnXkFtZTgwMzQwMzc4NzE@.jpg","plot":"A cosplaying man named Shigeo Komata, his clothes are ragged and he has a crew cut like someone out of a video game. Though he based his attacks on a video game character, his power is not to be taken lightly! For this reason, he is number six in the Fukamichi Ranking. Maki definitely sees that he's not someone who will be beaten if she doesn't give 100%. At the same time, Kinjiro Kitaeda is fighting the 10th ranked fighter upon Fukamichi's instructions. He's being swiftly punched by his nimble opponent, but he responds with \"There's no soul in your punches\" and ...","publishedDate":"29 Jul. 2003","rating":{"count":0,"star":0}},{"idx":19,"no":"S1, Ep19","title":"Lurk in the Shadows! Ogata Kouji","image":"https://m.media-amazon.com/images/M/MV5BMTk1MDAzNzMyM15BMl5BanBnXkFtZTgwODMwMzc4NzE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTk1MDAzNzMyM15BMl5BanBnXkFtZTgwODMwMzc4NzE@.jpg","plot":"Maki and Kai will have real Fukamichi Ranking battles. Fukamichi gives them both locators to find the other person, to be worn on their wrists. Though it's an incredible device to help you locate your opponent, Maki can't figure out how to work it at all! Fukamichi is amazed how dull she is besides for her fighting skills. Though she can't figure it out, she ends up in a dilapidated building. The locator shows her opponent is close by and then he shows up! His name is Koji Ogata. He's dressed oddly and his unusual movements confuse Maki. His attack style is Ninjutsu! ...","publishedDate":"5 Aug. 2003","rating":{"count":0,"star":0}},{"idx":20,"no":"S1, Ep20","title":"Clash! Kai vs. Kinjirou","image":"https://m.media-amazon.com/images/M/MV5BMTc0NTYzOTYyOF5BMl5BanBnXkFtZTgwMjQwMzc4NzE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTc0NTYzOTYyOF5BMl5BanBnXkFtZTgwMjQwMzc4NzE@.jpg","plot":"Kai is walking along a large road following the locator that Fukamichi gave to her. Slowly but surely, she approaches her opponent. Miori is alongside and her and is completely emotionally attacked to Kai. Her opponent happens to be Kinjiro Kitaeda, or Kin-chan! As soon as they realize who their opponent is, they start into a full-out battle! Izakaya Bomber vs. Chi Punch. Or more so, Sky Star Pro Wrestler vs. the Spirited Right Puncher!\" They're in the middle of a busy street with cars and people around, plus it's broad daylight. A large gallery of people form to ...","publishedDate":"12 Aug. 2003","rating":{"count":0,"star":0}},{"idx":21,"no":"S1, Ep21","title":"Make Him Talk! Fukamichi's Younger Brother","image":"https://m.media-amazon.com/images/M/MV5BMjE5ODA4NzM1NF5BMl5BanBnXkFtZTgwNzMwMzc4NzE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjE5ODA4NzM1NF5BMl5BanBnXkFtZTgwNzMwMzc4NzE@.jpg","plot":"The man who appeared in front of Julietta was the younger brother of the ringleader of the Ranking's younger brother, Fukamichi. Nobuhiko challenges Julietta to a fight. He thought Julietta Sakamoto would be unable to fight and he mistakenly feels happy. Fukamichi watches the fight on the monitor excitedly, with bated breath. He then sees his brother get knocked out and his head stuck into the ceiling. The fight ended while he was still introducing himself. Then, Kinjiro, whose left arm was destroyed in the fight against Kai, stumbles into a clinic. He says crazy ...","publishedDate":"19 Aug. 2003","rating":{"count":0,"star":0}},{"idx":23,"no":"S1, Ep23","title":"Rip It Up! Minaguchi Yuki","image":"https://m.media-amazon.com/images/M/MV5BMjExMTU1MjcxM15BMl5BanBnXkFtZTgwNDQwMzc4NzE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjExMTU1MjcxM15BMl5BanBnXkFtZTgwNDQwMzc4NzE@.jpg","plot":"Kin-chan loses to Yuki Minaguchi. His right arm is back to full function but he's overwhelmed by Yuki's strength. Her next opponent is the Air Master. All the Fukamichi Ranking fans across the country have been awaiting this battle as the fight begins in earnest. Both Maki and Yuki try to end the fight with their special attack right at the start. But, they both notice the other's attack and dodge. Yuki smiles happily at Maki and for the first time Maki feels terror throughout her body. The difference in emotion is apparent in the fight and Maki is handily being ...","publishedDate":"2 Sep. 2003","rating":{"count":0,"star":0}},{"idx":25,"no":"S1, Ep25","title":"Break! Konishi vs. Julieta","image":"https://m.media-amazon.com/images/M/MV5BODA1NDIwOTQzM15BMl5BanBnXkFtZTgwODQwMzc4NzE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BODA1NDIwOTQzM15BMl5BanBnXkFtZTgwODQwMzc4NzE@.jpg","plot":"\"I will defeat you. I will become a perfect dazzling star in the night sky tonight!\" declares Konishi. While standing up to Julietta's random power, Konishi keeps telling himself to remain cool. Konishi breaks Julietta's right leg with his left arm! You can hear the ligament snap in the quiet of the evening park! Konishi prepares for him to submit. However, for some reason, Julietta's right leg comes flying in! And faster than before! How can this be? His ligament was torn! In any case, this is true. Konishi, telling himself to stay cool even more than before, stops ...","publishedDate":"16 Sep. 2003","rating":{"count":0,"star":0}},{"idx":26,"no":"S1, Ep26","title":"Feel It! The Struggling Wind","image":"https://m.media-amazon.com/images/M/MV5BMTk5NDM3MDYyNV5BMl5BanBnXkFtZTgwNzQwMzc4NzE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTk5NDM3MDYyNV5BMl5BanBnXkFtZTgwNzQwMzc4NzE@.jpg","plot":"A few days after being completely defeated by the woman, Yuki Minaguchi, Kinjiro Kitaeda puts on a new Shizuna-man outfit dubbed Shizuna-man Version 2. But once Nagato saw him in that armor, the atmosphere suddenly changes. He doesn't seem like the normal, passionate Kin-chan... Wanting to test out Shizuna-man Version 2, Shizuna takes Kin-chan directly to a park that night. Kin-chan starts to realize his power, but somewhere in his heart he feels uneasy. But, he cannot conceal the greatness of the power he's received. But something is different... His opponent is ...","publishedDate":"23 Sep. 2003","rating":{"count":0,"star":0}},{"idx":27,"no":"S1, Ep27","title":"Fly! Aikawa Maki","image":"https://m.media-amazon.com/images/M/MV5BMjE4MDA0NDU2MF5BMl5BanBnXkFtZTgwODY5MjUyMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjE4MDA0NDU2MF5BMl5BanBnXkFtZTgwODY5MjUyMjE@.jpg","plot":"\"Win, Maki.\" Maki Aikawa tosses her body away during the fight and realizes the true essence of fighting. She thinks. She searches. That is why she's so strong when at full power. Her opponents all know this well. The people she encounters all experiences this and changed forever. She allows them to change. Kaori Sakiyama represents one such people. From meeting with Maki, a fire was lit inside her heart and her passion level rose. She was also the first friend that Maki, someone who has lived her life fighting every day, has ever known. She's no longer a lonely ...","publishedDate":"30 Sep. 2003","rating":{"count":0,"star":0}}]}],"href":"https://m.media-amazon.com/images/M/MV5BNmJlOGIwY2YtYTZhZC00MmM1LThjY2EtNzExNWY3ODZmZDI4XkEyXkFqcGdeQXVyMjc4OTQ1OTA@._V1_.jpg","aired":"15/3/2005","rating_star":6.8,"rating_count":176,"staff":"","duration":""}}