{"warezcdn":{"imdb":"tt7848474","name":"Basilisk: Ouka Ninpouchou","href":"https://embed.warezcdn.net/serie/tt7848474","title":"Basilisk: Ouka Ninpouchou"},"imdb":{"id":"tt7848474","review_api_path":"/reviews/tt7848474","imdb":"https://www.imdb.com/title/tt7848474","contentType":"TVSeries","productionStatus":"Released","title":"Basilisk: Ouka Ninpouchou","image":"https://m.media-amazon.com/images/M/MV5BNWUxYzUwZGMtZmFiYi00YTUwLTgwNDEtNWZhODUyZjU2ZWZiXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg","images":["https://m.media-amazon.com/images/M/MV5BNjUzY2Y4MTQtMTNkOS00Mzc4LWE0YWItZmQ3Mjc5NGYwYmZjXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BZWQwZDdkN2UtN2JmOS00MTFiLWIxYTgtMzg0MGY2YTE1NDVhXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BZDViNDI2YmQtNzU3Ni00OGVhLWEzZWItZTRhOWZjNDNlYzE3XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMzJjMGUwMmUtNWViYy00N2RjLWE1MDAtMWU5NDUyYTBlYWFkXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BNzM3OWM0MjktOWE4Yy00OGVlLTg1YmEtYjM2ODQzNWRlNTA3XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BNWUxYzUwZGMtZmFiYi00YTUwLTgwNDEtNWZhODUyZjU2ZWZiXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg"],"plot":"The battle for succession that continued for three generations of shogun in the Keichou era culminated in a gruesome battle of ninja arts between the Kouga and Iga clans. Amidst a rain of flower petals, a man and woman who had dec...","rating":{"count":186,"star":4.6},"award":{"wins":0,"nominations":0},"genre":"Animation,Action,Drama","year":2018,"runtime":null,"releaseDeatiled":{"day":8,"month":1,"year":2018,"releaseLocation":{"country":"Japan","cca2":"JP"},"originLocations":[{"country":"Japan","cca2":"JP"}]},"spokenLanguages":[{"language":"Japanese","id":"ja"}],"filmingLocations":[],"actors":["Amber Lee Connors","Ricco Fajardo","Jill Harris"],"directors":[],"top_credits":[{"name":"Stars","value":["Amber Lee Connors","Ricco Fajardo","Jill Harris"]}],"seasons":[{"id":"1","name":"Season 1","episodes":[{"idx":1,"no":"S1, Ep1","title":"The Cherry Blossoms Have Fallen","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"A decade after the destruction of the Kouga and Iga ninja clans, only two survivors remain in a hidden village. But fate isn't done with the ninjas yet.","publishedDate":"8 Jan. 2018","rating":{"count":10,"star":5.2}},{"idx":2,"no":"S1, Ep2","title":"The five treasures have arrived","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"At the succession ceremony of the new shogun, takechiyo and kunichiyo are shown the ninja scroll saying iga oboro was the last to die, confirming takechiyo as the future shogun, much to kunichiyo's disappointment. Back at the ooi river the five kouga ninjas identify the assailants as iga ninja. Kaso himonji uses his grass fire technique to attack the iga and kazuma kusanagi uses his heaven's lyre whips to slash them, but an iga uses his darkness spider to cloak the area in darkness. However shichito gei'in uses his firefly squid technique to illuminate the night and ...","publishedDate":"8 Jan. 2018","rating":{"count":8,"star":5.6}},{"idx":3,"no":"S1, Ep3","title":"The kouga must die","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"In the early days of training, the young ninja practice, but are reminded by gorone negoro that they do not fight for kouga nor iga, but for their leaders. They also learn about the powers of hibiki and hachirou. Back at the ooi river gei'in and kaso rush out looking for kazuma and find him bound to a water wheel and killed by his own heaven's lyre. The meet the killer, but when kaso attacks him, his own grass fire flames consume him. He reveals his name is kujaku tsuibamu, one of the joujinshuu, enemies of both the five treasures of kouga and five flowers of iga who ...","publishedDate":"15 Jan. 2018","rating":{"count":7,"star":5.6}},{"idx":4,"no":"S1, Ep4","title":"The joujinshuu appear","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"That night iga ninja tsuta houetsu encounters a joujinshuu woman who threatens to kill him, but he trusts his defensive root barrier. She reveals her name is yasha itaru as he uses his root lasoo technique to bind her, however he makes the mistake of looking into her mirror, destiny's passage, which reflects his life, filling him with despair forcing to leap off a cliff to his death. Back at the ooi river joujin calls his attendants, kujaku tsuibamu and rinne magoroku who uses a spinning technique to transport tadanaga to akayashagaruba before the kokuuzou bosatsu or ...","publishedDate":"29 Jan. 2018","rating":{"count":7,"star":5.6}},{"idx":5,"no":"S1, Ep5","title":"The cherry blossoms run mad","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Outside jison'in village, the ninja students are confronted by a physical illusion of a huge, dark, powerful beast riding an elephant. For safety, gorone leads hachiro and hibiki to a secret tunnel in the mountain to hide while the situation is resolved. Utsutsu and shaizou try to defeat the monster's controller, neiri chiou, but his illusions are too powerful. Meanwhile hachisu and shikibu tackle the monster itself and manage to trick it into falling off a cliff, but their victory is short-lived. Rui and shichigen also try to attack neiri chiou and the monster but ...","publishedDate":"5 Feb. 2018","rating":{"count":6,"star":5.2}},{"idx":6,"no":"S1, Ep6","title":"Evil clouds begin to stir","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"In 1630, four years later, in edo castle tokugawa hidetada strips tadanaga of his lands and privilege for killing monkeys at sengen shrine at suruga. Later that year, hidetada passes away from illness, and his funeral is held in secret according to his wishes. A year later, tadanaga is exiled at takasaki castle in the distant land of joushuu (kozuke province). Several years later, the young ninjas have grown while continuing their training in preparation for the day their enemies reappear. They have not seen hachiro since the battle with joujin and his agents, ...","publishedDate":"12 Feb. 2018","rating":{"count":5,"star":5.6}},{"idx":7,"no":"S1, Ep7","title":"Tadanaga's change of heart","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Namenba infiltrates edo castle to speak to the shogun. She is intercepted by the iga kurokuwa, but although she kills them all, she suspects someone helped her. She dribbles a truth potion in the sleeping shogun's mouth and questions him. She finds that he knows nothing about joujin who appears to be acting without the shogun's authority. As she escapes, she encounters hadaebou who was her mysterious ally. At jison'in village the ninja girls discuss the dark moving castle or houren ( imperial carriage) which hibiki believes is transporting the joujinshuu. In takasaki ...","publishedDate":"19 Feb. 2018","rating":{"count":5,"star":5.6}},{"idx":8,"no":"S1, Ep8","title":"The advent of joujin","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"In a flashback to 18 years earlier in edo castle, tenkai is seen proposing a ninja duel to the shogun to settle his succession and save a costly war between opposing samurai. In the present, tadanaga's commander bunnoshin, prepares to trap hachiro, firstly by a group of archers commanded by a man with sensitive hearing who can direct their arrows to avoid hachiro's dojutsu technique. However a flight of crickets sent by shichigen distracts him, enabling hachiro to use his dojutsu to destroy them all. The next trap uses riflemen commanded by the master marksman gorouza...","publishedDate":"26 Feb. 2018","rating":{"count":5,"star":5.6}},{"idx":9,"no":"S1, Ep9","title":"The butterfly dances","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Joujin tells tadanaga that he could become a god like the samurai oda kazusanosuke nobunaga. Utsutsu and rui continue the fight the pursuing rain fighters but are outnumbered however, their ninja comrades and namemba appear and assist them. Back at the village, gorone examines utsutsu's sketch of the murakumo while namemba tells him about her conversation with the monk, nankoubou tenkai, most trusted councilor of lord ieyasu who asked for the ninja's help defeating the common enemy, the joujinshuu. The ninja regroup at their cafe and learn about hachiro's meeting with...","publishedDate":"5 Mar. 2018","rating":{"count":5,"star":5.4}},{"idx":10,"no":"S1, Ep10","title":"The heavenly robe sees carnage","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Seventeen years ago, in the 20th year of the keichou era, at osaka, during the summer campaign, handmaid otashi reveals to senhime that she is in fact namemba, an iga ninja. In the present at edo castle, tenkai is trying to find tadanaga and calls in hadaebou. Hadaebou travels to jison'in village and asks for the ninja's assistance to defeat joujin and the murakumo, but they are reluctant to become involved. Meanwhile the kishuu prepare to attack the murakumo with canons, but joujin reassures tadanaga that they are well-defended. He opens fire with his own canons, ...","publishedDate":"12 Mar. 2018","rating":{"count":5,"star":5.6}},{"idx":11,"no":"S1, Ep11","title":"Like a rhinoceros","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"While shikibu kora is being fitted for new armor, gorone explains that he must move like a rhinoceros, wandering in a single direction. Suddenly, the ninjas detect that they have intruders, and hachisu goes to intercept them. She shoots two of them, but the third, a huge one-eyed man wrapped in torn bandages is not affected by her bullets and manages to corner her. Shikibu arrives and grabs him, but he has same strength abilities as shikibu and he forces shikibu and hachisu to fall into a rocky crevasse. In a flashback, shikibu is shown as a young boy, wrapped in ...","publishedDate":"19 Mar. 2018","rating":{"count":5,"star":5.6}},{"idx":12,"no":"S1, Ep12","title":"The wind blows through the pines","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"The four ninja, rui, shichigen, shaizou and utsutsu, leave to implement gorone's plan to destroy the murakumo. A short while later, hachisu and shikibu return to the village. The four ninja approach the murakumo by boat and rui and shichigen prepare to engage the defending rain fighters. In a flashback, the young shichigen recalls how he began to control insects. Outside the murakumo, rui distracts a group of the rain while shichigen cuts them down. However, it's a trap and they come under heavy rifle fire from the rain and shichigen is shot in the thigh. Meanwhile, ...","publishedDate":"26 Mar. 2018","rating":{"count":5,"star":5.6}},{"idx":13,"no":"S1, Ep13","title":"Utsutsu dreams of hell","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Rui and shichigen part ways with hachiro and then fire a flare to call the others for assistance. As shaizou and utsutsu go to their aid, they are also surrounded by the rain. Utsutsu uses her dreaming reality technique, but one of the rain throws a smoke bomb, neutralizing the effect of her illusions. Shaizou then uses his eyes to spread her illusions, consuming the rain with fear, but also effecting himself. In a flashback, the young utsutsu spends half of her time in a room dominated by a huge painted mandala depicting hell, which her father explains is to develop ...","publishedDate":"2 Apr. 2018","rating":{"count":5,"star":5.8}},{"idx":14,"no":"S1, Ep14","title":"Murakamo must be destroyed","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Hachiro attacks joujin, and hadaebou takes the opportunity to continue his mission. Joujin easily defeats hachiro, but then surprisingly sheathes his sword. The group of ninja regroup and shaizou tries to analyse kujaku's inverted halberd of time technique by firing test cannon balls at the murakumo. Hadaebou gains entry to the murakumo but realizes that tadanaga no intention of returning and has fully allied himself with joijin. Meanwhile joijin tries to convince hachiro to join him, but hachiro refuses and then escapes when hibiki and shikibu create a diversion. ...","publishedDate":"9 Apr. 2018","rating":{"count":5,"star":5.8}},{"idx":15,"no":"S1, Ep15","title":"The shielding eye is deceived","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"In edo, tenkai receives credit for the destruction of the murakumo, with no mention of the ninjas. Although the murakumo exploded, gorone is suspicious about its fate as no debris were left behind. The ninjas return to operating their café but maintain a lookout for the joujinshuu. While walking shichigen sees visions of himself and his parents in the past, but it's the combined work of the joujinshuu. In kyoto, hachiro searches for the old kamagawa village, and is told that the ghost of nobunaga has been seen there. Meanwhile hibiki has a vision created by joujin ...","publishedDate":"16 Apr. 2018","rating":{"count":5,"star":5.4}},{"idx":16,"no":"S1, Ep16","title":"The massive castle rumbles","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Namemba and hachisu see hibiki being taken into the new murakumo by the joujinshuu. Hachisu attacks the rain lookouts to get closer, she is surprised to be assisted by hadaebou. Back in the village, hachisu, rui, utsutsu and namemba plan to rescue hibiki. In a quiet moment during the preparations, gorone and namemba recall their first meeting. Later, namemba and hachisu plant explosives in the murakumo's path to stop it, but they are ineffective. Again they meet hadaebou, and this time namemba and hachisu reluctantly agree to work with him. Elsewhere, hachiro ...","publishedDate":"23 Apr. 2018","rating":{"count":5,"star":5.6}},{"idx":17,"no":"S1, Ep17","title":"Everyone gathers at the battlefield","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Hibiki realizes that the woman she sees is her mother oboro who blames kouga gennosuke for her fate. In a break from fighting the rain, rui surprisingly tells utsutsu that she loves her. While hadaebou scales the murakumo, hachiro is confronted by itaru's destiny's passage and rinne magoroku's adamantite tower, but he uses his dojutsu and they withdraw. Meanwhile namemba recalls her youth and time with rui, and their escape when their village was attacked. Hadaebou finally reaches tadanaga, and tries to convince him to return to edo.","publishedDate":"30 Apr. 2018","rating":{"count":5,"star":5.6}},{"idx":18,"no":"S1, Ep18","title":"The cherry blossoms must fall","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Neiri chiou creates a demon god illusion to knock namemba and hachisu from the wall of the murakumo where they meet hachiro and shichigen. Meanwhile, hadaebou tries to convince tadanaga to leave joujin, however joujin intercedes and, and tells him that he will be merely be the vessel to revive oda kazusanosuke nobunaga. Joujin uses his powers to force tadanaga to stab hadaebou and then offers tadanaga the opportunity to commit seppuku. Instead, tadanaga rants at joujin, cursing him forever and is decapitated instead. Still alive, hadaebou grabs tadanaga's head and ...","publishedDate":"7 May 2018","rating":{"count":5,"star":5.8}},{"idx":19,"no":"S1, Ep19","title":"100 eyes see their destiny","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Hachirou enters the castle at last, as Saizou falls victim to Yasha Itaru's Destiny's Passage.","publishedDate":"14 May 2018","rating":{"count":5,"star":5.6}},{"idx":20,"no":"S1, Ep20","title":"We must see the lotus flowers together","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Shikibu and hachisu attack the murakumo in a frontal assault, while inside, hachiro fights off hibiki who is being controlled by joujin. Hachiro defenselessly lets hibiki attack him and stops her, but, convinced by joijin that she is oboro, she calls him gennosuke. Then, rinne magoroku tries to use his adamantite tower to control hachiro. Meanwhile shichigen, rui and utsutsu travel up through the murakumo. Shichigen encounters yasha itaru who uses her destiny's passage mirror to creates the illusion that she is his mother. Controlled by itaru, shichigen then attacks ...","publishedDate":"21 May 2018","rating":{"count":6,"star":6}},{"idx":21,"no":"S1, Ep21","title":"Remembrance must fade","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Rui and utsutsu find neiri chiou, and rei manages to stab him. However, after they leave, his body heals itself and they encounter him again, with his demon god displaying the wounds neiri chiou sustained himself. They then meet shichigen who is being controlled by itaru. Meanwhile, namemba returns to the murakumo with explosives and meets hadaebou who offers to help her. Inside, shichigen, under the control of itaru, attacks rui and utsutsu, but rui manages to reach through to him and he stabs himself with his katana, which simultaneously does the same to neiri chiou...","publishedDate":"28 May 2018","rating":{"count":5,"star":5.6}},{"idx":22,"no":"S1, Ep22","title":"The demon revives","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Joujin prepares to kill both hachiro and hibiki, while rui and utsutsu lie dying on the giant stairway. Hadaebou attacks kujaku while hachiro attacks joujin. Suddenly illusions created by rui and utsutsu confuse joukin, opening him to hibiki's attack. Wounded, joujin advances on hibiki, only to be stabbed from behind by kujaku. Kukaku recalls in 1582 when he was called ranmaru, as his master nobunaga's compound went up in flames, nobunaga gave him the name kujaku and bid him live on to keep his dream of conquest alive. Kujaku still serves his original master, and as ...","publishedDate":"4 Jun. 2018","rating":{"count":5,"star":5.8}},{"idx":23,"no":"S1, Ep23","title":"The cherry blossoms scatter","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Nobunaga attacks hachiro, and during the swordfight hachiro uses his ouka. Nobunaga stabs himself, but there is no blood and he does not die. Namemba jumps to their aid, enveloping nobunaga in cloth and setting off an explosion, but at the cost of her own life. As the smoke clears, nobunaga appears to be still alive, but tadanaga's consciousnesses fights him for control of the body and he severs his own head to finally thwart nobunaga's plans. As hachiro and hibiki flee, kujaku uses his last bit of energy to smash his inverted halberd of time, but rinne magoroku uses ...","publishedDate":"11 Jun. 2018","rating":{"count":5,"star":5.4}},{"idx":24,"no":"S1, Ep24","title":"The cherry blossoms bloom","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"In the alternate world, hachiro and hibiki easily defeat the joujinshuu because they already know their techniques, leaving only joujin standing. They use their ouka to defeat joujin, and hachiro kills him. Hachiro plans to leave hibiki, but she cuts her eyes, so he will stay with her. However, joujin is not dead, surviving because of the power of tenzen within him. Joujin cuts hachiro, but hachiro manages to use his ouka to awaken tenzen's hatred for hachiro to force joujin to kill himself before hachiro dies. Some time later, the blind hibiki is present at the early...","publishedDate":"18 Jun. 2018","rating":{"count":5,"star":5.4}}]}],"href":"https://m.media-amazon.com/images/M/MV5BNWUxYzUwZGMtZmFiYi00YTUwLTgwNDEtNWZhODUyZjU2ZWZiXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg","aired":"8/1/2018","rating_star":4.6,"rating_count":186,"staff":"","duration":""}}