{"warezcdn":{"imdb":"tt0328733","name":"Beyblade","href":"https://embed.warezcdn.net/serie/tt0328733","title":"Bakuten shoot beyblade"},"imdb":{"id":"tt0328733","review_api_path":"/reviews/tt0328733","imdb":"https://www.imdb.com/title/tt0328733","contentType":"TVSeries","productionStatus":"Released","title":"Bakuten shoot beyblade","image":"https://m.media-amazon.com/images/M/MV5BNGIzNDViMjAtYzYwZS00MzJlLTkyZTUtYzZlOWFkYmEyMTdlXkEyXkFqcGdeQXVyNjk1Njg5NTA@._V1_.jpg","images":["https://m.media-amazon.com/images/M/MV5BMzQxZmE2MTQtZWI0OC00ZDMyLTllMzgtMDE5OTlhNDZmZTQ2XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BNzdkMzc2NjYtYTRmNi00NThjLWE0YTYtZDRjYzEwNWMxODc1XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BYzY3ZDFhMzItY2U2Zi00M2U5LWFjMGQtYjNjZmRlZjEwMDk4XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BOGRhY2RlMjEtYTE2Ny00NWQwLThkNmUtNGRiMTI5MjA3NjY4XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BZjIxZTQ3YWQtMzI4Zi00ODgzLWE4OWItMzU0NGVjYmVjYTcyXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BODFjODllMDMtNjJiNy00ODViLWEyMTMtNGQ1Y2JjNTkwOWVmXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BODlhNDUzODQtYThkMi00NmM5LTgzYTctNmEzY2FkNzE2YWZiXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BNzU3NGM4ZDgtNWExZS00YWZiLWE3ODItY2QzNTMxYmVmYTNmXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BZmFkYzUwYjQtNzNhNS00YThmLWI0ZDAtZjAyZjliYTY3OTdiXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMjM1MzcxNTktNzNmYS00MjRhLThhOWUtM2I3OGUyMDViOThlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BN2RjMTJjOGEtNzdkMi00YzVmLWJmYzgtZmVlNmU4NTQ4NTAzXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BM2ZiYmU4MmEtMTZjNC00NjQ5LTgwZTMtYjA0NDRjMDE5MGZjXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BNDg4NWFhZDctNGRmNS00YTAxLTlkZGItZmM2YWNmZDhiYjBhXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg"],"plot":"Four beybladers and their genius friend travel the world as team 'Bladebreakers' to win a championship, realizing there's much more at stake on the go.","rating":{"count":6442,"star":6.8},"award":{"wins":0,"nominations":0},"contentRating":"TV-Y7","genre":"Animation,Action,Adventure","year":2002,"runtime":null,"releaseDeatiled":{"day":6,"month":7,"year":2002,"releaseLocation":{"country":"United States","cca2":"US"},"originLocations":[{"country":"Canada","cca2":"CA"},{"country":"Japan","cca2":"JP"},{"country":"Spain","cca2":"ES"}]},"spokenLanguages":[{"language":"English","id":"en"},{"language":"Japanese","id":"ja"}],"filmingLocations":[],"actors":["Marlowe Gardiner-Heslin","Alex Hood","Gage Knox"],"directors":[],"top_credits":[{"name":"Stars","value":["Marlowe Gardiner-Heslin","Alex Hood","Gage Knox"]}],"seasons":[{"id":"3","name":"Season 3","episodes":[{"idx":1,"no":"S3, Ep1","title":"New Kid in Town","image":"https://m.media-amazon.com/images/M/MV5BMTQ4MTEwOTQ0NF5BMl5BanBnXkFtZTgwOTUyNTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTQ4MTEwOTQ0NF5BMl5BanBnXkFtZTgwOTUyNTczMjE@.jpg","plot":"Tyson has just returned back from the World Championships with another victory and he's decided to teach a class of boys in the neighborhood the fine art of blading. Just as he begins his session, a cocky kid comes down from the hills and challenges Tyson to a battle. His name is Daichi and the battle begins with the challenger going for the jugular and has put the champ in a real spot! And what's worse, Daichi's blade copycats Tyson's every move, stealing power from him as the battle progresses!But it's Tyson who finally wins the battle by calling out his Galaxy ...","publishedDate":"18 Sep. 2004","rating":{"count":28,"star":8}},{"idx":2,"no":"S3, Ep2","title":"A Team Divided","image":"https://m.media-amazon.com/images/M/MV5BMTY1MzE5NzI0MF5BMl5BanBnXkFtZTgwNzQ0NTE1NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTY1MzE5NzI0MF5BMl5BanBnXkFtZTgwNzQ0NTE1NTE@.jpg","plot":"The first battle between Team Psykick and the Bladebreakers has begun! Max fights bravely against Jim and Cyber Draciel... and his teammates aren't the only ones interested in the outcome of the battle. Dr. B and Gideon watch from the sidelines, and the Saint Sheilds are there to watch their backs. Max defeats Jim, but amazingly, Cyber Draciel is repaired! It seems Team Psykick has the ability to repair their cyber bit beasts immediately. Even though everyone warns him against it, Max goes back for another round. This time, he isn't so lucky... the powerful Cyber ...","publishedDate":"25 Sep. 2004","rating":{"count":27,"star":6.8}},{"idx":3,"no":"S3, Ep3","title":"Invitation to Battle","image":"https://m.media-amazon.com/images/M/MV5BNjk1MTg0OTA3MF5BMl5BanBnXkFtZTgwMjExNTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNjk1MTg0OTA3MF5BMl5BanBnXkFtZTgwMjExNTczMjE@.jpg","plot":"Daichi continues to annoy Tyson with his constant battle challenges, which Tyson refuses to give in to - even after an embarrassing confrontation at the public swimming pool proves that Daichi is an impressive and highly skilled Beyblader. Meanwhile, Jin sends Tyson an invitation to a private battle, but Ray intercepts the message, and arrives in Tyson's place. Ray ultimately loses the grueling match, but Jin is suitably impressed, and decides that Tyson has chosen his friends wisely","publishedDate":"2 Oct. 2004","rating":{"count":27,"star":6.8}},{"idx":4,"no":"S3, Ep4","title":"We Were Once Bladebreakers...","image":"https://m.media-amazon.com/images/M/MV5BMTQ4OTExMTY4NF5BMl5BanBnXkFtZTgwMjAxNTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTQ4OTExMTY4NF5BMl5BanBnXkFtZTgwMjAxNTczMjE@.jpg","plot":"Daichi and Tala have both been thrown from the dish at the same time, resulting in a tie game. Because they are in no condition for a rematch, Mr. Dickenson rules that the next match will determine the new tournament Champion. It all comes down to Kai and Tyson. Kai shows up for the match battered and bruised from his training session with Spencer and Bryan, just so he can put himself at Tyson's level of physical exhaustion, since Tyson had already battled earlier in the day. Kai wants them to be evenly matched so that he won't have any advantage in battle.Because of ...","publishedDate":"9 Oct. 2004","rating":{"count":27,"star":6.8}},{"idx":5,"no":"S3, Ep5","title":"A League of His Own","image":"https://m.media-amazon.com/images/M/MV5BMTY4NDk5NjQ2OV5BMl5BanBnXkFtZTgwODA5NzczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTY4NDk5NjQ2OV5BMl5BanBnXkFtZTgwODA5NzczMjE@.jpg","plot":"At the preliminaries for the World Championships, Daichi wins his matches easily, establishing himself as a new powerhouse on the Beyblading scene. Kenny also competes, defeating his opponents with such skill that even Tyson is impressed. Nobody thinks anything when a fan named Kotaro asks for an autograph and takes advantage of the opportunity to examine Tyson, Kenny and Daichi's Beyblades. But when he shows up as competitor and defeats Kenny with the Chameleon Fake, everyone is alarmed. Does Kotaro's Chameleon Bey have the ability to copy attacks as well as colors ...","publishedDate":"16 Oct. 2004","rating":{"count":22,"star":7.4}},{"idx":6,"no":"S3, Ep6","title":"You're the Man, Kai!","image":"https://m.media-amazon.com/images/M/MV5BOTY4MTQzMzYzNV5BMl5BanBnXkFtZTgwNDMxNTA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BOTY4MTQzMzYzNV5BMl5BanBnXkFtZTgwNDMxNTA5NTE@.jpg","plot":"There's only one round left in the tournament to decide who's going to partner up with Tyson in the World Beyblade Tag Team Championships and it's between Daichi and Kai. When Daichi finds out it's a tag team event and he's not going to go up against Tyson, he's totally enraged, but decides to beat Kai anyway. Meanwhile, the mysterious Jin is lurking around the dressing room listening in on our hero's conversations. When the finals in Block B begin, a radical jungle dish is revealed which gives Daichi the edge. Quickly, the underdog starts slamming and attacking Kai ...","publishedDate":"23 Oct. 2004","rating":{"count":18,"star":7.7}},{"idx":7,"no":"S3, Ep7","title":"Take Your Best Shot!","image":"https://m.media-amazon.com/images/M/MV5BOWRkOGVkNjEtYTI2OC00ZWY3LTg1ZDAtYTUyZTc5YmM0ZDg4XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BOWRkOGVkNjEtYTI2OC00ZWY3LTg1ZDAtYTUyZTc5YmM0ZDg4XkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"The Block A and Block B finals of the Beyblade World Championships are underway. Max wins his match and finds himself partnered with a real bully of a blader named Rick. Tyson watches the event on T.V. anxious to get in the stadium and unleash his blade Dragoon. Meanwhile Kenny discovers the real physical aspects of Beyblading. Kai watches as his friends Max and Ray win the final matches of their respective blocks for other teams. This causes him to question his loyalty to Tyson. To make matters worse, a new team comes out of nowhere and poses a threat to Tyson and ...","publishedDate":"30 Oct. 2004","rating":{"count":15,"star":7}},{"idx":8,"no":"S3, Ep8","title":"Roughing It","image":"https://m.media-amazon.com/images/M/MV5BMTUyMTgwODg0MV5BMl5BanBnXkFtZTgwMzExNTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTUyMTgwODg0MV5BMl5BanBnXkFtZTgwMzExNTczMjE@.jpg","plot":"The BBA Revolution Team heads to a remote training camp to prepare for the upcoming tournament. When they first arrive, Hiro tells Tyson that Kai has quit the team. Tyson is ready to quit to, but Hiro convinces him to choose a new partner. Tyson picks Daichi, then whisks him off into the wilderness to teach him survival skills as they relate to Beyblading. The plan works well until Tyson strays from the main path, and gets himself and Daichi hopelessly lost. From there it's one disaster after another: They fall in the river, lose all their equipment, and eventually ...","publishedDate":"6 Nov. 2004","rating":{"count":20,"star":7.1}},{"idx":9,"no":"S3, Ep9","title":"Swiped on the Streets","image":"https://m.media-amazon.com/images/M/MV5BZDY3MTg2NjctZTA1Yi00YTVjLTk5MzgtNjBlYTgyNmNjMTQzXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BZDY3MTg2NjctZTA1Yi00YTVjLTk5MzgtNjBlYTgyNmNjMTQzXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"The BBA Revolution team fly to New York City for the Beyblade World Championships. The normally feisty Daichi proves to be afraid of flying, and once in the city, he becomes overwhelmed by the size and scope of things in the Big Apple. While eating lunch in a sidewalk café, Tyson and Daichi have their beyblades stolen by a young pickpocket and together they scouring the streets for the culprit. Tyson meanwhile, exhibits his first real sympathy for his diminutive teammate, and vows to go easier on him. Just as the pair are about to give up the search, Tyson hears the ...","publishedDate":"13 Nov. 2004","rating":{"count":17,"star":7.7}},{"idx":10,"no":"S3, Ep10","title":"It's a Battle Royale...!","image":"https://m.media-amazon.com/images/M/MV5BMTQ3ODY2ZmMtMDZhOC00YTg0LWFmNzktMTQ1NWE5NzY3Yzk3XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTQ3ODY2ZmMtMDZhOC00YTg0LWFmNzktMTQ1NWE5NzY3Yzk3XkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"The teams have been selected and the finals are about to begin... Unfortunately Tyson finds himself facing all of his former friends... each part of a team that he will eventually have to 'blade against. The biggest blow that Tyson receives, is seeing Kai as a member of the Blitzkrieg Boys! After confronting his sullen, ex-teammate, Kai suggests to Tyson that the reason he left is because his old team just wasn't good enough! Tyson is insulted to the core... even more so when Ray chooses to let Lee face-off against Tyson in the first match, White Tiger X versus BBA ...","publishedDate":"20 Nov. 2004","rating":{"count":16,"star":7}},{"idx":11,"no":"S3, Ep11","title":"The Blame Game","image":"https://m.media-amazon.com/images/M/MV5BMjI0NzMwNTQ2NF5BMl5BanBnXkFtZTgwNDA5NzczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjI0NzMwNTQ2NF5BMl5BanBnXkFtZTgwNDA5NzczMjE@.jpg","plot":"Tyson blames his embarrassing loss to Ray on Daichi, telling the team he's better off competing alone. As Tyson runs away, the US Finals continue with Rick of the PPB All Starz against Claude of Barthez Battalion. Claude's skill gives him the upper hand until Rick's unleashes his full power, destroying the stadium to get to Rapid Eagle. Barthez orders Claude not to avoid the shrapnel and he is injured, turning the crowd against the PPB All Starz. Despite losing, Barthez is delighted to have undermined the US's popularity. Hiro finds Tyson and challenges him to a duel,...","publishedDate":"27 Nov. 2004","rating":{"count":21,"star":7}},{"idx":12,"no":"S3, Ep12","title":"When in Rome... Let It Rip!","image":"https://m.media-amazon.com/images/M/MV5BZDE0YzAzMDAtYTQwNC00MjNiLTgzMDQtNWM3ZTNlZjliNjQ4XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BZDE0YzAzMDAtYTQwNC00MjNiLTgzMDQtNWM3ZTNlZjliNjQ4XkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"The Beyblade World Tag Team Championships are about to start in Rome as Barthez busily prepares his team for the big event. He's even invited a television news crew to document his efforts as a coach. Unfortunately, Barthez's personality slips through on occasion revealing the truth about how much a tyrant he really is. The Italian tournament begins and it's Barthez Battalion against White Tiger X. Ray starts for the Tigers going up against Claude. In mere seconds, Ray pulls off a victory that sets off alarm bells among the other competitors who think something is ...","publishedDate":"4 Dec. 2004","rating":{"count":16,"star":7.2}},{"idx":13,"no":"S3, Ep13","title":"Kenny's Big Battle","image":"https://m.media-amazon.com/images/M/MV5BODFjODllMDMtNjJiNy00ODViLWEyMTMtNGQ1Y2JjNTkwOWVmXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BODFjODllMDMtNjJiNy00ODViLWEyMTMtNGQ1Y2JjNTkwOWVmXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"Tyson gets in a huff and leaves the team after he is dropped from the lineup against the Blitzkrieg Boys. This leaves Kenny and Daichi to pick up the slack against their opponents. Feeling rejected, Tyson wanders off and runs into a strange old man named Tao who takes him shopping. Meanwhile the competition rolls on and the PPB All Stars are victorious. Next up, the Blitzkrieg Boys face off against the BBA Revolution without Tyson. Daichi wins his match and Kenny nervously goes to the beystadium to face his opponent Tala. During the battle, Kenny finds himself way out...","publishedDate":"11 Dec. 2004","rating":{"count":15,"star":7.1}},{"idx":14,"no":"S3, Ep14","title":"Picking Up the Pieces","image":"https://m.media-amazon.com/images/M/MV5BODA0OTA5NTM2M15BMl5BanBnXkFtZTgwMjEyNDA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BODA0OTA5NTM2M15BMl5BanBnXkFtZTgwMjEyNDA5NTE@.jpg","plot":"In the second of a best of three match, Tala thinks he's broken Kenny down, but Kenny summons his inner strength and attacks with all of his combined power. Unfortunately, it's not enough, and Tala shatters Kenny's Hopper into pieces with his Novae Rog attack. Kenny loses the match, but in the process spots a major weakness in Tala's game. Daichi is called to take on Tala in the tie-breaker. Tyson is desperate for the win, and tries to convince Tala to let him fight in Daichi's place. Tala refuses, and Daichi is furious that Tyson has so little faith in his abilities....","publishedDate":"18 Dec. 2004","rating":{"count":14,"star":7}},{"idx":15,"no":"S3, Ep15","title":"Sleepless in Madrid","image":"https://m.media-amazon.com/images/M/MV5BMTEzODU3NDUzNjReQTJeQWpwZ15BbWU4MDc1ODcxOTUx._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTEzODU3NDUzNjReQTJeQWpwZ15BbWU4MDc1ODcxOTUx.jpg","plot":"In Madrid for the Spanish leg of the World Championships, the hard-of-sleeping Lee has a nightmare that Ray kicks him off the team for his poor play. The day before their next match, White Tiger X encounters a pair of beyblading jugglers in Madrid's main square, who also happen to be trick bladers. When Lee criticizes their performance, he and Ray are challenged to an impromptu match. The jugglers beat them handily, which only exacerbates Lee's insecurity about his skills. Ray suspects that Lee's problem stems not only from a lack of sleep lately, but from a lack of ...","publishedDate":"25 Dec. 2004","rating":{"count":15,"star":6.7}},{"idx":16,"no":"S3, Ep16","title":"Fire and Water","image":"https://m.media-amazon.com/images/M/MV5BMTQzNTE2ODc1OF5BMl5BanBnXkFtZTgwMjYwNjE1NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTQzNTE2ODc1OF5BMl5BanBnXkFtZTgwMjYwNjE1NTE@.jpg","plot":"As Max prepares to face Kai in the next round, the members of BBA Revolution overhear a confrontation between Johnny and Robert of the Majestics and Barthez Battalion. It turns out Barthez Battalion won their qualifying tournament through trickery. Thanks to Kenny, the teams find proof of Barthez's underhanded tactics but it's too late to disqualify them from the Championships. Armed with his new Draciel Gravity, Max takes Kai to the edge of defeat only to end up defeated himself. Rick uses his frustration at the loss to overcome Tala and goes on to face Kai in a ...","publishedDate":"1 Jan. 2005","rating":{"count":21,"star":7.3}},{"idx":17,"no":"S3, Ep17","title":"Same Old Dirty Tricks...","image":"https://m.media-amazon.com/images/M/MV5BNDRjYmM5NDYtZThlYi00YTE3LTk3M2MtMzk1MTQyMDg0NzBjXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNDRjYmM5NDYtZThlYi00YTE3LTk3M2MtMzk1MTQyMDg0NzBjXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"The BBA Revolution are slated to face the sneaky Barthez Battalion, but while Hilary and Kenny want to report their dirty deeds to the authorities, Tyson believes the best way to teach them a lesson is to beat them fair and square... But that's before he really sees how low the team will sink to win. When Mathilda blows up her beyblade on purpose, just to cause damage to Daichi's Strata Dragoon, Tyson and his team are shocked... But Tyson stands his ground! Although Daichi wants to give Jean Paul Barthez himself a piece of his mind... Tyson holds him back, knowing ...","publishedDate":"8 Jan. 2005","rating":{"count":15,"star":6.8}},{"idx":18,"no":"S3, Ep18","title":"Beyblade Like an Egyptian","image":"https://m.media-amazon.com/images/M/MV5BMTExMjIwMDM1OTBeQTJeQWpwZ15BbWU4MDAwMDA2MTcx._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTExMjIwMDM1OTBeQTJeQWpwZ15BbWU4MDAwMDA2MTcx.jpg","plot":"Our heroes land in Egypt for the next leg of the tournament where the first two teams going up against each other are the Blitzkrieg Boys against the Barthez Battalion. But as Barthez readies his team, we learn he's devised a special spider web-like tape that is supposed to shoot out of his team's blades and trap their opponents in an inescapable web. Miguel is torn and knows that if they follow his coach's plan they could win, but he feels he'd rather lose with respect than cheat. In the first battle, Aaron goes up against Tala. Barthez tells his players to just act ...","publishedDate":"15 Jan. 2005","rating":{"count":16,"star":7.2}},{"idx":19,"no":"S3, Ep19","title":"One for All... Free for All!","image":"https://m.media-amazon.com/images/M/MV5BODIxMjcwOTcxMF5BMl5BanBnXkFtZTgwNDUyNjQzNjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BODIxMjcwOTcxMF5BMl5BanBnXkFtZTgwNDUyNjQzNjE@.jpg","plot":"Max is having trouble convincing Rick that he is truly dedicated to the PPB All Starz. Max just wants to play for love of the game but Rick thinks he should do anything to win. When the competition continues Max demands they fight a \"pairs\" match so that he and Rick are forced to work as a team. Rick's ego gets the best of him and soon he finds himself not only battling the White Tiger X team but Max as well. Mariah tells Ray and Lee of White Tiger X that they should battle each other and find out who is the best blader out of the four of them. A beyblading free for ...","publishedDate":"22 Jan. 2005","rating":{"count":15,"star":7.1}},{"idx":20,"no":"S3, Ep20","title":"Burdens of a Champion","image":"https://m.media-amazon.com/images/M/MV5BNjIzNzQ2NDM1M15BMl5BanBnXkFtZTgwNzkwNjQzNjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNjIzNzQ2NDM1M15BMl5BanBnXkFtZTgwNzkwNjQzNjE@.jpg","plot":"The Egyptian leg of the World Championships culminates with the final match highlighting F Dynasty against the BBA Revolution. The day before the match, Tyson has Daichi practice moves with him that they're not usually accustomed to doing: namely, tag-team attacks. F Dynasty is renowned for their tag-team abilities, and Tyson wants nothing more than to beat them at their own game. He knows this will be a challenge, as F Dynasty has already used the tag-team format to defeat White Tiger X earlier in the tournament. But as the former Beyblade world champion, Tyson feels...","publishedDate":"29 Jan. 2005","rating":{"count":15,"star":6.8}},{"idx":21,"no":"S3, Ep21","title":"Under Pressure","image":"https://m.media-amazon.com/images/M/MV5BMTg3Mzg3NzIxMl5BMl5BanBnXkFtZTgwMDI5NzczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTg3Mzg3NzIxMl5BMl5BanBnXkFtZTgwMDI5NzczMjE@.jpg","plot":"Tyson gets in a huff and leaves the team after he is dropped from the lineup against the Blitzkrieg Boys. This leaves Kenny and Daichi to pick up the slack against their opponents. Feeling rejected, Tyson wanders off and runs into a strange old man named Tao who takes him shopping. Meanwhile the competition rolls on and the PPB All Stars are victorious. Next up, the Blitzkrieg Boys face off against the BBA Revolution without Tyson. Daichi wins his match and Kenny nervously goes to the beystadium to face his opponent Tala. During the battle, Kenny finds himself way out...","publishedDate":"5 Feb. 2005","rating":{"count":22,"star":7.3}},{"idx":22,"no":"S3, Ep22","title":"Sibling Rivalry","image":"https://m.media-amazon.com/images/M/MV5BMTQ0OTQ0NjQ2OF5BMl5BanBnXkFtZTgwODY3NTQzNjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTQ0OTQ0NjQ2OF5BMl5BanBnXkFtZTgwODY3NTQzNjE@.jpg","plot":"The final elimination round is underway, with F Dynasty trying to earn the last play-off slot, while their opponents, the already mathematically eliminated Barthez Battalion try to spoil their chances. Feeling like the weak link of the team, Raul surprises Julia by insisting he battle solo for F Dynasty, in order to prove his worth. Julia reluctantly agrees. In the first match Julia easily defeats Miguel, piling even more pressure on Raul. Raul is up against Mathilda of Barthez Battalion (who is using a combination of parts from her team's Beyblades) in the second ...","publishedDate":"12 Feb. 2005","rating":{"count":15,"star":7}},{"idx":23,"no":"S3, Ep23","title":"Ray and Kai: The Ultimate Face-Off...","image":"https://m.media-amazon.com/images/M/MV5BNzdkMzc2NjYtYTRmNi00NThjLWE0YTYtZDRjYzEwNWMxODc1XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNzdkMzc2NjYtYTRmNi00NThjLWE0YTYtZDRjYzEwNWMxODc1XkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"With Lee losing to Tala early in the match, White Tiger X is a game down, and Kai now steps up to battle for the Blitzkrieg Boys. This round is sure to be intense, as old teammates face off in the dish. Ray will represent White Tiger X, and the world is watching. The pressure seems too much for the players, as Ray collapses from the strain. Somehow he finds the strength to keep going, and the desire to bring Kai down! The intensity rises as the battle continues, with both players on either side of the dish so evenly matched, who can predict which one will walk away ...","publishedDate":"19 Feb. 2005","rating":{"count":16,"star":7.3}},{"idx":24,"no":"S3, Ep24","title":"Down Under Thunder!","image":"https://m.media-amazon.com/images/M/MV5BMTUyNDg2OTQ5NV5BMl5BanBnXkFtZTgwMDQzNjQzNjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTUyNDg2OTQ5NV5BMl5BanBnXkFtZTgwMDQzNjQzNjE@.jpg","plot":"The tournament in Australia continues and this round pits the PPB All Starz against Tyson and the BBA Revolution. The first battle sees Daichi playing against Rick. Daichi seems a little over confident going into battle as his sights are set on the bigger prize, fighting in the finals with Tyson. Rick on the other hand is more realistic. He understands where he comes from and that he's lucky to be where he is, yet he too wants to get this battle behind him. The fight is a tough one. In fact, the combatants are going at it so hard that the entire arena is filled with ...","publishedDate":"26 Feb. 2005","rating":{"count":15,"star":6.8}},{"idx":25,"no":"S3, Ep25","title":"Max Attacks!","image":"https://m.media-amazon.com/images/M/MV5BM2ZiYmU4MmEtMTZjNC00NjQ5LTgwZTMtYjA0NDRjMDE5MGZjXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BM2ZiYmU4MmEtMTZjNC00NjQ5LTgwZTMtYjA0NDRjMDE5MGZjXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"Tyson and Max face off against each other in the semi-final of the World Beyblading Championships. The two old friends use two totally different blading styles in the dish. Tyson takes the offense while Max hangs back and chooses for a more defensive style. Tyson has a tough time battling Max and when Dragoon starts to lose power he starts his engine gear. When he goes in for the final hit, Max suddenly goes on the offense and starts Draciel's engine gear. Just when it looks like Dragoon is going to be knocked out Tyson cleverly uses Draciel's own power against it and...","publishedDate":"5 Mar. 2005","rating":{"count":15,"star":7.2}},{"idx":26,"no":"S3, Ep26","title":"Familiar Faces","image":"https://m.media-amazon.com/images/M/MV5BMTQ4NjY4ODg0MV5BMl5BanBnXkFtZTgwNjcxNzIyNjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTQ4NjY4ODg0MV5BMl5BanBnXkFtZTgwNjcxNzIyNjE@.jpg","plot":"With three teams qualifying for the finals of the World Beyblade Championships - the Blitzkrieg Boys, the BBA Revolution, and F Dynasty - the BBA must make a decision. Only two teams can play in the finals, and a format to determine which ones will compete must be decided. Will they stage a mini-round robin tournament between the three teams? Or will the BBA Revolution and F Dynasty, who are both tied for second place battle, with the winner moving on to face the Blitzkrieg Boys in the finals? These questions will all take time to answer - time the various competitors...","publishedDate":"12 Mar. 2005","rating":{"count":16,"star":6.8}},{"idx":27,"no":"S3, Ep27","title":"What a Blast!","image":"https://m.media-amazon.com/images/M/MV5BMjIyMzA0NTM0M15BMl5BanBnXkFtZTgwMDYwNjE1NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjIyMzA0NTM0M15BMl5BanBnXkFtZTgwMDYwNjE1NTE@.jpg","plot":"The entire city is pumped for Tyson and Daichi's rematch with F Dynasty in double-team play. At first, the awesome power of BBA Revolution has Raul and Julia on their heels. Raul manages to save Julia from a stadium out and his big sister lets him take command. Encouraged by the support of their circus family, the brother and sister use their experience and teamwork to push the BBA Revolution to the brink of defeat. Tyson and Daichi are losing strength when they realize they are having the time of their lives. There's nothing like competing against powerful, skilled ...","publishedDate":"19 Mar. 2005","rating":{"count":21,"star":7.1}},{"idx":28,"no":"S3, Ep28","title":"Changing Gears","image":"https://m.media-amazon.com/images/M/MV5BODYzMzc0MDQ4M15BMl5BanBnXkFtZTgwNjQzNjQzNjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BODYzMzc0MDQ4M15BMl5BanBnXkFtZTgwNjQzNjQzNjE@.jpg","plot":"The finals have finally arrived and BBA Revolution gets ready to face the Blitzkrieg Boys in a heated battle. But before that can happen, a routine check-up of Tyson's Beyblade turns up a faulty gear assembly, which needs to be repaired! Time is running out, and Daichi has to stretch out his match with Tala to give Kenny the time he needs to fix Dragoon! Just when things look their bleakest, Kenny brings Dragoon back to its former glory, which gets Daichi off the hook! And now, instead of running away from Tala, he comes back with an intense attack! But is it too late...","publishedDate":"26 Mar. 2005","rating":{"count":15,"star":6.8}},{"idx":29,"no":"S3, Ep29","title":"And Then There Were Two","image":"https://m.media-amazon.com/images/M/MV5BYzY3ZDFhMzItY2U2Zi00M2U5LWFjMGQtYjNjZmRlZjEwMDk4XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BYzY3ZDFhMzItY2U2Zi00M2U5LWFjMGQtYjNjZmRlZjEwMDk4XkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"Daichi and Tala have both been thrown from the dish at the same time, resulting in a tie game. Because they are in no condition for a rematch, Mr. Dickenson rules that the next match will determine the new tournament Champion. It all comes down to Kai and Tyson. Kai shows up for the match battered and bruised from his training session with Spencer and Bryan, just so he can put himself at Tyson's level of physical exhaustion, since Tyson had already battled earlier in the day. Kai wants them to be evenly matched so that he won't have any advantage in battle. Because of...","publishedDate":"2 Apr. 2005","rating":{"count":15,"star":7}},{"idx":30,"no":"S3, Ep30","title":"Let the Games Begin... Again!","image":"https://m.media-amazon.com/images/M/MV5BNDg4NWFhZDctNGRmNS00YTAxLTlkZGItZmM2YWNmZDhiYjBhXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNDg4NWFhZDctNGRmNS00YTAxLTlkZGItZmM2YWNmZDhiYjBhXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"It's the finals of the World Beyblading Championships and the final battle pits Kai against the defending world Champion, Tyson. The fight is incredibly intense and what's even more amazing, it looks like the two combatants are so evenly matched, there might not be a winner. And that's exactly what happens! At the end of the battle, Kai and Tyson drop out at the exact same time! Now a dilemma arises. Mr. Dickenson has to make the final decision and he's leaning toward calling it a tie because he's afraid that if they continue the battle, someone could get hurt. But ...","publishedDate":"9 Apr. 2005","rating":{"count":19,"star":7.5}},{"idx":31,"no":"S3, Ep31","title":"Runaway Daichi!","image":"https://m.media-amazon.com/images/M/MV5BODE0MzI3NDY3MV5BMl5BanBnXkFtZTgwMzkwNjQzNjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BODE0MzI3NDY3MV5BMl5BanBnXkFtZTgwMzkwNjQzNjE@.jpg","plot":"Tyson and Daichi win the Beyblade Tag Team World Championship but Daichi is jealous that Tyson is getting all the attention. He decides the only way he can get the respect he deserves is to go on a training mission and come back and defeat Tyson on his own. He hitches a ride on a truck and falls asleep but wakes up far away from home, alone and hungry. Luckily he runs into Max and his father who invite him back to their house for dinner. During the meal Max squirts mustard on Daichi's steak telling him it will make it taste better. This disgusts Daichi, and in his ...","publishedDate":"16 Apr. 2005","rating":{"count":15,"star":6.9}},{"idx":32,"no":"S3, Ep32","title":"Beyblade Idol","image":"https://m.media-amazon.com/images/M/MV5BNzI3NDY1Mzc0MV5BMl5BanBnXkFtZTgwOTA5NzczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNzI3NDY1Mzc0MV5BMl5BanBnXkFtZTgwOTA5NzczMjE@.jpg","plot":"A news bulletin announces that the BBA has been bought and transformed into a new, professional league, named the BEGA League and that Mr. Dickenson has resigned from his position as Chairman. The kids go off in search of their old friend and demand an explanation. Ashamed, Mr. Dickenson reveals that the board of the BBA had completed the plans to sell the league while he was occupied with the World Championships. Tyson resolves to show up at the press conference the next day and discover who is behind the plot. But at the press conference, he is faced with the new ...","publishedDate":"23 Apr. 2005","rating":{"count":41,"star":8.8}},{"idx":33,"no":"S3, Ep33","title":"Out of Their League","image":"https://m.media-amazon.com/images/M/MV5BMTUxODQ4ODE0OF5BMl5BanBnXkFtZTgwMjQzNjQzNjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTUxODQ4ODE0OF5BMl5BanBnXkFtZTgwMjQzNjQzNjE@.jpg","plot":"Tyson, Max, Kenny and Daichi are invited by Boris to take a tour inside his new BEGA headquarters. Hilary isn't allowed inside until the official public opening, and is sent away, much to her chagrin. The boys find that the BEGA building is unparalleled in the quality of its Beyblade training and facilities. Impressive as it is however, Tyson is still highly distrustful of Boris, who was responsible for trying to take over the world two years ago by using his team the Demolition Boys as soldiers. Boris tries to convince Tyson that he's changed. Ever since his scheme ...","publishedDate":"30 Apr. 2005","rating":{"count":15,"star":7.2}},{"idx":34,"no":"S3, Ep34","title":"The Mysterious Mystel...","image":"https://m.media-amazon.com/images/M/MV5BNzU3NGM4ZDgtNWExZS00YWZiLWE3ODItY2QzNTMxYmVmYTNmXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNzU3NGM4ZDgtNWExZS00YWZiLWE3ODItY2QzNTMxYmVmYTNmXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"A mysterious stranger wanders the woods of White Tiger Hills, the headquarters of the White Tiger X team, and although this strange young man performs incredible good deeds, Lee and the rest of the team are suspicious, and tell their leader Ray, all about him. It isn't long until the entire team meets up with him again, and Ray comes face to face with the stranger's incredible abilities like leaping, flying and jumping through the air, not to mention Beyblading like a world champion. He calls himself Mystel and amazes Lee and Ray with the mixture of his incredible ...","publishedDate":"7 May 2005","rating":{"count":15,"star":6.9}},{"idx":35,"no":"S3, Ep35","title":"Pros and Ex-Cons","image":"https://m.media-amazon.com/images/M/MV5BMjI0MTAzMTc0NF5BMl5BanBnXkFtZTgwMjA0MzEyNjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjI0MTAzMTc0NF5BMl5BanBnXkFtZTgwMjA0MzEyNjE@.jpg","plot":"Tyson can't seem to make up his mind whether or not to trust Boris and go pro. When the team is visited by a rabid pack of sponsors who want to sign them to product contracts, Grandpa is forced to step in and recommend that Tyson have a talk with his more experienced brother, Hiro. While looking for Hiro, Tyson and friends come across Tala, Bryan and Spencer, who are on their way to get revenge on Boris by bringing the BEGA league down around him. Tyson is torn between following Tala, and respecting Tala's wish that he stay out of it. At BEGA headquarters, Tala, ...","publishedDate":"14 May 2005","rating":{"count":15,"star":7.1}},{"idx":36,"no":"S3, Ep36","title":"Boris, the Blade Stops Here!","image":"https://m.media-amazon.com/images/M/MV5BZjIxZTQ3YWQtMzI4Zi00ODgzLWE4OWItMzU0NGVjYmVjYTcyXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BZjIxZTQ3YWQtMzI4Zi00ODgzLWE4OWItMzU0NGVjYmVjYTcyXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"Without warning, a match is announced in town featuring Blader's from the new BEGA League run by Boris. Tyson and his crew are skeptical of this new band of Blader's, so they decide to go scope out the event. Once there, they find Garland and Tala going head to head all under the supervision of Boris who observes from the wings. An intense battle is played out on the stadium floor, when, it looks like Tala is about to lose, bars rise up out of the floor and keep him in the dish. As they continue to battle, Tala becomes weaker and weaker and collapses. Tyson's had ...","publishedDate":"21 May 2005","rating":{"count":15,"star":7.1}},{"idx":37,"no":"S3, Ep37","title":"The Bega Challenge","image":"https://m.media-amazon.com/images/M/MV5BMzQzMTY0MzUzNV5BMl5BanBnXkFtZTgwNTM5NDMyNjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMzQzMTY0MzUzNV5BMl5BanBnXkFtZTgwNTM5NDMyNjE@.jpg","plot":"In response to Tyson's challenge of a one on one battle against the best Blader in BEGA, Boris counters by suggesting a five on five match. Tyson wants to accept but the odds are stacked against him. Kai has now joined the BEGA Blader's and BEGA now virtually controls the whole sport because they have set up an I.D. registration service for all Blader's who want to become professionals. Worst of all, Hiro, Tyson's brother has been hired on to coach the BEGA Blader's! Tyson tells his troubles to Ray but gets no sympathy. Secretly Ray has always wanted to battle Tyson ...","publishedDate":"28 May 2005","rating":{"count":15,"star":7.1}},{"idx":38,"no":"S3, Ep38","title":"Bega on the Rise","image":"https://m.media-amazon.com/images/M/MV5BNjIyMDQ3OTk0M15BMl5BanBnXkFtZTgwMjE5NzczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNjIyMDQ3OTk0M15BMl5BanBnXkFtZTgwMjE5NzczMjE@.jpg","plot":"Hiro stuns the world by joining the BEGA League and coaching Brooklyn, their secret weapon. As the popularity of the new league rises, BBA Revolution find themselves unable to practice because Boris has cornered the market on new parts. Boris is satisfied with the progress of his top Blader's, who are training heavily in a series of practice and exhibition matches. Ming Ming and the rest of her teammates easily dispatch the competition. After meeting an exceptional Blader named Garland, Kai is warned not to go head to head with Brooklyn - the most powerful Blader at ...","publishedDate":"4 Jun. 2005","rating":{"count":23,"star":7.5}},{"idx":39,"no":"S3, Ep39","title":"Rebel Alliance","image":"https://m.media-amazon.com/images/M/MV5BMTUwNTY1ODA3NV5BMl5BanBnXkFtZTgwOTQzNjQzNjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTUwNTY1ODA3NV5BMl5BanBnXkFtZTgwOTQzNjQzNjE@.jpg","plot":"Tyson and Daichi disguise themselves in an effort to get badly needed replacement parts for their damaged Beyblades. But without an official BEGA I.D. card signifying membership in the new league - something they steadfastly refuse to get - they're shut out from getting parts at any store. Despairing about how they'll solve this dilemma, they're visited by members of various teams they fought against in the World Championships: White Tiger X, PPB All Starz, Barthez Battalion, and F Dynasty. These former foes don't like Boris and his professional BEGA league either, ...","publishedDate":"11 Jun. 2005","rating":{"count":16,"star":7}},{"idx":40,"no":"S3, Ep40","title":"Back to Basics","image":"https://m.media-amazon.com/images/M/MV5BODlhNDUzODQtYThkMi00NmM5LTgzYTctNmEzY2FkNzE2YWZiXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BODlhNDUzODQtYThkMi00NmM5LTgzYTctNmEzY2FkNzE2YWZiXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"The good news is, the Hard Metal Beyblades are ready to go... the bad news: no one knows how to control them! Tyson, Daichi, Ray and Max each spend the day trying to learn the delicate new intricacies of the Hard Metal Beyblade, but the new blades seem to get the better of our heroes over and over again... some even wind up headfirst in the lake... No real progress is being made... It isn't until the gang remembers what it was like when they first started Beyblading, including all the roadblocks that they once came across, that they realize the secret of reining in ...","publishedDate":"18 Jun. 2005","rating":{"count":15,"star":7.1}},{"idx":41,"no":"S3, Ep41","title":"And Justice-Five for All","image":"https://m.media-amazon.com/images/M/MV5BNDM5ODg2NjM5NV5BMl5BanBnXkFtZTgwMTUzNjQzNjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNDM5ODg2NjM5NV5BMl5BanBnXkFtZTgwMTUzNjQzNjE@.jpg","plot":"Tyson, Max and Ray struggle to learn the \"Hard Metal\" system with the help of some of their friends from the World Championship tournament. They still need one more member for the team, and Rick, Lee and Michael have all volunteered to fill the remaining slot. But first they have to prove they can master the new system... which proves a lot tougher than they thought. Meanwhile, Hiro and Boris decide to hold a tournament to give some unknown Beyblader's a chance to try and make the \"Bega Bladers\" team. Boris knows that they probably won't be able to beat his Pro's (...","publishedDate":"25 Jun. 2005","rating":{"count":16,"star":7.1}},{"idx":42,"no":"S3, Ep42","title":"When You Wish Upon a Star","image":"https://m.media-amazon.com/images/M/MV5BMTU5NjczNTg1NV5BMl5BanBnXkFtZTgwMDQ4NTQzNjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTU5NjczNTg1NV5BMl5BanBnXkFtZTgwMDQ4NTQzNjE@.jpg","plot":"The Bega Bladers have one more Blader to pick for the BEGA 5 Justice Tournament and it's between the up and coming Brooklyn and Kai. As their elimination battle begins, Kai tries his best to take command but it seems Brooklyn mirrors his every move. Kai realizes something's fishy, but before he can do anything about it, Brooklyn takes the win, much to Boris's liking. So the BEGA Blader's team has been picked, now it's up to Tyson and his crew to pick a team. After much discussion about it, they all agree it should be up to Tyson to choose, but Tyson (even though he ...","publishedDate":"2 Jul. 2005","rating":{"count":16,"star":7.2}},{"idx":43,"no":"S3, Ep43","title":"Sing Ming Ming Sing!","image":"https://m.media-amazon.com/images/M/MV5BOTg3ODcxMjc1N15BMl5BanBnXkFtZTgwNTMzMDYxNzE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BOTg3ODcxMjc1N15BMl5BanBnXkFtZTgwNTMzMDYxNzE@.jpg","plot":"It's the start of \"Justice 5\" and Daichi is set to battle Ming Ming, the crowd favorite because of her cute demeanor and sensational singing voice. Daichi's goal is to prove that Ming Ming doesn't take Beyblading seriously and he vows to knock her out of the stadium early in the match. However, when Ming Ming gains the upper hand this makes Daichi very annoyed. Worst of all, Ming Ming has the nerve to break into song as if to mock Daichi. Even worse, her singing seems to make her Blading improve and she slams Strata Dragoon relentlessly. Kenny, a devoted fan of Ming ...","publishedDate":"9 Jul. 2005","rating":{"count":15,"star":7.1}},{"idx":44,"no":"S3, Ep44","title":"Refuse to Lose","image":"https://m.media-amazon.com/images/M/MV5BMTc1NTQxOTE2MV5BMl5BanBnXkFtZTgwNTk4NzczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTc1NTQxOTE2MV5BMl5BanBnXkFtZTgwNTk4NzczMjE@.jpg","plot":"It's the second match of the Justice Five Battle and Ray and Crusher are facing off against each other. With Ming Ming's win against Daichi in the previous match, the BEGA League is already ahead by one so the pressure is on Ray to take the match. But Crusher is feeling the pressure too, not only for himself and his teammates but for his sister, Monica, who is undergoing surgery at the very same time. From the beginning, the battle is fierce with both Blader's inflicting significant damage. But Ray quickly gains the upper hand and it looks like its game over. It is ...","publishedDate":"16 Jul. 2005","rating":{"count":26,"star":7.5}},{"idx":45,"no":"S3, Ep45","title":"Max to the Max","image":"https://m.media-amazon.com/images/M/MV5BMzQxZmE2MTQtZWI0OC00ZDMyLTllMzgtMDE5OTlhNDZmZTQ2XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMzQxZmE2MTQtZWI0OC00ZDMyLTllMzgtMDE5OTlhNDZmZTQ2XkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"The first two matches of the 'Justice 5' tournament are complete, and things aren't looking good for Tyson's squad, G Revolutions. BEGA's team is up two games to one in the best-of-five series. If they lose another match, BEGA will be victorious and have complete control over the sport of Beyblading. This puts a lot of pressure on Max to win game three against Mystel. Tyson and the others argue whether Max's signature defensive style will be enough to overcome Mystel's unpredictable and overpowering attack. Max takes this as a sign that his teammates only think he can...","publishedDate":"23 Jul. 2005","rating":{"count":16,"star":7.2}},{"idx":46,"no":"S3, Ep46","title":"The Return of Kai","image":"https://m.media-amazon.com/images/M/MV5BOGRhY2RlMjEtYTE2Ny00NWQwLThkNmUtNGRiMTI5MjA3NjY4XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BOGRhY2RlMjEtYTE2Ny00NWQwLThkNmUtNGRiMTI5MjA3NjY4XkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"With three rounds already played, the G Revolutions team finds themselves with an unimpressive record... two matches lost, and one ending in a draw. Tyson and the rest of the team are practicing furiously to guarantee a check in the win column for tomorrow's big match. The bad news is, no one on the team has the same skill with the Hard Metal Beyblade as Tyson does... or at least that's what he thinks, and he refuses to choose any of his teammates to Blade in the last round of the tournament, insisting instead to blade both rounds himself. As all of the others vie for...","publishedDate":"30 Jul. 2005","rating":{"count":18,"star":8.1}},{"idx":47,"no":"S3, Ep47","title":"Now You're Making Me Mad","image":"https://m.media-amazon.com/images/M/MV5BMTUyMTQ1NzU0M15BMl5BanBnXkFtZTgwMzMwMDYxNzE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTUyMTQ1NzU0M15BMl5BanBnXkFtZTgwMzMwMDYxNzE@.jpg","plot":"It's the continuation of the Justice 5 Tournament with the BEGA Blader's leading the battle with two wins and a tie. If G Revolutions lose the next battle, they're out and BEGA (lead by the evil Boris) takes over the Beyblading Empire. The next battle is set to pit Tyson against Garland, but when the G Revolutions enter the stadium, they reveal their fifth team member- KAI!! Everyone is stunned, except for the BEGA Blader's who see him only as a loser. Kai is out for revenge because a few days earlier he lost a battle to Brooklyn. So, wanting to save face, Kai calls ...","publishedDate":"6 Aug. 2005","rating":{"count":19,"star":8.1}},{"idx":48,"no":"S3, Ep48","title":"The Beyblading Spirit","image":"https://m.media-amazon.com/images/M/MV5BMTQ2MzU1NDIxNV5BMl5BanBnXkFtZTgwODQzNjQzNjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTQ2MzU1NDIxNV5BMl5BanBnXkFtZTgwODQzNjQzNjE@.jpg","plot":"The battle of \"Justice 5 Tournament\" continues and Kai is clearly overwhelmed by the power of Brooklyn of the Bega Bladers. Attack after attack sees Kai barely hanging on as he fights to stay in the match. Tyson and his team mates nervously watch, but vow to stay out of the battle because of a promise that Tyson made to Kai. Pleased with the progress of the battle and confident that Brooklyn will win, Boris watches from the sidelines with delight. Kai's determination to win against these unbeatable odds begins to frustrate Brooklyn and he increases the intensity of ...","publishedDate":"13 Aug. 2005","rating":{"count":31,"star":8.7}},{"idx":49,"no":"S3, Ep49","title":"The Principles of Victory","image":"https://m.media-amazon.com/images/M/MV5BMjA3NTk2NzMxMF5BMl5BanBnXkFtZTgwMDE5NzczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjA3NTk2NzMxMF5BMl5BanBnXkFtZTgwMDE5NzczMjE@.jpg","plot":"All of G Revolutions hopes now rest on Tyson's match with Garland. Tyson is determined to make sure Kai's brave victory over Brooklyn isn't wasted. Garland is confident he will win. His family have been sports champions for centuries thanks to a book containing the Tzebult Principles of Victory. Those who follow the principles never lose! Tyson seeks the help of his friends to prepare, finding comfort and focus in their company. The match begins and Garland seems unbeatable due to the family principles. But Tyson isn't satisfied... he wants to fight the real Garland, ...","publishedDate":"20 Aug. 2005","rating":{"count":25,"star":7.7}},{"idx":50,"no":"S3, Ep50","title":"Welcome to My Nightmare!","image":"https://m.media-amazon.com/images/M/MV5BMzY1MzkyOTE0M15BMl5BanBnXkFtZTgwNzg5NTQzNjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMzY1MzkyOTE0M15BMl5BanBnXkFtZTgwNzg5NTQzNjE@.jpg","plot":"Brooklyn has gone a little loopy after his loss against Kai. And the loss means either BEGA or the G Revolutions need one more victory to win the Justice 5 Tournament. To determine a winner, one battle is left and it will pit Tyson going up against one of the BEGA Blader's. But who will it be? Garland offers his services, but Hiro turns him down cold saying they need Brooklyn to fight this battle. Brooklyn's on the brink of a breakdown and now it's up to Hiro to get him back into fighting form. Meanwhile, Boris has taken matters into his own hands and dispatches ...","publishedDate":"27 Aug. 2005","rating":{"count":16,"star":7.6}},{"idx":51,"no":"S3, Ep51","title":"Brooklyn's Back!","image":"https://m.media-amazon.com/images/M/MV5BMTQzODIwNTM5Nl5BMl5BanBnXkFtZTgwMzMyMTczNjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTQzODIwNTM5Nl5BMl5BanBnXkFtZTgwMzMyMTczNjE@.jpg","plot":"The final match between the G Revolutions and the BEGA Bladers has arrived. Tyson prepares for the contest, unsure of whom he will ultimately face. It isn't until he steps onto the stadium floor when he discovers that he will go face to face, against Brooklyn himself. Brooklyn shows off his incredible powers immediately, stunning both teams on either side of the Beystadium. But no one has any idea of the true extent of Brooklyn's powers until he creates a wormhole to another dimension, creating an empty shell, carbon copy of the real world! The freak out continues as ...","publishedDate":"3 Sep. 2005","rating":{"count":21,"star":8.6}},{"idx":52,"no":"S3, Ep52","title":"Beybattle for the Ages","image":"https://m.media-amazon.com/images/M/MV5BOTExNjg5MDY3MF5BMl5BanBnXkFtZTgwMjExMDgzMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BOTExNjg5MDY3MF5BMl5BanBnXkFtZTgwMjExMDgzMjE@.jpg","plot":"A mysterious stranger wanders the woods of White Tiger Hills, the headquarters of the White Tiger X team, and although this strange young man performs incredible good deeds, Lee and the rest of the team are suspicious, and tell their leader Ray, all about him. It isn't long until the entire team meets up with him again, and Ray comes face to face with the stranger's incredible abilities like leaping, flying and jumping through the air, not to mention Beyblading like a world champion. He calls himself Mystel and amazes Lee and Ray with the mixture of his incredible ...","publishedDate":"10 Sep. 2005","rating":{"count":36,"star":8.4}}]},{"id":"2","name":"Season 2","episodes":[{"idx":1,"no":"S2, Ep1","title":"Shot Down in Flames!","image":"https://m.media-amazon.com/images/M/MV5BNDIyNDE3MDU2Nl5BMl5BanBnXkFtZTgwOTY2MjgzMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNDIyNDE3MDU2Nl5BMl5BanBnXkFtZTgwOTY2MjgzMjE@.jpg","plot":"Tyson is back home from just winning the World Beyblade Championships and he thinks he's one hot dude!! But after disrupting his homeroom at school, he's punished with a detention which makes him late for a local tournament. When he finally get there, he's confronted with a mystery kid, Mister X, who battles his way to the finals to face off against Tyson.","publishedDate":"9 Aug. 2003","rating":{"count":37,"star":7.1}},{"idx":2,"no":"S2, Ep2","title":"The Search for Mr. X","image":"https://m.media-amazon.com/images/M/MV5BOTE1MDA1NTA0N15BMl5BanBnXkFtZTgwNTAxNTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BOTE1MDA1NTA0N15BMl5BanBnXkFtZTgwNTAxNTczMjE@.jpg","plot":"Kenny learns that the cloaked Blader named Ozuma, who defeated Tyson in an informal, Supermarket-sponsored Beybattle, was using an invisible Bit-Beast. Tyson demands a rematch against the strange opponent - and loses for a second time when Dragoon mysteriously fails to appear on command. Effects from the battle damaged Dizzi, whom Kenny endeavors to repair. Meanwhile, a group of shady Men in Black have been busy monitoring Tyson and Ozuma the entire time. At school, tensions between Tyson and Hilary continue to rise. Tyson's turmoil over Dragoon's behavior sets him on...","publishedDate":"9 Aug. 2003","rating":{"count":34,"star":7.2}},{"idx":3,"no":"S2, Ep3","title":"Unseen and Unleashed","image":"https://m.media-amazon.com/images/M/MV5BMzg0ODEyMjI2OF5BMl5BanBnXkFtZTgwNzAxNTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMzg0ODEyMjI2OF5BMl5BanBnXkFtZTgwNzAxNTczMjE@.jpg","plot":"Tyson still can't get over losing his town's Beyblade Tournament to the mysterious Mister X. Kenny and Dizzi try to come up with some answers but discover a greater mystery. On the same day as Tyson's loss, Max and Ray were also visited by similar shadowy figures that defeated them as well. While Tyson does his best to avoid his school chores, Kenny makes a startling discovery about Mister X's Beyblade. Unfortunately Tyson, unaware of this new information, unexpectedly runs into Mister X at the park and challenges him to a rematch!","publishedDate":"9 Aug. 2003","rating":{"count":30,"star":7}},{"idx":4,"no":"S2, Ep4","title":"Searching for Dragoon","image":"https://m.media-amazon.com/images/M/MV5BOTYzMTQ1MDg1NV5BMl5BanBnXkFtZTgwODQ2NDA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BOTYzMTQ1MDg1NV5BMl5BanBnXkFtZTgwODQ2NDA5NTE@.jpg","plot":"Tyson heads to the park to meet Kenny, who has a plan to get Dragoon back \"on line\". But when Kenny and Hilary are kidnapped, Tyson is forced to jump through a series of hoops set out by their captors, which test his speed and determination. After successfully completing their orders, Tyson finds himself on a ship equipped with a fancy computer system - and his friends, locked in a glass-walled cage. But what do the kidnappers want - and how far will they go to get it? When the mysterious voice challenges Tyson to a battle he accepts - even though the stakes are the ...","publishedDate":"9 Aug. 2003","rating":{"count":27,"star":7}},{"idx":5,"no":"S2, Ep5","title":"Guess Who's Back in Town?!","image":"https://m.media-amazon.com/images/M/MV5BMTc5NTEwMTQ3N15BMl5BanBnXkFtZTgwMTU2NDA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTc5NTEwMTQ3N15BMl5BanBnXkFtZTgwMTU2NDA5NTE@.jpg","plot":"Tyson and Kenny are safe on dry land once again but are totally baffled trying to figure out why Kenny and Hilary were kidnapped by two mystery men. The best that they can deduce is that two fractions are out to steal the Bit Beasts of all the members of the Bladebreakers. This leads them to wonder about Kai who supposedly has retired from Beyblade. Back at Kai's prep school, a curious student named Wyatt is all over Kai trying to get him to come out of retirement and give him a few pointers on how to blade. Kai ignores him until a bully named Dunga entices Wyatt into...","publishedDate":"20 Sep. 2003","rating":{"count":25,"star":7.4}},{"idx":6,"no":"S2, Ep6","title":"The Magtram Threat!","image":"https://m.media-amazon.com/images/M/MV5BMTcwODc3OTE5Ml5BMl5BanBnXkFtZTgwMTcyNDA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTcwODc3OTE5Ml5BMl5BanBnXkFtZTgwMTcyNDA5NTE@.jpg","plot":"Inside Gideon's training center, two of his henchmen discover a talented blader named Snakey and offers to equip his blade with the Magtram. The Magtram is a device that creates a magnetic field around the user's Beyblade and gives an unfair advantage to anyone using it. Kenny and Hilary are on the look out for their mysterious captors when Tyson shows up with a new scheme to find Ozuma. Out of nowhere, Snakey shows up and challenges Tyson to a match. Little does Tyson know that Snakey is being used as bait so that Gideon can collect data on Dragoon. Tyson accepts the...","publishedDate":"27 Sep. 2003","rating":{"count":25,"star":7.3}},{"idx":7,"no":"S2, Ep7","title":"The Reunion Begins","image":"https://m.media-amazon.com/images/M/MV5BY2RjZDIxOTctYzVmMC00YWM3LWFhMGItNTVmNTdkMDQxNTlmXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BY2RjZDIxOTctYzVmMC00YWM3LWFhMGItNTVmNTdkMDQxNTlmXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"Tyson and Kenny try to determine what the mystery material was inside Snakey's Beyblade that made it so magnetic. Kai is tight-lipped after rejoining his friends following his draw against Dunga. Kai crashes at Tyson's place, but departs quickly after old grievances resurface, and Hilary suspects him of being a spy. Tyson and Kenny e-mail Max's mom, asking for help with their analysis of the mystery metal, while Hilary suggests visiting another person who could help them-Mr. Dickenson. Upon visiting him at his office, they meet a new team called the Psykicks, led by ...","publishedDate":"18 Feb. 2002","rating":{"count":24,"star":7.6}},{"idx":8,"no":"S2, Ep8","title":"Return of the Bladebreakers!","image":"https://m.media-amazon.com/images/M/MV5BMTk5NDA1NDk0MV5BMl5BanBnXkFtZTgwMjI0NDA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTk5NDA1NDk0MV5BMl5BanBnXkFtZTgwMjI0NDA5NTE@.jpg","plot":"At long last, Max and Ray rejoin their friends and the Bladebreakers are back together again, and just in time to meet their opponents, Team Psykick. With one week to train, the Bladebreakers have victory on their brains-especially after Max and Kenny reveal the new technology developed by Max's mom. The MG Core produces a magnetic field similar to the one in the Magtram technology, giving the user optimal control over their Beyblade and increasing the power of the Beyblade. However, it's not an easy thing to control, and the guys have a rough start. Kenny and Hilary ...","publishedDate":"25 Feb. 2002","rating":{"count":24,"star":7.3}},{"idx":9,"no":"S2, Ep9","title":"La Isla Bey-Nita!!","image":"https://m.media-amazon.com/images/M/MV5BNDgxNDg0MzU4NF5BMl5BanBnXkFtZTgwMDQ5MzA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNDgxNDg0MzU4NF5BMl5BanBnXkFtZTgwMDQ5MzA5NTE@.jpg","plot":"The Bladebreakers were en route to take on Team Psykick in a tournament when the Driver filled the bus with sleeping gas. While unconscious, they were quickly whisked away to a deserted island where Doctor B, Gideon's minion, was assigned to steal the Bit Beasts from all four team members with a Bit-Beast Capturing System. The system would wait until a bit beast was released, and then would try to entangle it in an energy field. The first battle was between Max and a 'colorful' character named Chameleon. It looked bad for Max, but in the end, he called out Draciel, ...","publishedDate":"4 Mar. 2002","rating":{"count":24,"star":7.3}},{"idx":10,"no":"S2, Ep10","title":"The Island of No Return","image":"https://m.media-amazon.com/images/M/MV5BMTQ2NjM2NTAyOF5BMl5BanBnXkFtZTgwMTE1NDA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTQ2NjM2NTAyOF5BMl5BanBnXkFtZTgwMTE1NDA5NTE@.jpg","plot":"The Bladebreakers decide to split up ion order to find a way out of the island. Hiromi, Kai and Kyojyu head for the lighthouse where they hope to find a way to communicate with the outside world and call for help, while Takao, Rei and Max decide to carry o with the beybattles, hoping that if they win, they will be able to eave the site. Meanwhile, Kaichou and Takao's grandfather discuss their disappearance and try to figure out how to find them, while being watched from afar by Ozuma and Dunga. Kai's gang faces difficult obstacles when their mysterious captor tries to...","publishedDate":"10 Mar. 2002","rating":{"count":25,"star":7.7}},{"idx":11,"no":"S2, Ep11","title":"The Evil Island of Dr. B","image":"https://m.media-amazon.com/images/M/MV5BMTQ5NzM4MDgxOF5BMl5BanBnXkFtZTgwNjY1MTI5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTQ5NzM4MDgxOF5BMl5BanBnXkFtZTgwNjY1MTI5NTE@.jpg","plot":"Our heroes are still trapped on a deserted island and are puppets of the evil Doctor B who's intent is to steal the Bladebreakers Bit Beasts. But he does make a deal with the kids that if each member of the Bladebreakers can defeat a member of Team Psykick, he'll release them. Only two haven't fought yet- Tyson and Kai. The first battle is between Kai and Figel that Kai wins handily. After the battle, Kenny, Kai and Hilary resume their quest to the lighthouse to get a clear satellite signal to get help from the outside. Finally they make contact, but not before they ...","publishedDate":"18 Oct. 2003","rating":{"count":24,"star":7.7}},{"idx":12,"no":"S2, Ep12","title":"Bring Me Dranzer!","image":"https://m.media-amazon.com/images/M/MV5BMTQzNzY2NjUwOV5BMl5BanBnXkFtZTgwNjk0NDA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTQzNzY2NjUwOV5BMl5BanBnXkFtZTgwNjk0NDA5NTE@.jpg","plot":"Tyson recuperates in the hospital after being rescued from the island where he fought Team Psykick. Away from school, Tyson discovers he really likes hospital life until Hilary shows up with all his homework assignments. Meanwhile Gideon, frustrated with his attempts to capture the BladeBreakers Bit Beasts, hatches a sinister new plan. He demands that Doctor B and his team create powerful Cyber Bit Beasts using the data they have gathered on the Blade Breakers. The only problem is their data is incomplete. They need to analyze Kai's Beyblade Dranzer to complete their ...","publishedDate":"25 Oct. 2003","rating":{"count":24,"star":7.8}},{"idx":13,"no":"S2, Ep13","title":"Testing One, Two, Three","image":"https://m.media-amazon.com/images/M/MV5BNjk2MTcxMDAzNl5BMl5BanBnXkFtZTgwNzA1NDA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNjk2MTcxMDAzNl5BMl5BanBnXkFtZTgwNzA1NDA5NTE@.jpg","plot":"Joseph of the Saint Shields infiltrates the Psykick's laboratory and discovers their latest, sinister plan. Gideon and Doctor B are using the data they collected on the Blade Breakers to create Cyber Bit-Beasts based on the ones our heroes use. But the Doctor's first test ends in disaster; the Cyber Bit Beasts aren't quite ready yet. As for the BladeBreakers, they learn that the group who've been using invisible Bit Beasts against them - the Saint Shields - are all in the vicinity. With the Psykick's still after them as well, the BladeBreakers hold a full-on practice ...","publishedDate":"1 Nov. 2003","rating":{"count":23,"star":7.2}},{"idx":14,"no":"S2, Ep14","title":"Gideon Raises Gerry","image":"https://m.media-amazon.com/images/M/MV5BMjEzMzU1OTA1Ml5BMl5BanBnXkFtZTgwNDkwNjQzNjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjEzMzU1OTA1Ml5BMl5BanBnXkFtZTgwNDkwNjQzNjE@.jpg","plot":"Our heroes have been confronted by Joseph and Mariam and just as Tyson runs up, Ozuma, the Saint Shields leader, challenges Tyson to a battle. As it rages on, Tyson is forced to call out his Victory Tornado Attack in order to win. After the fight, Ozuma flippantly tells Tyson he needs to 'improve his Bit Beast Technique' which stumps Tyson to no end, especially after winning!! Meanwhile, Gideon oversees Doctor B who unveils the first ever Cyber Bit Beast which is the most powerful Beast in the world. This cloned power from the Sacred Bit Beasts has been compressed ...","publishedDate":"8 Nov. 2003","rating":{"count":22,"star":7.3}},{"idx":15,"no":"S2, Ep15","title":"Show Me the Bit Beasts!","image":"https://m.media-amazon.com/images/M/MV5BYjg1MzVlMDItOWExYi00ZjE0LTllY2MtNmViNjA5OTA1ZmRlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BYjg1MzVlMDItOWExYi00ZjE0LTllY2MtNmViNjA5OTA1ZmRlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"Gerry of Team Psychic's lack of control led to an explosive conclusion when his Cyber Bit Beast blew up. The Blade Breakers were at a loss as to how that could happen so Kenny consulted his trusty laptop Dizzi and made a startling revelation. Someone had managed to make copies of the Blade Breakers Bit Beasts! This discovery leads the gang to believe that new powerful Bit Beasts are being developed and they decide to get themselves in shape for battle. Ozuma and his gang, the Saint Shields, are still eager to test the power of the Blade Breakers' Bit Beasts as well, ...","publishedDate":"15 Nov. 2003","rating":{"count":21,"star":7.5}},{"idx":16,"no":"S2, Ep16","title":"Team Psykick's New Recruit","image":"https://m.media-amazon.com/images/M/MV5BMjMzMzMyOTQ3Ml5BMl5BanBnXkFtZTgwOTM5MzA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjMzMzMyOTQ3Ml5BMl5BanBnXkFtZTgwOTM5MzA5NTE@.jpg","plot":"Kai's classmate Wyatt returns and begs Kai to help him train to become a first-class Beyblader. Remembering the time back at school that Wyatt betrayed Kai by stealing Dranzer and using it in battle, Kai turns him down. Hurt, Wyatt vows to return and battle Kai one day. That day may be sooner than anyone thinks... for the mysterious Dr. B and his team of scientists have finally re-developed the Cyber Bit Beast and are looking for a Blader with the skill to handle it. Dr. B approaches Wyatt with an offer to join Team Psykick, and Wyatt jumps at the chance. When his ...","publishedDate":"22 Nov. 2003","rating":{"count":22,"star":7.6}},{"idx":17,"no":"S2, Ep17","title":"Hilary's Bey-B-Cue","image":"https://m.media-amazon.com/images/M/MV5BMTU1NTg5MTQ2NV5BMl5BanBnXkFtZTgwMTg1MTI5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTU1NTg5MTQ2NV5BMl5BanBnXkFtZTgwMTg1MTI5NTE@.jpg","plot":"After Dunga and Wyatt battle, Wyatt realizes he doesn't possess the skill necessary to control his Cyber Bit Beast. This frustrates Gideon, so he commands Doctor B to seek out a suitable candidate for the job. Meanwhile, Tyson is back home practicing his blading and quickly tires of it. The rest of the BladeBreakers, including Hilary, keep harping on him to continue until he gets it right. But Tyson has had enough and quits! It seems the BladeBreakers are finished! Then, Hilary comes up with an idea! She tells the guys to take a day off and invites them to an ...","publishedDate":"29 Nov. 2003","rating":{"count":19,"star":7.5}},{"idx":18,"no":"S2, Ep18","title":"When Friends Become Foes","image":"https://m.media-amazon.com/images/M/MV5BMzg0NzY2MzgxMF5BMl5BanBnXkFtZTgwMDcyNDA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMzg0NzY2MzgxMF5BMl5BanBnXkFtZTgwMDcyNDA5NTE@.jpg","plot":"Kane, Goki, Jim, and Salima arrive at Doctor B's lab to begin battle tests for Gideon. Jim goes first after being given his new Beyblade, Cyber Draciel. He battles against a lopsided number of automated Beyblades, including one behemoth the size of a football. But with Cyber Draciel in tow, victory is decisive. It's obvious however, that the Cyber Bit-Beast's power is having a corrupting influence on Jim. At Mr. Dickenson's office, the BladeBreakers are blackmailed into a future battle against the Psykick's when Doctor B threatens an all-out assault on the city by the...","publishedDate":"6 Dec. 2003","rating":{"count":19,"star":7.3}},{"idx":19,"no":"S2, Ep19","title":"Their Own Private Battles","image":"https://m.media-amazon.com/images/M/MV5BOTgwMDVlMzQtYjk1My00ZWY1LTljNDYtYzZkYTViYTc2MDc3XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BOTgwMDVlMzQtYjk1My00ZWY1LTljNDYtYzZkYTViYTc2MDc3XkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"After seeing the power of the Cyber Bit Beasts in Team Psykick's Beyblades, Tyson vows to do whatever it takes to beat them. Even if that means breaking the rules and modifying his own Beyblade. Ray protests and demands that the BladeBreakers play fair even if the odds are against them. In a quiet moment down by the river he runs into Salima of Team Psykick and discovers she feels the same way as he does. Salima tries to convince Ray to get the BladeBreakers to forfeit their upcoming match and even offers to reveal the secrets of the Cyber Bit Beasts. Salima agrees to...","publishedDate":"13 Dec. 2003","rating":{"count":18,"star":7}},{"idx":20,"no":"S2, Ep20","title":"The Power Half Hour!","image":"https://m.media-amazon.com/images/M/MV5BMTQ3MTY5NDQxNV5BMl5BanBnXkFtZTgwNjQ2NDA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTQ3MTY5NDQxNV5BMl5BanBnXkFtZTgwNjQ2NDA5NTE@.jpg","plot":"Tyson is so determined to beat the Psykick's in an upcoming battle that he's ordered Kenny to modify his Dragoon beyond legal specifications. But because his blade now has too much offensive power, Tyson is unable to control it and he becomes totally frustrated with himself and his blade. The more he tries controlling it, the worse he becomes. His friends try to tell him 'cheating' isn't the way to win, yet Tyson ignores them and being pigheaded as he is, he goes off to sulk about his dilemma. Meanwhile, the Psykick's are with Doctor B who informs them that he just ...","publishedDate":"20 Dec. 2003","rating":{"count":21,"star":7.4}},{"idx":21,"no":"S2, Ep21","title":"Battle Tower Showdown","image":"https://m.media-amazon.com/images/M/MV5BMTczOTc1MTU4Ml5BMl5BanBnXkFtZTgwNjA1NDA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTczOTc1MTU4Ml5BMl5BanBnXkFtZTgwNjA1NDA5NTE@.jpg","plot":"The Blade Breakers travel by helicopter to their re-match against the Psykick's. During the flight, Hilary remembers how Psykick trapped her and Kenny on a cargo ship; Max ponders their recent training; Kai regrets the Psykick' mistreatment of Wyatt;; Ray recalls the time Salima reached out to him; and Tyson remains bitter about Kane joining Psykick. When they arrive at the battle location - a five-story, monolithic building called 'The Battle Tower' - they're greeted by Gideon via video screen, who outlines the format. On each floor, one Psykick awaits a different ...","publishedDate":"27 Dec. 2003","rating":{"count":21,"star":7.9}},{"idx":22,"no":"S2, Ep22","title":"Max Takes One for the Team","image":"https://m.media-amazon.com/images/M/MV5BMTUxNjE0Nzc5NV5BMl5BanBnXkFtZTgwNDE1NDA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTUxNjE0Nzc5NV5BMl5BanBnXkFtZTgwNDE1NDA5NTE@.jpg","plot":"The first battle between Team Psykick and the Bladebreakers has begun! Max fights bravely against Jim and Cyber Draciel... and his teammates aren't the only ones interested in the outcome of the battle. Dr. B and Gideon watch from the sidelines, and the Saint Sheilds are there to watch their backs. Max defeats Jim, but amazingly, Cyber Draciel is repaired! It seems Team Psykick has the ability to repair their cyber bit beasts immediately. Even though everyone warns him against it, Max goes back for another round. This time, he isn't so lucky... the powerful Cyber ...","publishedDate":"3 Jan. 2004","rating":{"count":19,"star":7.7}},{"idx":23,"no":"S2, Ep23","title":"The Bigger the Cyber-Driger... The Harder It Falls","image":"https://m.media-amazon.com/images/M/MV5BMTQzNDAxODc0NF5BMl5BanBnXkFtZTgwMDE1NDA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTQzNDAxODc0NF5BMl5BanBnXkFtZTgwMDE1NDA5NTE@.jpg","plot":"A confused and heartbroken Ray must face Salima in a dangerous challenge of Drigers! Despite the threat of losing his bit-beast forever, Ray hesitates... baffled by the extreme change in Salima's personality. It wasn't long ago that she confided in Ray and told him of the troubling bit-beast experiments being conducted by the Psykick's... and now... it looks like she's in the same boat as Goki and Jim! Mind-Controlled by their own cyber-bit-beasts! But Ray can't stand back for long... not after realizing his team is depending on him... and even in the face of team ...","publishedDate":"10 Jan. 2004","rating":{"count":19,"star":7.6}},{"idx":24,"no":"S2, Ep24","title":"Ghost in the Machine","image":"https://m.media-amazon.com/images/M/MV5BNDMyNzQ2NDQwNl5BMl5BanBnXkFtZTgwODk4NzczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNDMyNzQ2NDQwNl5BMl5BanBnXkFtZTgwODk4NzczMjE@.jpg","plot":"Thanks to Ray's spectacular victory over Salima, the Bladebreakers reach the fourth level of Gideon's Battle Tower and meet their next opponent, Goki of the Psykick's. As Kai steps forward to meet the challenge Gideon and Doctor B prepare several surprises for the team. Using the information gathered from the previous two Beybattles, Doctor B has programmed Driger and Draciel's attack patterns into Goki's Beyblade. Meanwhile, the Saint Shields continue to explore the Psykick's headquarters in an attempt to find Max's captured Draciel. But Dunga's impatience sets off ...","publishedDate":"17 Jan. 2004","rating":{"count":23,"star":7.6}},{"idx":25,"no":"S2, Ep25","title":"Raising Kane!!","image":"https://m.media-amazon.com/images/M/MV5BMjI1MDc0MTM2OF5BMl5BanBnXkFtZTgwODM5MzA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjI1MDc0MTM2OF5BMl5BanBnXkFtZTgwODM5MzA5NTE@.jpg","plot":"The final battle is at hand between the Pyskick's and the BladeBreakers. The battle is to take place at Gideon's laboratory with Tyson battling against Kane and his Cyber Bit Beast Dragoon. The fight is fierce from the get-go but as it progresses, Tyson manages to get under Kane's skin by telling him the only way to win is by using one's skill, not relying on a manufactured Bit Beast to do your dirty work. Meanwhile, Ozuma and his gang have barged into the laboratory complex to help Tyson, however, because the building is so massive, they can't find the right room! ...","publishedDate":"24 Jan. 2004","rating":{"count":19,"star":7.5}},{"idx":26,"no":"S2, Ep26","title":"Cyber Dragoon Takes Control","image":"https://m.media-amazon.com/images/M/MV5BMTU4Nzk2OTEzM15BMl5BanBnXkFtZTgwODc3NDA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTU4Nzk2OTEzM15BMl5BanBnXkFtZTgwODc3NDA5NTE@.jpg","plot":"Tyson faces off against Kane of Team Psykick and soon realizes his opponent has an unnatural advantage. Thanks to Doctor B, Kane has a powerful Cyber Bit Beast inside of his Blade. This means that when Tyson summons Dragoon, Kane's Cyber Bit Beast has the ability to copy Dragoon's moves and even improve on them. It's obvious from the get go that Kane's Cyber Bit Beast's powers are developing at an alarming rate and when it starts controlling his mind that's when things really get out of hand. Although a good Blader in his own right, under the control of the Cyber Bit ...","publishedDate":"31 Jan. 2004","rating":{"count":20,"star":7.4}},{"idx":27,"no":"S2, Ep27","title":"Building the Perfect Beast!","image":"https://m.media-amazon.com/images/M/MV5BNDUyODlhYTItNWY0Mi00MDAyLTgzN2MtMjg2MWU5NDc3NDJhXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNDUyODlhYTItNWY0Mi00MDAyLTgzN2MtMjg2MWU5NDc3NDJhXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"We start off in the middle of a heated battle between Kane and Tyson. Kane's losing control of his Cyber Dragoon as his energy is being drained by his Bit Beast. Kane almost passes out from expending so much of his strength. As Cyber Dragoon grows, it looks more and more like Tyson is about to lose, when Kai tells him the only way to get rid of the Cyber Bit Beast is for Tyson to destroy it. Tyson musters up all his power and in one fell swoop, Dragoon destroys its doppelganger. However, as Cyber Dragoon is blown to oblivion, so is the building they are in and it ...","publishedDate":"7 Feb. 2004","rating":{"count":20,"star":7.8}},{"idx":28,"no":"S2, Ep28","title":"Hot Rock","image":"https://m.media-amazon.com/images/M/MV5BMzc2NjEzNzEwNV5BMl5BanBnXkFtZTgwNzk4NzczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMzc2NjEzNzEwNV5BMl5BanBnXkFtZTgwNzk4NzczMjE@.jpg","plot":"After the kids arrive in NYC, Max's mother, Judy, takes them to the BBA research lab where she shows them an ancient rock, covered in mysterious writing. Judy reveals that not only is the rock believed to hold the secret of the Bit Beasts, but an organized crime syndicate is plotting to steal it. A test battle is fought, using a bit containing a piece of the rock but the power it produces is far too unstable. The Blader who performed the test turns out to be Max's school friend, Alan, and the two pals make plans to enter a Beyblade tournament scheduled for the next ...","publishedDate":"14 Feb. 2004","rating":{"count":23,"star":7.3}},{"idx":29,"no":"S2, Ep29","title":"Bad Seed in the Big Apple","image":"https://m.media-amazon.com/images/M/MV5BMTEwMTQxNTE4MzZeQTJeQWpwZ15BbWU4MDA1MTQwOTUx._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTEwMTQxNTE4MzZeQTJeQWpwZ15BbWU4MDA1MTQwOTUx.jpg","plot":"A rock with special powers to capture your opponents Bit Beast has been stolen from the lab where Max's mom Judy works at. Turns out that one of Max's friends from his old neighborhood, Alan, is connected to the heist. Not only are the police involved, but the BladeBreakers want to get to bottom of it too! But before the case can be solved, Max is entered in a tournament in New York City and as luck would have it, his first opponent turns out to be Alan! Alan tells Max that if Max wins, he'll explain why he agreed to steal the rock with a bunch of shady thieves. The ...","publishedDate":"21 Feb. 2004","rating":{"count":19,"star":7.3}},{"idx":30,"no":"S2, Ep30","title":"Get a Piece of the Rock","image":"https://m.media-amazon.com/images/M/MV5BMTU5MjYzODEzNV5BMl5BanBnXkFtZTgwODE5NzczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTU5MjYzODEzNV5BMl5BanBnXkFtZTgwODE5NzczMjE@.jpg","plot":"When the kids return to Japan accompanied by Judy, they are taken to an abandoned research facility where Mr. Dickenson had once worked on a similar rock with his old partner, Dr. Zagart. Like the one that was stolen from the BBA, this rock was covered in mysterious writing and possessed strange powers. Unfortunately, it too disappeared, along with Dr. Zagart who was never seen again. After a battle with Kenny and his new \"Einstein\" Beyblade, Tyson realizes he still has to learn how to control his new, ultra-powerful Beyblade, Dragoon V2. While practicing down by the ...","publishedDate":"28 Feb. 2004","rating":{"count":28,"star":7.5}},{"idx":31,"no":"S2, Ep31","title":"Attack of the Rock Bit Beast","image":"https://m.media-amazon.com/images/M/MV5BMmI2ZDk0MzktZDFiNC00YzBjLTgxZTctZWMwYzQ0OWYzN2E0XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMmI2ZDk0MzktZDFiNC00YzBjLTgxZTctZWMwYzQ0OWYzN2E0XkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"Mr. Dickenson and Max's Mom show up at Tyson's dojo empty-handed. Dr. Zagart and the mysterious rock have vanished without a trace. Knowing Dr. Zagart is the key to finding the missing rock, the BladeBreakers decide to launch their own search. One problem, they have no idea where to start looking. Meanwhile Dr. Zagart and Dr. K have designed a new powerful Blade using the rock, and they've chosen a Blader named Foxy to challenge our heroes. While Tyson is busy with Zeo, the boy he met the day before when he fought Ozuma, Foxy attacks. Never one to turn down a ...","publishedDate":"6 Mar. 2004","rating":{"count":19,"star":7.5}},{"idx":32,"no":"S2, Ep32","title":"Lots of Questions... Few Answers","image":"https://m.media-amazon.com/images/M/MV5BMTQ2ODM1OTg0MV5BMl5BanBnXkFtZTgwNjcxNjA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTQ2ODM1OTg0MV5BMl5BanBnXkFtZTgwNjcxNjA5NTE@.jpg","plot":"In the quiet after Foxy's storm, the BladeBreakers try to figure out who or what was behind his attack, and how it all tied into the mysterious Rock. Meanwhile, Tyson reaches a breaking point, discouraged and upset by the constant attempts of fanatic groups trying to steal the sacred bit-beasts. His anxiety goes overboard when he coaxes Kenny to create a wacky training platform for the team to practice with. He takes his jaded attitude out on Zeo, who simply wants to spar with one of the greats. At the same time, The Saint Shields' frustration level also grows, as ...","publishedDate":"13 Mar. 2004","rating":{"count":19,"star":7.2}},{"idx":33,"no":"S2, Ep33","title":"Rock Bottom!","image":"https://m.media-amazon.com/images/M/MV5BMjE1ODkxMzg5M15BMl5BanBnXkFtZTgwMDIwOTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjE1ODkxMzg5M15BMl5BanBnXkFtZTgwMDIwOTczMjE@.jpg","plot":"Mr. Dickenson deciphers the words that are carved onto the mysterious rocks and reads the kids this warning; \"Dare not disturb this stone, for here, the Bit Beasts are sealed.\" The kids realize that the Saint Shields are part of a clan which still uses this ancient language and they resolve to confront them, even if it means battling and losing their Beyblades in the bargain. Ozuma reveals the history of the Bit Beasts to the Bladebreakers, telling of them of their origin as benevolent spirits until evil men discovered how to control them and use them for their own ...","publishedDate":"20 Mar. 2004","rating":{"count":29,"star":7.7}},{"idx":34,"no":"S2, Ep34","title":"Itzy Bey-Itzy Spider","image":"https://m.media-amazon.com/images/M/MV5BN2Q1NjBkNDEtNzM3My00Yzk1LWIwNGYtMTFlNTM5YWVlNzM5XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BN2Q1NjBkNDEtNzM3My00Yzk1LWIwNGYtMTFlNTM5YWVlNzM5XkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"Ray's Driger has been stolen from him and embedded in a rock by Dr. Zagart's minions. Now it's up to Tyson who's determined to get it back. But before he can even attempt fighting anyone, he realizes he must train to get stronger or else he too could lose his Bit Beast. As the training season continues, Zeo shows up and sees Draciel and Dragoon in the sky doing battle. Suddenly he decides he must have a Bit Beast of his own, but everyone tells him you have to 'earn' a Bit Beast and it's 'not a toy.' Meanwhile, Doctor K has extracted a Spider Bit Beast from the rock ...","publishedDate":"27 Mar. 2004","rating":{"count":19,"star":7.2}},{"idx":35,"no":"S2, Ep35","title":"See No Bit Beast, Hear No Bit Beast","image":"https://m.media-amazon.com/images/M/MV5BYTU0MDNjMDItYjhkNy00NzgyLTk1ZWQtNGMwMmFhMTVjZDI5XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BYTU0MDNjMDItYjhkNy00NzgyLTk1ZWQtNGMwMmFhMTVjZDI5XkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"Kai is busy practicing his Beyblade skills alone in the park when out of nowhere a gust of wind appears and starts slicing everything to pieces. It turns out that it's the work of Jack, one of Dr. K's Blader's, and he's got a Bit Beast that harnesses the wind. Once the BladeBreakers figure this out, Ray volunteers to fight, but Kai stops him and sneaks out in the middle of the night to battle Jack. Discovering Kai is gone, the gang runs and finds him just as he's about to begin the battle. The gang realizes Kai doesn't stand a chance against this wind Bit Beast ...","publishedDate":"3 Apr. 2004","rating":{"count":19,"star":7.3}},{"idx":36,"no":"S2, Ep36","title":"Friends and Enemies","image":"https://m.media-amazon.com/images/M/MV5BMTUwMzAzNTc4Ml5BMl5BanBnXkFtZTgwOTUwNjE1NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTUwMzAzNTc4Ml5BMl5BanBnXkFtZTgwOTUwNjE1NTE@.jpg","plot":"Goaded by Dunga, Mariam goes off to capture Max's Draciel and finds him battling Dennis and his Bit Beast, Tyranno. Using his new Bit Finder Kenny measures Tyranno's impressive strength and is surprised when Dennis backs out of the battle before using its full power. Unaware that Mariam is following him, Max runs off in pursuit of Dennis and finds himself deep in the bowels of a mysterious building. He is ambushed by Dennis- who is now backed up by Dr. K and her Technicians. Mariam lies in wait, planning on taking Draciel once Tyranno weakens him. But when she ...","publishedDate":"10 Apr. 2004","rating":{"count":28,"star":7.6}},{"idx":37,"no":"S2, Ep37","title":"Beybattle at the Bit-Beast Corral","image":"https://m.media-amazon.com/images/M/MV5BYWFjZWIzZmEtN2M2MC00ZTIzLWJjNmItMWJmMDljMmY5NGVkXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BYWFjZWIzZmEtN2M2MC00ZTIzLWJjNmItMWJmMDljMmY5NGVkXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"Fed up with all the recent attempts by Zagart and others to acquire the BladeBreakers Bit Beasts for sinister purposes, The Saint Shields decide to take action. Having already acquired Ray's Bit-Beast Driger in an earlier match, the Saint Shields confront our heroes again. They challenge the BladeBreakers to a match at an abandoned amusement park. The BladeBreakers know that if they lose, The Saint Shields will seal their Bit Beasts away forever in a mysterious rock to prevent them from being used for evil. Despite this, the team accepts the challenge. In the ...","publishedDate":"17 Apr. 2004","rating":{"count":19,"star":7.3}},{"idx":38,"no":"S2, Ep38","title":"The Fate of the Spark Battle","image":"https://m.media-amazon.com/images/M/MV5BMzM2MDk0ODc2Nl5BMl5BanBnXkFtZTgwMDA3MTI5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMzM2MDk0ODc2Nl5BMl5BanBnXkFtZTgwMDA3MTI5NTE@.jpg","plot":"The Saint Shields have already captured Ray's Bit Beast, Driger, and now they've set their sights on capturing Kai's Dranzer. Dunga goes into battle against Kai and the fight intensifies as the blades race along the rails of an abandoned roller coaster to what looks like their doom. But suddenly, Joseph launches his blade and both Dunga and Joseph gang up on Kai! But just when things start to heat up, Ray launches his blade to try to even the score. As the battle rages, the roller coaster collapses around all the blades and it appears our heroes are done for, ...","publishedDate":"24 Apr. 2004","rating":{"count":19,"star":7.4}},{"idx":39,"no":"S2, Ep39","title":"The Bit Beast Bond","image":"https://m.media-amazon.com/images/M/MV5BMzk1OGRmN2EtMmRiYi00OTkyLThiZWEtMGU2OTg3MGQ0MmRlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMzk1OGRmN2EtMmRiYi00OTkyLThiZWEtMGU2OTg3MGQ0MmRlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"Ozuma, leader of the Saint Shields gang makes a final play for the BladeBreakers four Bit Beasts. During his battle with Tyson, it is revealed that he comes from an ancient group that is sworn to capture and contain all the Bit Beasts in the world. Thus protecting them from falling into the wrong hands and being used for evil purposes. However, once the battle heats up Ozuma's jealousy of Tyson's Beyblading skill takes him over. Pulling out all the stops, he forces Tyson to decide to give up the battle and surrender his Bit Beast or have his Blade destroyed. In a ...","publishedDate":"1 May 2004","rating":{"count":21,"star":7.6}},{"idx":40,"no":"S2, Ep40","title":"Squeeze Play","image":"https://m.media-amazon.com/images/M/MV5BMTUxOTIzOTI3MF5BMl5BanBnXkFtZTgwODUwNjE1NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTUxOTIzOTI3MF5BMl5BanBnXkFtZTgwODUwNjE1NTE@.jpg","plot":"We start off in the middle of a heated battle between Kane and Tyson. Kane's losing control of his Cyber Dragoon as his energy is being drained by his Bit Beast. Kane almost passes out from expending so much of his strength. As Cyber Dragoon grows, it looks more and more like Tyson is about to lose, when Kai tells him the only way to get rid of the Cyber Bit Beast is for Tyson to destroy it. Tyson musters up all his power and in one fell swoop, Dragoon destroys its doppelganger. However, as Cyber Dragoon is blown to oblivion, so is the building they are in and it ...","publishedDate":"8 May 2004","rating":{"count":29,"star":7.7}},{"idx":41,"no":"S2, Ep41","title":"Who's Your Daddy?","image":"https://m.media-amazon.com/images/M/MV5BMTY3ODY3OTIzMl5BMl5BanBnXkFtZTgwOTA1NDA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTY3ODY3OTIzMl5BMl5BanBnXkFtZTgwOTA1NDA5NTE@.jpg","plot":"The BladeBreakers show up at the World Championship Tournament and go up into the stands to cheer on Zeo who's fighting in the preliminaries. Tyson is pumped watching his new friend who wins his first fight with ease. Later backstage, Tyson tells Zeo he's totally impressed and asks if Zeo would like to become his training partner. Zeo excitedly agrees. Meanwhile back at Zagart's lab, Doctor K is on the verge of removing the strongest Bit Beast in the world from the rock. But just before she can finish, Zagart enters and terminates her on the spot. That night at Zeo's ...","publishedDate":"15 May 2004","rating":{"count":20,"star":7.4}},{"idx":42,"no":"S2, Ep42","title":"Fortunes Dear and Dire","image":"https://m.media-amazon.com/images/M/MV5BMTczNjEzOTMyM15BMl5BanBnXkFtZTgwOTkwNjQzNjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTczNjEzOTMyM15BMl5BanBnXkFtZTgwOTkwNjQzNjE@.jpg","plot":"Zeo focuses on Beyblade training with his father Zagart. The most powerful rock Bit-Beast named Cerberus is designated for Zeo, but he must first be able to summon it. Zeo trains furiously, but the elusive Bit Beast never fully materializes. Meanwhile, the Bladebreakers must choose their two team-pairs for the World Beyblade Championships. Hilary brings in a pile of her fortune-telling books to help. They decide that Tyson will team with Max, and Kai with Ray. Not long afterward, Kai meets a strange pair named King and Queen, who are very impressed by Dranzer. They ...","publishedDate":"22 May 2004","rating":{"count":19,"star":7.3}},{"idx":43,"no":"S2, Ep43","title":"Kai's Royal Flush","image":"https://m.media-amazon.com/images/M/MV5BMTg4MDM5Mjg5N15BMl5BanBnXkFtZTgwNzQ2NDA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTg4MDM5Mjg5N15BMl5BanBnXkFtZTgwNzQ2NDA5NTE@.jpg","plot":"While all that the Bladebreakers can think of are the finals, Kai can't stop obsessing about King and Queen. With a brand new Beyblade crafted for him by Max, Kai longs for a rematch. But Kai isn't the only one with the royal pair on his mind. Doctor K tracks the duo down and offers them a chance to team up with her so they can capture and wield the power of the four sacred Bit Beasts together. The pair blow her off, interested only in their quests for stealing the perfect Beyblade parts. That is, until they meet up with Kai once more. In a coincidental encounter, Kai...","publishedDate":"29 May 2004","rating":{"count":19,"star":7.3}},{"idx":44,"no":"S2, Ep44","title":"The Calm Before the Storm","image":"https://m.media-amazon.com/images/M/MV5BMTQyMTIwNTI3NF5BMl5BanBnXkFtZTgwNzA5NzczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTQyMTIwNTI3NF5BMl5BanBnXkFtZTgwNzA5NzczMjE@.jpg","plot":"After disappearing thirty years ago, Zagart confronts Mr. Dickenson, forcing him to enter Zeo in the World Championship Finals. He reveals that Zeo is his son and that he won't show mercy when he confronts the Bladebreakers in the tournament. The Bladebreakers try to attend Zeo's match so they can find out what's happened to him but arrive at the arena too late. Meanwhile, Dr. K works with King and Queen to improve their powers so they can get the four sacred Bit Beasts for her. At the opening night gala, the final pairings are announced but tensions reach a boiling ...","publishedDate":"5 Jun. 2004","rating":{"count":23,"star":7.2}},{"idx":45,"no":"S2, Ep45","title":"Zeo vs. Ozuma","image":"https://m.media-amazon.com/images/M/MV5BMTAyNjM2OTYzODNeQTJeQWpwZ15BbWU4MDUwNzEyOTUx._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTAyNjM2OTYzODNeQTJeQWpwZ15BbWU4MDUwNzEyOTUx.jpg","plot":"The Beyblade World Championship Finals are underway and eight teams convene to compete for the title. The BladeBreakers are shocked to see that their old friend Zeo is in the competition and Tyson confronts him to find out why he has decided to compete against them. It turns out that Zeo is the son of Zagart, an old colleague of Mr. Dickenson's who stole the ancient rock that contained captured Bit Beasts. Zagart has already made it known to the BladeBreakers that he wants their Bit Beasts and he's going to use Zeo to get them. Once the competition begins, Zeo's team ...","publishedDate":"12 Jun. 2004","rating":{"count":20,"star":7.6}},{"idx":46,"no":"S2, Ep46","title":"Black and White Evil Powers","image":"https://m.media-amazon.com/images/M/MV5BNDAzNDY5NTQ2N15BMl5BanBnXkFtZTgwMjU2NDA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNDAzNDY5NTQ2N15BMl5BanBnXkFtZTgwMjU2NDA5NTE@.jpg","plot":"The World Beyblade Championships continue and the next round has Tyson and Max squaring off against Kane and Jim. Kane and Jim decide to have a little practice battle at the beach. But King and Queen show up and in a surprise attack, they jump into battle and literally destroy Kane and Jim's Beyblades, forcing them to withdraw from the tournament. So the next battle up is King and Queen facing Mariam and Joseph from the Saint Shields. Mariam and Queen launch first, and as they battle, King suddenly launches his blades making it two against one which is totally illegal...","publishedDate":"19 Jun. 2004","rating":{"count":18,"star":7.4}},{"idx":47,"no":"S2, Ep47","title":"Deceit from Above","image":"https://m.media-amazon.com/images/M/MV5BMjA0MDQ1MjQxOV5BMl5BanBnXkFtZTgwMTEyNDA5NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjA0MDQ1MjQxOV5BMl5BanBnXkFtZTgwMTEyNDA5NTE@.jpg","plot":"In the Semi-Final round of the World Beyblade Championships, Max & Tyson take on King & Queen. Doctor K tempts Queen into using a vicious new attack ring she's created called 'The Shredder'. Queen uses it against Max, and nearly grinds Draciel into a pulp. But with Max using the new Draciel V2 Judy gave him, and having the will of the crowd and his teammates behind him, Max overcomes this attack, destroys Queen's Beyblade, and wins the first match of the best-of-two. Next up, is King versus Tyson, who has an improved Beyblade of his own, thanks to Kenny's ingenuity. ...","publishedDate":"26 Jun. 2004","rating":{"count":19,"star":7.3}},{"idx":48,"no":"S2, Ep48","title":"Phoenix Falling","image":"https://m.media-amazon.com/images/M/MV5BMTY3MjcxNTgxMF5BMl5BanBnXkFtZTgwNjA5NzczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTY3MjcxNTgxMF5BMl5BanBnXkFtZTgwNjA5NzczMjE@.jpg","plot":"The second semi-final round begins pitting Kai and Ray against the surprising Zeo and Gordo. Ray faces Gordo first and attacks fiercely but Orthrus always seems to evade Driger's attacks. Zagart has programmed all of the Bladebreakers moves into Zeo and Gordo's Beyblades, making them unbeatable. Soon, Driger is almost out of power and Gordo seizes his chance. But when Kai reminds Ray of the pain he felt losing Driger to Dunga, Ray taps into his Beyblade spirit and helps Driger salvage a tie. Victory now rests on Kai's shoulders. Kai and Zeo begin an awesome duel, ...","publishedDate":"3 Jul. 2004","rating":{"count":23,"star":7.2}},{"idx":49,"no":"S2, Ep49","title":"The Enemy Within","image":"https://m.media-amazon.com/images/M/MV5BYzI4YjUyYjEtODRhYS00OTVlLTg3ODItODE3ZjVlMmVjZTAyXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BYzI4YjUyYjEtODRhYS00OTVlLTg3ODItODE3ZjVlMmVjZTAyXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"The stress of competing in the World Beyblade Championships has begun to fracture the BladeBreakers. Kai loses his match and his Bit Beast Dranzer to Zeo. This makes Zeo even more powerful and puts the rest of BladeBreakers on edge. Tyson takes it hardest of all, and when he confronts his old friend he gets an earful on what it takes to be a real Beyblading champion. \"A true Beyblade Champion fights alone and doesn't need a team or friends to win!\" Tyson takes this message to heart and decides to turn his back on his teammates. Meanwhile Kai, racked with guilt over ...","publishedDate":"10 Jul. 2004","rating":{"count":19,"star":7.5}},{"idx":50,"no":"S2, Ep50","title":"Clash of the Tyson","image":"https://m.media-amazon.com/images/M/MV5BNDQyOTgwNzE5N15BMl5BanBnXkFtZTgwMzYwNjE1NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNDQyOTgwNzE5N15BMl5BanBnXkFtZTgwMzYwNjE1NTE@.jpg","plot":"Ray's Driger has been stolen from him and embedded in a rock by Dr. Zagart's minions. Now it's up to Tyson who's determined to get it back. But before he can even attempt fighting anyone, he realizes he must train to get stronger or else he too could lose his Bit Beast. As the training season continues, Zeo shows up and sees Draciel and Dragoon in the sky doing battle. Suddenly he decides he must have a Bit Beast of his own, but everyone tells him you have to 'earn' a Bit Beast and it's 'not a toy.' Meanwhile, Doctor K has extracted a Spider Bit Beast from the rock ...","publishedDate":"17 Jul. 2004","rating":{"count":23,"star":7.4}},{"idx":51,"no":"S2, Ep51","title":"Destiny of the Final Battle","image":"https://m.media-amazon.com/images/M/MV5BZGQ3MTM3OTUtNjNmOS00OWU1LTk2ZTAtNjUzNzE5MTI1NzVlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BZGQ3MTM3OTUtNjNmOS00OWU1LTk2ZTAtNjUzNzE5MTI1NzVlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"It's the finals of the World Beyblading Championships and Tyson is about to defend his title against Zeo who fights with the extra power of the Bit Beasts he's captured. But something strange is revealed at the start of the battle - turns out Zeo isn't human after all! In fact, he's a robot Zagart created to replace his real son who died in a tragic accident. And according to the evil doctor, if Zeo can capture Tyson's Dragoon, then by using all the Sacred Bit Beasts powers, Zeo will be turned into a real boy! The battle rages on and Zeo seems to be the aggressor. ...","publishedDate":"24 Jul. 2004","rating":{"count":23,"star":8.1}}]},{"id":"1","name":"Season 1","episodes":[{"idx":1,"no":"S1, Ep1","title":"The Blade Raider","image":"https://m.media-amazon.com/images/M/MV5BOTE5YzVlNTQtOGY2Mi00NGZhLThhM2ItZTBhNGI0OTMzMGY1XkEyXkFqcGdeQXVyMjg2ODM5OTQ@._V1_UY126_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BOTE5YzVlNTQtOGY2Mi00NGZhLThhM2ItZTBhNGI0OTMzMGY1XkEyXkFqcGdeQXVyMjg2ODM5OTQ@.jpg","plot":"Tyson is at home practicing martial arts with his grandfather when suddenly he realizes he's late for a Beyblade battle with Andrew. As he runs out of his house he's confronted by a couple of bullies who only slow him up for his real battle. But when Tyson does show up, Andrew and his friends are met by a smart mouthed kid named Carlos who's a member of the notorious Blade Sharks.","publishedDate":"6 Jul. 2002","rating":{"count":84,"star":6.8}},{"idx":2,"no":"S1, Ep2","title":"Day of the Dragoon","image":"https://m.media-amazon.com/images/M/MV5BODI0MDk5NTQ5MV5BMl5BanBnXkFtZTgwMjMxOTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BODI0MDk5NTQ5MV5BMl5BanBnXkFtZTgwMjMxOTczMjE@.jpg","plot":"Tyson battles Kai one on one, but to his surprise, Tyson quickly loses. The Chief informs Tyson, that in order to beat Kai, you need a strategy, so Tyson goes home in an attempt to practice until he's perfected his fighting technique. Later that day, Andrew and Kenny, along with Dizzi show up and attempt to increase the power of Tyson's blade to match that of Kai, but with little success.","publishedDate":"6 Jul. 2002","rating":{"count":66,"star":6.8}},{"idx":3,"no":"S1, Ep3","title":"Take It to the Max!","image":"https://m.media-amazon.com/images/M/MV5BNjMzODkwOTI5N15BMl5BanBnXkFtZTgwNjI4NTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNjMzODkwOTI5N15BMl5BanBnXkFtZTgwNjI4NTczMjE@.jpg","plot":"In a moment of heroism, Max, the new Beyblader in town, shows Tyson that with the proper skill and training, there is nothing that can't be achieved. The two soon become fast friends, leaving Kenny feeling left out.","publishedDate":"7 Jul. 2002","rating":{"count":60,"star":6.5}},{"idx":4,"no":"S1, Ep4","title":"The Qualifier Begins","image":"https://m.media-amazon.com/images/M/MV5BMTUzODkyNjk3Ml5BMl5BanBnXkFtZTgwODYxMTgzMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTUzODkyNjk3Ml5BMl5BanBnXkFtZTgwODYxMTgzMjE@.jpg","plot":"The Beyblade Regional Qualifying Tournament is underway as Tyson, Max, Ray and even Kenny are entered to see if they can dethrone Kai, the reigning champion. As our announcers, Brad Best and A.J. Topper rev up the crowd, Kenny is first into battle but without a Bit Beast in his blade, he falls quickly to Kai.","publishedDate":"13 Jul. 2002","rating":{"count":59,"star":6.5}},{"idx":5,"no":"S1, Ep5","title":"Draciel of Approval","image":"https://m.media-amazon.com/images/M/MV5BMzkwMDYyMDg3Ml5BMl5BanBnXkFtZTgwNjQxOTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMzkwMDYyMDg3Ml5BMl5BanBnXkFtZTgwNjQxOTczMjE@.jpg","plot":"Max is completely overpowered in his semi-finals match against Kai. It's not until the Bit Beast known as Draciel emerges from Max's Grandmother's pendant, to add its power to Max's Beyblade that the tables begin to turn.","publishedDate":"20 Jul. 2002","rating":{"count":53,"star":6.6}},{"idx":6,"no":"S1, Ep6","title":"Dragoon Storm","image":"https://m.media-amazon.com/images/M/MV5BMjAwMzU2OTAwM15BMl5BanBnXkFtZTgwNjgxOTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjAwMzU2OTAwM15BMl5BanBnXkFtZTgwNjgxOTczMjE@.jpg","plot":"The Qualifying Tournament is in its final stages as Tyson has advanced to face Ray in the semi-finals. As the best of three battles gets underway, Tyson's bravado quickly fades as Ray handily wins the first round when he destroys Tyson's Beyblade with his famous Tiger Claw Attack.","publishedDate":"20 Jul. 2002","rating":{"count":58,"star":6.7}},{"idx":7,"no":"S1, Ep7","title":"Thirteen Candles","image":"https://m.media-amazon.com/images/M/MV5BMjU3OTc2Mzc3Nl5BMl5BanBnXkFtZTgwMTUyMTgzMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjU3OTc2Mzc3Nl5BMl5BanBnXkFtZTgwMTUyMTgzMjE@.jpg","plot":"The National Beyblade Championship Match is set, with Tyson facing off against reigning champion, Kai. It's not until Grandpa throws a surprise party for Tyson, that the rookie sensation realizes he's forgotten his own Birthday!","publishedDate":"21 Jul. 2002","rating":{"count":56,"star":6.8}},{"idx":8,"no":"S1, Ep8","title":"Bladin' in the Streets","image":"https://m.media-amazon.com/images/M/MV5BMjE3NDQ2NDU5MV5BMl5BanBnXkFtZTgwOTE4NTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjE3NDQ2NDU5MV5BMl5BanBnXkFtZTgwOTE4NTczMjE@.jpg","plot":"The BBA Revolution team fly to New York City for the Beyblade World Championships. The normally feisty Daichi proves to be afraid of flying, and once in the city, he becomes overwhelmed by the size and scope of things in the Big Apple. While eating lunch in a sidewalk café, Tyson and Daichi have their beyblades stolen by a young pickpocket and together they scouring the streets for the culprit. Tyson meanwhile, exhibits his first real sympathy for his diminutive teammate, and vows to go easier on him. Just as the pair are about to give up the search, Tyson hears the ...","publishedDate":"27 Jul. 2002","rating":{"count":53,"star":6.2}},{"idx":9,"no":"S1, Ep9","title":"Showdown in Hong Kong","image":"https://m.media-amazon.com/images/M/MV5BNDMxNDE5NzY3MV5BMl5BanBnXkFtZTgwNTQxOTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNDMxNDE5NzY3MV5BMl5BanBnXkFtZTgwNTQxOTczMjE@.jpg","plot":"Our heroes arrive in Hong Kong on a stop-over to the Asian Beyblade Tournament when they run into Ray's old gang the White Tigers. A confrontation quickly ensues with no one coming out the clear winner.","publishedDate":"28 Jul. 2002","rating":{"count":54,"star":5.9}},{"idx":10,"no":"S1, Ep10","title":"Battle in the Sky","image":"https://m.media-amazon.com/images/M/MV5BMjI0NTcxNjcwOF5BMl5BanBnXkFtZTgwOTAxMTgzMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjI0NTcxNjcwOF5BMl5BanBnXkFtZTgwOTAxMTgzMjE@.jpg","plot":"The first round of the Asian Tournament sees the Bladebreakers facing off against the team called the Tall-Boys, with Ray's ex-teammates, The White Tigers, waiting in the wings.","publishedDate":"3 Aug. 2002","rating":{"count":55,"star":6.1}},{"idx":11,"no":"S1, Ep11","title":"Bye Bye Bit Beast","image":"https://m.media-amazon.com/images/M/MV5BMTg2ODI0MTE5N15BMl5BanBnXkFtZTgwNzM5NDE1NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTg2ODI0MTE5N15BMl5BanBnXkFtZTgwNzM5NDE1NTE@.jpg","plot":"Kai is busy practicing his Beyblade skills alone in the park when out of nowhere a gust of wind appears and starts slicing everything to pieces. It turns out that it's the work of Jack, one of Dr. K's Blader's, and he's got a Bit Beast that harnesses the wind. Once the BladeBreakers figure this out, Ray volunteers to fight, but Kai stops him and sneaks out in the middle of the night to battle Jack. Discovering Kai is gone, the gang runs and finds him just as he's about to begin the battle. The gang realizes Kai doesn't stand a chance against this wind Bit Beast ...","publishedDate":"4 Aug. 2002","rating":{"count":50,"star":6.1}},{"idx":12,"no":"S1, Ep12","title":"Adios Bladebreakers","image":"https://m.media-amazon.com/images/M/MV5BMjE1MTc1Mjc3NV5BMl5BanBnXkFtZTgwNDUxOTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjE1MTc1Mjc3NV5BMl5BanBnXkFtZTgwNDUxOTczMjE@.jpg","plot":"After realizing his Bit Beast is gone, Ray decides to head for the mountains in an attempt to get it back. Tyson and Mariah give chase and confront Ray to decide which team he wants to be on.","publishedDate":"10 Aug. 2002","rating":{"count":53,"star":6.1}},{"idx":13,"no":"S1, Ep13","title":"Crouching Lion, Hidden Tiger","image":"https://m.media-amazon.com/images/M/MV5BMjA1OTI1NTU0MV5BMl5BanBnXkFtZTgwMDQxOTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjA1OTI1NTU0MV5BMl5BanBnXkFtZTgwMDQxOTczMjE@.jpg","plot":"The White Tiger Team faces off against the Spin-Shepards in the quarterfinals of the Asian Tournament. When Ray sees that Lee is also using the 'Tiger Claw' attack, he is forced to finally open up to his teammates about his mysterious past.","publishedDate":"11 Aug. 2002","rating":{"count":53,"star":6.3}},{"idx":14,"no":"S1, Ep14","title":"The Race Is On!","image":"https://m.media-amazon.com/images/M/MV5BMjI2NjY1NDgxM15BMl5BanBnXkFtZTgwMjM4NTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjI2NjY1NDgxM15BMl5BanBnXkFtZTgwMjM4NTczMjE@.jpg","plot":"It's the morning of the semi-finals at the Asian Beyblade Tournament and Tyson manages to sleep in. The rest of the team leaves early, but Ray stays behind to make sure Tyson wakes up. As the tournament gets underway, Max is the first to battle. Meanwhile, Ray and Tyson are caught up in a traffic jam created by a landslide, so they decide to walk. But the shortest route is over a mountain where Ray sprains his ankle and Tyson is left to carrying him all the way to there.","publishedDate":"17 Aug. 2002","rating":{"count":53,"star":6.2}},{"idx":15,"no":"S1, Ep15","title":"Going for the Gold","image":"https://m.media-amazon.com/images/M/MV5BMTUxODkyMzE1M15BMl5BanBnXkFtZTgwMTAxMTgzMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTUxODkyMzE1M15BMl5BanBnXkFtZTgwMTAxMTgzMjE@.jpg","plot":"The finals are about to begin in the Asian Qualifying Tournament with the winning team advancing to the World Beyblading Championships. In the first round, Max goes against Gary from the White Tigers in a best of three battle. The first round goes without a hitch as Max easily takes care of his opponent and with the win, Max becomes a little over confident.","publishedDate":"18 Aug. 2002","rating":{"count":51,"star":6.1}},{"idx":16,"no":"S1, Ep16","title":"My Enemy, My Friend","image":"https://m.media-amazon.com/images/M/MV5BN2RjMTJjOGEtNzdkMi00YzVmLWJmYzgtZmVlNmU4NTQ4NTAzXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BN2RjMTJjOGEtNzdkMi00YzVmLWJmYzgtZmVlNmU4NTQ4NTAzXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"During the finals of the Asian Tournament, Ray faces off against his old teammate, and former friend, Mariah. When Galux and Driger team up to show the pair a glimpse of the happiness they shared in the past, Ray and Mariah come to realize how much they have lost, by being rivals.","publishedDate":"24 Aug. 2002","rating":{"count":50,"star":6}},{"idx":17,"no":"S1, Ep17","title":"A Score to Settle","image":"https://m.media-amazon.com/images/M/MV5BMjI4ODg5MjU1MV5BMl5BanBnXkFtZTgwNjMxOTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjI4ODg5MjU1MV5BMl5BanBnXkFtZTgwNjMxOTczMjE@.jpg","plot":"The final match of the Asian Beyblade Tournament reaches an uncertain conclusion when Tyson and Lee's decisive battle ends in a draw. The resulting sudden death session between Ray and Lee rekindles the pair's old hometown grievances.","publishedDate":"25 Aug. 2002","rating":{"count":52,"star":6.4}},{"idx":18,"no":"S1, Ep18","title":"A Star Is Born","image":"https://m.media-amazon.com/images/M/MV5BMjM0NTQ5MjEzM15BMl5BanBnXkFtZTgwNjA4NTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjM0NTQ5MjEzM15BMl5BanBnXkFtZTgwNjA4NTczMjE@.jpg","plot":"Fresh from the Bladebreakers win in Asia, Tyson comes home and realizes he's front page news! With his ego out of control, Tyson takes on the attitude of a rock star, which upsets Kenny who tries to keep him focused on blading and not his popularity. Meanwhile, at a local playground, the local kids are all out Beyblading when Tyson spots a kid (Nicky), being smoked in the Beystadium by a bully (Riley). After Nicky's blade is completely destroyed, Tyson vows to help the kid fix it and fight his way back.After enlisting the help of Max, Kenny and Dizzi, Tyson manages to...","publishedDate":"31 Aug. 2002","rating":{"count":47,"star":6.3}},{"idx":19,"no":"S1, Ep19","title":"Under the Microscope","image":"https://m.media-amazon.com/images/M/MV5BMTY2MDU2NjIxMl5BMl5BanBnXkFtZTgwNTYxMTgzMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTY2MDU2NjIxMl5BMl5BanBnXkFtZTgwNTYxMTgzMjE@.jpg","plot":"The Bladebreakers arrive in the USA for the American Tournament. During a tour of a BBA research facility, Max is shocked to learn that his Mom works there, and not at the college, like he thought. To make matters worse, the team discovers that they are being tested for weaknesses, by a competing team.","publishedDate":"1 Sep. 2002","rating":{"count":48,"star":6.2}},{"idx":20,"no":"S1, Ep20","title":"It's All Relative","image":"https://m.media-amazon.com/images/M/MV5BOTg5MDgyMzYwNF5BMl5BanBnXkFtZTgwMTkxMTgzMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BOTg5MDgyMzYwNF5BMl5BanBnXkFtZTgwMTkxMTgzMjE@.jpg","plot":"After their non-competition loss to Emily of the All Starz at the BBA Research Center, the Blade Breakers sneak around the high-tech facility, hoping to learn more about their competition. There, they confront two other All Starz, and Max learns more about his Mom's job at the BBA - specifically, a rumor of why Max wasn't asked to join the All Starz Team.","publishedDate":"7 Sep. 2002","rating":{"count":49,"star":6.2}},{"idx":21,"no":"S1, Ep21","title":"Practice Makes Perfect","image":"https://m.media-amazon.com/images/M/MV5BMTk5Mjc3OTMzN15BMl5BanBnXkFtZTgwMTg5ODczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTk5Mjc3OTMzN15BMl5BanBnXkFtZTgwMTg5ODczMjE@.jpg","plot":"For some strange reason, Mr. Dickenson has sent the Blade Breakers to a remote mountain retreat to hone their blading skills for the upcoming American Tournament as well as to get Kenny and Dizzi to figure out a way to increase Ray's Bit Beast's power. Once there, they meet up with a enthusiastic young boy named Antonio who they think is there to train them. Turns out, Antonio is a pathetic blader.Frustrated, the Breakers question the reason why Mr. Dickenson would send them all the way up to the middle of nowhere to train without any descent equipment. Turns out, the...","publishedDate":"8 Sep. 2002","rating":{"count":46,"star":7.1}},{"idx":22,"no":"S1, Ep22","title":"Blading with the Stars!","image":"https://m.media-amazon.com/images/M/MV5BNTA1MzQyMzg3N15BMl5BanBnXkFtZTgwMTIxOTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNTA1MzQyMzg3N15BMl5BanBnXkFtZTgwMTIxOTczMjE@.jpg","plot":"A charity event in the Heartland of America gives the Bladebreakers a taste of the All Starz' prowess. Featuring celebrities in a three-on-three contest against young Beybladers of note, Emily of the All Starz, bullies her way to an easy win. It isn't until Emily knocks out her own opponent, loses the second match and is on her way to throwing the whole competition, that Max teaches her what teamwork is all about.","publishedDate":"14 Sep. 2002","rating":{"count":44,"star":6.9}},{"idx":23,"no":"S1, Ep23","title":"Showdown in Vegas","image":"https://m.media-amazon.com/images/M/MV5BMTQ3MzMxNDc0Ml5BMl5BanBnXkFtZTgwNDQwOTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTQ3MzMxNDc0Ml5BMl5BanBnXkFtZTgwNDQwOTczMjE@.jpg","plot":"The Bladebreakers arrive in Las Vegas for the start of the American Tournament. Tyson looks forward to facing off against the arrogant All-Starz, and their scientifically advanced Beyblades...but first his team needs to get past the 'Renegades' in the qualifying round. Kai surprises everyone by stepping into the dish for the first battle!","publishedDate":"15 Sep. 2002","rating":{"count":45,"star":6.9}},{"idx":24,"no":"S1, Ep24","title":"Viva Las Vegas","image":"https://m.media-amazon.com/images/M/MV5BMTYyMDY2NTQzMl5BMl5BanBnXkFtZTgwNjAyOTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTYyMDY2NTQzMl5BMl5BanBnXkFtZTgwNjAyOTczMjE@.jpg","plot":"The Blade Breakers have advanced to the second round of the American Tournament where they square off against the Savage Slammers. The winner of this round advances to the semi-finals. Their competition first appears to be a bunch of slackers, but when Ray loses out in the first round, they quickly realize what they're up against. Max is next, and for some odd reason, his rival folds under pressure, so the best of three is tied at one a piece with Tyson coming in for the deciding battle.At first it looks like a quick win for the Slammers simply because of the size of ...","publishedDate":"21 Sep. 2002","rating":{"count":46,"star":7.5}},{"idx":25,"no":"S1, Ep25","title":"My Way or the Highway","image":"https://m.media-amazon.com/images/M/MV5BOTQ4Mjc0OTA5MV5BMl5BanBnXkFtZTgwNzI1NDczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BOTQ4Mjc0OTA5MV5BMl5BanBnXkFtZTgwNzI1NDczMjE@.jpg","plot":"It's the Bladebreakers versus Spintensity in the semi-finals of the American Tournament. But before the match can begin, Tyson is forced to withdraw with a stomachache he got from too much celebratory eating. Max, Ray and Kai must drag race their crafty foes through the whirlwind, highway-themed dish called the New Jersey Turnpike.","publishedDate":"22 Sep. 2002","rating":{"count":45,"star":7.2}},{"idx":26,"no":"S1, Ep26","title":"Catch a Shooting All-Star","image":"https://m.media-amazon.com/images/M/MV5BMTYyNjgxMzc1NV5BMl5BanBnXkFtZTgwOTAyMDgzMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTYyNjgxMzc1NV5BMl5BanBnXkFtZTgwOTAyMDgzMjE@.jpg","plot":"Tensions rise as the American Tournament heats up. Max fights for a chance to beyblade against his mother's team the All-Starz in an upcoming match, while Tyson and the rest of the Bladebreakers realize that the All-Starz are a bigger threat then they previously thought. At the end of two tense rounds, Tyson and Steven are tied one-all...","publishedDate":"27 Sep. 2002","rating":{"count":44,"star":7.2}},{"idx":27,"no":"S1, Ep27","title":"The Battle of America","image":"https://m.media-amazon.com/images/M/MV5BMTg3NzcwOTE4OF5BMl5BanBnXkFtZTgwNTcxMDgzMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTg3NzcwOTE4OF5BMl5BanBnXkFtZTgwNTcxMDgzMjE@.jpg","plot":"The finals continue. Can the Blade Breakers muster the strength to win, or will the All Starz become the new American Champions?","publishedDate":"28 Sep. 2002","rating":{"count":43,"star":7.2}},{"idx":28,"no":"S1, Ep28","title":"Bottom of the Ninth","image":"https://m.media-amazon.com/images/M/MV5BMjIyOTU4MjY1Ml5BMl5BanBnXkFtZTgwOTgxMDgzMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjIyOTU4MjY1Ml5BMl5BanBnXkFtZTgwOTgxMDgzMjE@.jpg","plot":"The deciding match of the American Tournament Finals comes down to Max vs. Michael of the 'All Starz,' in a battle that pits science and technology against human spirit. Unfortunately for Max and the Bladebreakers, the trick dish turns out to be a replica of a baseball diamond...where Michael feels right at home!","publishedDate":"5 Oct. 2002","rating":{"count":45,"star":7.3}},{"idx":29,"no":"S1, Ep29","title":"Play It Again, Dizzi!","image":"https://m.media-amazon.com/images/M/MV5BMTk4MDEzMjU1OV5BMl5BanBnXkFtZTgwMzgxMDgzMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTk4MDEzMjU1OV5BMl5BanBnXkFtZTgwMzgxMDgzMjE@.jpg","plot":"After narrowly defeating the All Starz at the American Tournament, Kenny decides he should record a database of the highs and low points of the BladeBreakers since the very beginning. In fact, through a series of flashbacks, the Chief along with Dizzi, takes a trip down memory lane as far back to the first time he ever met Tyson. With clips from various shows, Kenny narrates the progress of his friends who eventually form the BladeBreakers and go on to the Asian Tournament.After watching the progress of his team, evaluating individual battles to eventually winning the...","publishedDate":"6 Oct. 2002","rating":{"count":43,"star":6.8}},{"idx":30,"no":"S1, Ep30","title":"Cruising for a Bruising","image":"https://m.media-amazon.com/images/M/MV5BMzQ2OTQ4ODk2Nl5BMl5BanBnXkFtZTgwNTA0NjczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMzQ2OTQ4ODk2Nl5BMl5BanBnXkFtZTgwNTA0NjczMjE@.jpg","plot":"Traveling by boat across the Atlantic, the Bladebreakers must not only deal with Kenny's seasickness, but a gut-wrenching revelation. Tyson's on-board defeat at the hands of a mysterious foe - one wielding a Bit-Beast larger and stronger than any they've ever seen - exposes the team's vulnerability going into the Russian Tournament","publishedDate":"12 Oct. 2002","rating":{"count":43,"star":7.4}},{"idx":31,"no":"S1, Ep31","title":"London Calling","image":"https://m.media-amazon.com/images/M/MV5BMTY2NTQ2NjI4MF5BMl5BanBnXkFtZTgwOTI0NjczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTY2NTQ2NjI4MF5BMl5BanBnXkFtZTgwOTI0NjczMjE@.jpg","plot":"The kids are tricked into missing their boat, forcing them to spend the night in London where a mysterious videotape of Tyson's father is delivered to them. Later, Tyson's Beyblade is stolen and the kids are lured into a fight with the evil Cenotaph and his powerful Bit Beast, Sarcopholon. All seems lost until Kai defeats the mummy by using his own strengths against him. The team agrees to travel by land, learning from every European Beyblader they can find.","publishedDate":"19 Oct. 2002","rating":{"count":43,"star":7.3}},{"idx":32,"no":"S1, Ep32","title":"Darkness at the End of the Tunnel...","image":"https://m.media-amazon.com/images/M/MV5BMjM4MDAzMDc3Ml5BMl5BanBnXkFtZTgwMTY0NjczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjM4MDAzMDc3Ml5BMl5BanBnXkFtZTgwMTY0NjczMjE@.jpg","plot":"After their train is mysteriously hijacked, the kids find themselves in the dark recesses of a tunnel. This is where the Bladebreakers meet the members of the Dark Bladers! Soon the team is forced into a beyblade match to rescue Kenny from the monsters' evil clutches! But Kenny isn't the only prize in this dark match-up. For if the Bladebreakers lose, their bit-beasts are up for grabs...","publishedDate":"20 Oct. 2002","rating":{"count":44,"star":7.4}},{"idx":33,"no":"S1, Ep33","title":"Last Tangle in Paris","image":"https://m.media-amazon.com/images/M/MV5BMTkwMzgzMTE4MV5BMl5BanBnXkFtZTgwMzczNjczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTkwMzgzMTE4MV5BMl5BanBnXkFtZTgwMzczNjczMjE@.jpg","plot":"The Bladebreakers arrive in Paris, but the Dark Bladers follow them there. Can the Bladebreakers handle one more battle with the Dark Bladers or will additional and unexpected help come to save them?","publishedDate":"26 Oct. 2002","rating":{"count":42,"star":7.3}},{"idx":34,"no":"S1, Ep34","title":"Art Attack","image":"https://m.media-amazon.com/images/M/MV5BMTAzNDU3MzA2NTleQTJeQWpwZ15BbWU4MDY5MDk3MzIx._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTAzNDU3MzA2NTleQTJeQWpwZ15BbWU4MDY5MDk3MzIx.jpg","plot":"The Bladebreakers spend an extra day in Paris and split up to see the sights. Ray catches up with his uncle, Max goes on a wild shopping spree and Kai goes in search of information. Tyson and Kenny try to see the Louvre but end up Beyblading Oliver, the French Champion. At first Oliver's Bit Beast, Unicolyon, is too much for Dragoon. But Tyson soon proves that even the French Champion has a thing or two to learn about Beyblading.","publishedDate":"27 Oct. 2002","rating":{"count":41,"star":7.4}},{"idx":35,"no":"S1, Ep35","title":"When in Rome... Beyblade!","image":"https://m.media-amazon.com/images/M/MV5BODUxMTY0ODIxOV5BMl5BanBnXkFtZTgwMDAxODY0NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BODUxMTY0ODIxOV5BMl5BanBnXkFtZTgwMDAxODY0NTE@.jpg","plot":"The Beyblade World Tag Team Championships are about to start in Rome as Barthez busily prepares his team for the big event. He's even invited a television news crew to document his efforts as a coach. Unfortunately, Barthez's personality slips through on occasion revealing the truth about how much a tyrant he really is. The Italian tournament begins and it's Barthez Battalion against White Tiger X. Ray starts for the Tigers going up against Claude. In mere seconds, Ray pulls off a victory that sets off alarm bells among the other competitors who think something is ...","publishedDate":"2 Nov. 2002","rating":{"count":51,"star":7.9}},{"idx":36,"no":"S1, Ep36","title":"Déjà Vu All Over Again","image":"https://m.media-amazon.com/images/M/MV5BMTYzNjgwMTAxM15BMl5BanBnXkFtZTgwNTYzNjczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTYzNjgwMTAxM15BMl5BanBnXkFtZTgwNTYzNjczMjE@.jpg","plot":"Unwilling to let his initial defeat to Enrique faze him, Tyson gets busy reworking his Beyblade. With Enrique having doubts about his own technique, and Oliver visiting him in Rome from France, the stage is set for a rematch. This time, Tyson pits the two heads of Enrique's Bit Beast Amphilyon against each other, and saves Enrique's life when Amphilyon turns on him.","publishedDate":"3 Nov. 2002","rating":{"count":43,"star":7.7}},{"idx":37,"no":"S1, Ep37","title":"A Knight to Remember!","image":"https://m.media-amazon.com/images/M/MV5BMTcwMzI0NzkxMV5BMl5BanBnXkFtZTgwMzQ0NjczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTcwMzI0NzkxMV5BMl5BanBnXkFtZTgwMzQ0NjczMjE@.jpg","plot":"Enrique and Oliver decide to take our heroes on a dirigible ride to visit Robert's castle. The reason - Tyson hopes to avenge an earlier loss to Robert that happened onboard the ship coming to Europe. Tyson's patience, however, is tested when they have to sit and wait for their host who is 'not to be disturbed.' So, Tyson decides to find Robert on his own and ends up getting lost in the medieval castles many eerie secret passages. Finally everyone converges in the room where Robert is playing chess against Johnny and it's here where Tyson throws down the gauntlet and ...","publishedDate":"9 Nov. 2002","rating":{"count":47,"star":8.2}},{"idx":38,"no":"S1, Ep38","title":"Olympia Challenge","image":"https://m.media-amazon.com/images/M/MV5BMTA4MTA1OTU4ODdeQTJeQWpwZ15BbWU4MDI1NDY3MzIx._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTA4MTA1OTU4ODdeQTJeQWpwZ15BbWU4MDI1NDY3MzIx.jpg","plot":"The Bladebreakers have made themselves at home at Robert's mansion, refusing to leave unless the Europeans agree to a final Beybattle. To teach his guests a lesson, Robert agrees to a match at his new stadium. But there's one condition: If the Bladebreakers lose, they have to forfeit their berth at the world Championship. Ray and Oliver battle fiercely and the first round ends in a tie. Johnny and Kai, bitter rivals, step to the bowl. But can Kai defeat the man who defeated him?","publishedDate":"9 Nov. 2002","rating":{"count":43,"star":7.5}},{"idx":39,"no":"S1, Ep39","title":"A Majestic Battle... A Majestic Victory?","image":"https://m.media-amazon.com/images/M/MV5BMjE4MTU4OTAyN15BMl5BanBnXkFtZTgwNjIwMTgzMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjE4MTU4OTAyN15BMl5BanBnXkFtZTgwNjIwMTgzMjE@.jpg","plot":"Match two gets underway at the Olympia Coliseum, and with a little unsolicited help by his teammates, Kai walks away with a win. The match is tied and the Majestics grudgingly admit to themselves that the only way they'll win the contest is to fight as a team, as the Bladebreakers do. Facing off against Tyson in the final match, will Robert be able to apply the fundamentals of teamwork? And will the Bladebreakers ever discover who sent them on their cross-Europe trip in the first place...?","publishedDate":"9 Nov. 2002","rating":{"count":44,"star":7.5}},{"idx":40,"no":"S1, Ep40","title":"Hot Battle in a Cold Town","image":"https://m.media-amazon.com/images/M/MV5BMTk4MDU0NzIwOF5BMl5BanBnXkFtZTgwMDY0NzczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTk4MDU0NzIwOF5BMl5BanBnXkFtZTgwMDY0NzczMjE@.jpg","plot":"The Bladebreakers arrive in Moscow on a brisk winter's day in anticipation of the World Beyblading final tournament. As they search for their hotel in the chilly city, they happen upon Boris, a strange man who claims to be the head of a rather eerie Beyblading training center. With the charm of an old world count, Boris invites them to lunch and them brings them to the training facility where they meet the next generation of Beybladers. It's here where Boris decides that one of his pupils should test his blading skills against Tyson.Our heroes are led into a rather ...","publishedDate":"12 Apr. 2003","rating":{"count":43,"star":7.3}},{"idx":41,"no":"S1, Ep41","title":"Out of the Past","image":"https://m.media-amazon.com/images/M/MV5BMjAwNTk2NTc1NF5BMl5BanBnXkFtZTgwNDYyNTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjAwNTk2NTc1NF5BMl5BanBnXkFtZTgwNDYyNTczMjE@.jpg","plot":"The Bladebreakers run into some old friends in Russia when The All-Starz and the White Tiger Clan show up for an exhibition match. The Beybattle between the two teams ends in a tie and they become fast friends, except for Emily and Mariah, who refuse to speak to each other. Meanwhile, Kai returns to the Abbey to find out why it fills him with foreboding. He discovers a cruel Beyblade facility in the Sub-basements, housing twisted science experiments and an army of children being molded into deadly Beybladers. Kai's lost memories come flooding back as he realizes he ...","publishedDate":"19 Apr. 2003","rating":{"count":43,"star":7.3}},{"idx":42,"no":"S1, Ep42","title":"Drawn to the Darkness","image":"https://m.media-amazon.com/images/M/MV5BMjA2NTMzNzc2OV5BMl5BanBnXkFtZTgwNDIyNTczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjA2NTMzNzc2OV5BMl5BanBnXkFtZTgwNDIyNTczMjE@.jpg","plot":"Kai is torn between escaping the Abbey, and exploring it further in an attempt to unlock forgotten memories from his childhood. The Bladebreakers track down their missing teammate to the Abbey, but are denied access by two of its wunderkind bladers. When Kai discovers the existence of Black Dranzer, the world's most powerful Beyblade, Boris offers it to him - but only if Kai quits the Bladebreakers forever and rejoins the Biovolt Corporation. Flooded with memories of using Black Dranzer as a child, and the lure of its dark, corrupting power leads Kai to a shocking ...","publishedDate":"20 Apr. 2003","rating":{"count":41,"star":7.4}},{"idx":43,"no":"S1, Ep43","title":"Live and Let Kai!","image":"https://m.media-amazon.com/images/M/MV5BMzkxNTc2OTQ2OF5BMl5BanBnXkFtZTgwOTMyNTE1NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMzkxNTc2OTQ2OF5BMl5BanBnXkFtZTgwOTMyNTE1NTE@.jpg","plot":"It's the finals of the World Beyblading Championships and the final battle pits Kai against the defending world Champion, Tyson. The fight is incredibly intense and what's even more amazing, it looks like the two combatants are so evenly matched, there might not be a winner. And that's exactly what happens! At the end of the battle, Kai and Tyson drop out at the exact same time! Now a dilemma arises. Mr. Dickenson has to make the final decision and he's leaning toward calling it a tie because he's afraid that if they continue the battle, someone could get hurt. But ...","publishedDate":"26 Apr. 2003","rating":{"count":42,"star":7.8}},{"idx":44,"no":"S1, Ep44","title":"Losing Kai","image":"https://m.media-amazon.com/images/M/MV5BMTg1NzgxNTI3NF5BMl5BanBnXkFtZTgwNjcyNTE1NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTg1NzgxNTI3NF5BMl5BanBnXkFtZTgwNjcyNTE1NTE@.jpg","plot":"Determined to avenge the All-Starz' devastating defeat, the White Tigers face Kai in the Tournament. One by one, they fall before the power of Black Dranzer and watch, horrified, as their Bit Beasts are absorbed into Kai's Beyblade. The Bladebreakers storm the abbey in a desperate attempt to free their teammate. Tyson stumbles into Biovolt's secret lab and learns the truth about Kai's past from a gloating Boris. Tyson refuses to give up on his friend until Kai hands over his old Beyblade and tells him to leave. Will the Bladebreakers survive the loss of their most ...","publishedDate":"27 Apr. 2003","rating":{"count":42,"star":7.7}},{"idx":45,"no":"S1, Ep45","title":"Breaking the Ice","image":"https://m.media-amazon.com/images/M/MV5BOTc3NDI2NzQ0NF5BMl5BanBnXkFtZTgwNTg4MzczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BOTc3NDI2NzQ0NF5BMl5BanBnXkFtZTgwNTg4MzczMjE@.jpg","plot":"Downtrodden and dejected, the Bladebreakers ask themselves over and over again: \"Why would Kai betray us?\" Soon enough, however, the boys get a chance to ask him themselves. Summoned by Kai to Beyblade on a frozen lake, the Bladebreakers must not only win to save their Bit Beasts, but must convince Kai that they will always be his teammates. Can they do it...?","publishedDate":"3 May 2003","rating":{"count":47,"star":8.1}},{"idx":46,"no":"S1, Ep46","title":"First Strike","image":"https://m.media-amazon.com/images/M/MV5BMTU3NDcyNTQ5MF5BMl5BanBnXkFtZTgwODY4MzczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTU3NDcyNTQ5MF5BMl5BanBnXkFtZTgwODY4MzczMjE@.jpg","plot":"Now that Kai is finally loyal to the 'Bladebreakers,' he returns the Black Dranzer to Boris, doing severe damage to the enemy headquarters in the process. Voltaire orders the operation to proceed, and Boris brings in the Demolition Boys to get the job done. It is revealed that BioVolt is creating a breed of powerful, savage, Bit-Beasts that are designed for War...and the plan is to use them to take over the entire World. The Demolition Boys attack the BBA bus, and Max bravely battles to save his friends. Unfortunately he loses his Bit-Beast, Draciel, in the process...","publishedDate":"4 May 2003","rating":{"count":44,"star":7.7}},{"idx":47,"no":"S1, Ep47","title":"A Lesson for Tyson","image":"https://m.media-amazon.com/images/M/MV5BMTU3NTcyNzU3OF5BMl5BanBnXkFtZTgwNzk4MzczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTU3NTcyNzU3OF5BMl5BanBnXkFtZTgwNzk4MzczMjE@.jpg","plot":"The Bladebreakers are stranded on the barren Russian Tundra after their run-in with the Demolition Boys when the Majestics mysteriously show up in their bus. After picking our heroes up, they stop at an abandoned palace where Robert challenges Tyson to battle. At first it seems strange that Robert would do this, but Tyson accepts and a battle ensues with Tyson losing two straight. He becomes infuriated! Robert then tells Tyson that he must harness his power back into his blade, which totally confuses Tyson. Finally, Kenny tells Tyson to remember a battle he had ...","publishedDate":"10 May 2003","rating":{"count":44,"star":7.4}},{"idx":48,"no":"S1, Ep48","title":"Victory in Defeat","image":"https://m.media-amazon.com/images/M/MV5BMTk1NDE3MjMwMl5BMl5BanBnXkFtZTgwMzA5MzczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTk1NDE3MjMwMl5BMl5BanBnXkFtZTgwMzA5MzczMjE@.jpg","plot":"The World Championship Finals are finally here and Kai insists on Beybattling first, hoping his knowledge of the Demolition Boys will give him an advantage over Spencer. But in the first set, Seaborg, Spencer's whale Bit Beast, uses the water in the Black Sea Bowl to create a tsunami, which overwhelms Dranzer. Kai is desperate for victory and Voltaire makes him a tempting offer: the power of Black Dranzer in exchange for betraying his friends and stealing their Bit Beasts. Kai stays true to his heart and resists his grandfather.","publishedDate":"11 May 2003","rating":{"count":46,"star":7.5}},{"idx":49,"no":"S1, Ep49","title":"A Wicked Wind Blows","image":"https://m.media-amazon.com/images/M/MV5BMTEwMDc0NTYzNDNeQTJeQWpwZ15BbWU4MDk3ODM3MzIx._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTEwMDc0NTYzNDNeQTJeQWpwZ15BbWU4MDk3ODM3MzIx.jpg","plot":"After Kai's first round loss to the Demolition Boys in the World Beyblade Finals, it's Ray's turn to take on Bryan in a best-of-three match. Ray learns the hard way that Bryan is a nasty competitor who'll do anything to win - including putting Ray himself through the ringer. When it's discovered that Bryan's attack includes the ability to manipulate air itself into a weapon, Ray faces a troubling realization. To negate Bryan's fury, he must put his own well being at risk. But Ray's Bit-Beast Driger has other ideas, and it offers up selfless act of its own.","publishedDate":"17 May 2003","rating":{"count":49,"star":8.1}},{"idx":50,"no":"S1, Ep50","title":"New and Cyber-Improved","image":"https://m.media-amazon.com/images/M/MV5BMjI3ODMzNDE0N15BMl5BanBnXkFtZTgwNDk4MzczMjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjI3ODMzNDE0N15BMl5BanBnXkFtZTgwNDk4MzczMjE@.jpg","plot":"After a devastating match puts Ray in the hospital, Tyson trains his heart out to prepare for his battle against Tala, leader of the Demolition Boys. What Tyson doesn't know is that Tala has become one of Boris' weird experiments, uploaded with dangerous Biovolt technology. Meanwhile, Max's parents work together to come up with an improved Beyblade that can combat the existing threat of the Demolition Boys' prowess. Can it even come close to competing against...Cyber-Tala?","publishedDate":"18 May 2003","rating":{"count":47,"star":8}},{"idx":51,"no":"S1, Ep51","title":"Final Showdown!","image":"https://m.media-amazon.com/images/M/MV5BMTc1NTY0MzU1MV5BMl5BanBnXkFtZTgwMTcwNTE1NTE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTc1NTY0MzU1MV5BMl5BanBnXkFtZTgwMTcwNTE1NTE@.jpg","plot":"It's the finals of the World Beyblading Championships and Tyson is about to defend his title against Zeo who fights with the extra power of the Bit Beasts he's captured. But something strange is revealed at the start of the battle - turns out Zeo isn't human after all! In fact, he's a robot Zagart created to replace his real son who died in a tragic accident. And according to the evil doctor, if Zeo can capture Tyson's Dragoon, then by using all the Sacred Bit Beasts powers, Zeo will be turned into a real boy! The battle rages on and Zeo seems to be the aggressor. ...","publishedDate":"24 May 2003","rating":{"count":57,"star":8.6}}]}],"href":"https://m.media-amazon.com/images/M/MV5BNGIzNDViMjAtYzYwZS00MzJlLTkyZTUtYzZlOWFkYmEyMTdlXkEyXkFqcGdeQXVyNjk1Njg5NTA@._V1_.jpg","aired":"6/7/2002","rating_star":6.8,"rating_count":6442,"staff":"","duration":""}}