{"warezcdn":{"imdb":"tt0182646","name":"Capitão Harlock","href":"https://embed.warezcdn.net/serie/tt0182646","title":"Uchû kaizoku kyaputen Hârokku"},"imdb":{"id":"tt0182646","review_api_path":"/reviews/tt0182646","imdb":"https://www.imdb.com/title/tt0182646","contentType":"TVSeries","productionStatus":"Released","title":"Uchû kaizoku kyaputen Hârokku","image":"https://m.media-amazon.com/images/M/MV5BMDYzZjlmM2UtNTIwOC00NTJlLWEzYzMtMjg1ZTg3MTY3NDgxXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg","images":["https://m.media-amazon.com/images/M/MV5BZmZhNzM1MmUtNDg4NS00NGI0LWI5YzYtNDBiM2IzYjljMjYxXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BYjUwNzdjOWMtNzMzMC00MjgxLThlZWQtYWIzMjBlZTA1YjY3XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BZWI2ZDBhY2MtMmIzZi00OGQ2LWI4ODYtNzgxM2VhY2M3NTgyXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMmM3ZDhjMDAtOTk4Ny00MGIyLTg4NGYtZTZiMzYzYTdhNDMzXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BYzNiM2EzOTgtNjMyMy00ZTI5LTlhOWEtYWVlNWU3MjhhM2FkXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMjE4NjUzNzIxOF5BMl5BanBnXkFtZTgwNDg2MDU1MjE@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTcyNTg0OTIyMF5BMl5BanBnXkFtZTgwODc2MDU1MjE@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTc4MTM4NjQzN15BMl5BanBnXkFtZTgwMTY2MDU1MjE@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTk2NTg2NTE3OV5BMl5BanBnXkFtZTgwNjY2MDU1MjE@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTgzNjcxODU0MV5BMl5BanBnXkFtZTgwOTQ2MDU1MjE@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMjMxMTM2OTg2M15BMl5BanBnXkFtZTgwNzI2MDU1MjE@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTkxOTY1Njk0OF5BMl5BanBnXkFtZTgwMzI2MDU1MjE@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTUwNzgzNjE4MV5BMl5BanBnXkFtZTgwMTI2MDU1MjE@._V1_.jpg"],"plot":"In 2977, mankind has space colonies, machines do all the work and everyone just wants to have fun. When deadly plant-based aliens that look like women attack the Earth in order to colonize it, only one rogue captain can stop them.","rating":{"count":1240,"star":7.8},"award":{"wins":0,"nominations":0},"genre":"Animation,Action,Adventure","year":1979,"runtime":null,"releaseDeatiled":{"day":16,"month":11,"year":1979,"releaseLocation":{"country":"United States","cca2":"US"},"originLocations":[{"country":"Japan","cca2":"JP"}]},"spokenLanguages":[{"language":"Japanese","id":"ja"}],"filmingLocations":[],"actors":["Makio Inoue","Akira Kamiya","Noriko Ohara"],"directors":[],"top_credits":[{"name":"Stars","value":["Makio Inoue","Akira Kamiya","Noriko Ohara"]}],"seasons":[{"id":"1","name":"Season 1","episodes":[{"idx":1,"no":"S1, Ep1","title":"The Jolly Roger of Space","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"\"Don't worry.\"2977 A.D. Mankind has developed the technology to head into space. They've created robots to cultivate foodstuffs on other planets and live in an age of unprecedented gluttony. Mankind receives all its food from the government and is kept in check by the government's use of hypnotic signals emitted from the television. So even high-ranking government officials have tossed their duties to the road and live a life of horse-racing and other indulgences.Captain Harlock, a space pirate known throughout Earth, is the only man who sees the impending crisis ...","publishedDate":"16 Nov. 1979","rating":{"count":43,"star":7}},{"idx":2,"no":"S1, Ep2","title":"A Message from the Unknown","image":"https://m.media-amazon.com/images/M/MV5BZmZhNzM1MmUtNDg4NS00NGI0LWI5YzYtNDBiM2IzYjljMjYxXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BZmZhNzM1MmUtNDg4NS00NGI0LWI5YzYtNDBiM2IzYjljMjYxXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"\"You're a young girl with the heart of an angel. That's why you should befriend the flowers and birds and live!\"A transport ship unit is attacked by an unidentified flying object as it exits Planet No.7. Believing Harlock is behind this attack, they decide to use Mayu, a girl entrusted to Harlock by his dear friend, to lure him out. But we Harlock and crew experience the first aggressive attack by a mysterious enemy known as the Mazone. Realizing they are under attack. Dr. Daiba and his son, Tadashi, go to the Prime Minister's residence to plead with the Prime Minster...","publishedDate":"21 Mar. 1978","rating":{"count":32,"star":6.5}},{"idx":3,"no":"S1, Ep3","title":"A Lady Who Burns Like Paper","image":"https://m.media-amazon.com/images/M/MV5BZWI2ZDBhY2MtMmIzZi00OGQ2LWI4ODYtNzgxM2VhY2M3NTgyXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BZWI2ZDBhY2MtMmIzZi00OGQ2LWI4ODYtNzgxM2VhY2M3NTgyXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"\"If you're a man, you'll do what you have to before you grieve.\"The town is sent into panic by the sphere that landed. Then, a man, who inspects the orb along with Dr. Daiba and his son Tadashi, named Professor Kusko suspects that the writing on the \"Pennant\" is laying claim to Earth. However, the Prime Minister continues to ignore their warnings. Then, the leader of the invading Mazone orders a subordinate to kill anyone who realizes the meaning of the pennant. Dr. Daiba is the first to die. Tadashi, rescued by Harlock, vows to make the Mazone, who look like women ...","publishedDate":"28 Mar. 1978","rating":{"count":31,"star":7.1}},{"idx":4,"no":"S1, Ep4","title":"Under the Flag of Freedom","image":"https://m.media-amazon.com/images/M/MV5BYzNiM2EzOTgtNjMyMy00ZTI5LTlhOWEtYWVlNWU3MjhhM2FkXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BYzNiM2EzOTgtNjMyMy00ZTI5LTlhOWEtYWVlNWU3MjhhM2FkXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"\"I fight for no one. I just fight for something within my heart.\"After being invited to be a pirate by Harlock, Tadashi exits the Arcadia. At the same time, Professor Kusko deciphers the characters written on the pennant and informs the people in the Prime Minister's cabinet that the Mazone plan to make Earth their second homeland. However, the government men do not show even the slightest bit of interest in the news. Downtrodden and in a state of despair, Professor Kusko is assassinated by a Mazone. The government refused to step in, believing he's associated with ...","publishedDate":"11 Apr. 1978","rating":{"count":29,"star":7.3}},{"idx":5,"no":"S1, Ep5","title":"To the Shores of Distant Stars","image":"https://m.media-amazon.com/images/M/MV5BYjUwNzdjOWMtNzMzMC00MjgxLThlZWQtYWIzMjBlZTA1YjY3XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BYjUwNzdjOWMtNzMzMC00MjgxLThlZWQtYWIzMjBlZTA1YjY3XkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"\"He can live, seeing the same cosmos that I do. He'll come to see them sparkling one day... Those stars in the darkness.\"Harlock tells Tadashi, upon joining his crew, to \"just loiter around and enjoy it,\" leaving Tadashi confused. Also seeing all the crewmen merely doing as they fit and slacking off goes completely against the image he had of the Arcadia. Being stuck in such a confined space causes some mental effects on Tadashi. In that state, he sees visions of his mother who died on Neptune's satellite, Triton. It was then the Mazone come attacking. They capture a ...","publishedDate":"18 Apr. 1978","rating":{"count":22,"star":7.2}},{"idx":6,"no":"S1, Ep6","title":"The Phantom Mazone","image":"https://m.media-amazon.com/images/M/MV5BMjMyMjc0NDc5MF5BMl5BanBnXkFtZTgwODc1MDU1MjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjMyMjc0NDc5MF5BMl5BanBnXkFtZTgwODc1MDU1MjE@.jpg","plot":"\"Lafresia... A phantom enemy, but a fearsome opponent.\"The Mazone soldier mentioned the name Queen Lafresia as she blew herself up. Sensing the need to gather more information and wanting to test Tadashi's skills, Harlock sends the crew out to gather pieces of the wreckage from the attacked Mazone battleship. From the analysis of the wreckage, they see the Mazone may have had interactions with ancient Earth. Taking a moment's respite, Harlock sends a letter to Mayu, who is under federal governmental care. He also sent a threat demanding they bring her response to the ...","publishedDate":"25 Apr. 1978","rating":{"count":25,"star":5.2}},{"idx":7,"no":"S1, Ep7","title":"The Pyramid on the Sea Floor","image":"https://m.media-amazon.com/images/M/MV5BMmM3ZDhjMDAtOTk4Ny00MGIyLTg4NGYtZTZiMzYzYTdhNDMzXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMmM3ZDhjMDAtOTk4Ny00MGIyLTg4NGYtZTZiMzYzYTdhNDMzXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"\"Even if it is unforgivable enemy of mine, I pay the utmost respect to those who died in the line of duty.\"Upon seeing an odd looking formation from space, Harlock's crew heads to the Bermuda area. Upon investigating a pyramid built by the Mazone on the ocean floor, they learn that the Mazone are actually a form of plant life. Learning that the Mazone are hidden across the globe and that the government has not heeded their warnings, the crew sets off on a search and destroy mission. Learning that there are the Mazone near Mayu as well, they set out to kill them.","publishedDate":"2 May 1978","rating":{"count":23,"star":4.9}},{"idx":8,"no":"S1, Ep8","title":"The Queen's Space Fleet","image":"https://m.media-amazon.com/images/M/MV5BOTkxMTcwNzUyMl5BMl5BanBnXkFtZTgwNTU1MDU1MjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BOTkxMTcwNzUyMl5BMl5BanBnXkFtZTgwNTU1MDU1MjE@.jpg","plot":"\"Then please tell the Queen this- I, Captain Harlock, intend to proceed to the very heart of the Mazone!\"There are signals being emitted from the pennant and the pyramid. These are homing signals to guide the Mazone to Earth. Sensing the direct confrontation and feeling his duty to protect Mayu, the daughter of his best friend, Harlock heads back to Earth. As they then set off for outer space, a high-ranking official is captured and gives a warning. When Harlock lets her go, Tadashi sets out after her in a fit of vengeful rage. But when his ship is hit, he begins to ...","publishedDate":"9 May 1978","rating":{"count":22,"star":6.1}},{"idx":9,"no":"S1, Ep9","title":"The Fearsome Plant Lifeform","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"\"Keep shooting until the very end! Even if you're all alone, kill as many Mazone as you can!\"Dr. Zero analyzes the hair from the captured Mazone and sees their make-up is identical to sap found in plant life surrounding ancient ruins. Feeling the need to investigate this association, Harlock sends out Tadashi and First mate Yattaran to retrieve the Flame Vessel. Then, they did find a memory device hidden within the Flame Vessel as expected. But, as it requires a massive amount of energy to complete the analysis, they put it on hold and head to South America to ...","publishedDate":"16 May 1978","rating":{"count":23,"star":7}},{"idx":10,"no":"S1, Ep10","title":"Approaching the Mystery Planet","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"\"This is a lawless, pirate-style battle technique.\"Believing that all the jungles of Earth are inhabited by the Mazone, Harlock decides to return to the Pirate Island again. There, after a subordinate of hers was killed in South America, Alergias wages an attack on Harlock. There, when seeing his opponent, Lola's face, Tadashi hesitates for a moment on firing a missile. He is rescued by the Arcadia which wins with a ram attack, but Tadashi remains confused. Harlock has the soil attached to bits of the Mazone mothership and seeing that it came from Venus, they head ...","publishedDate":"30 May 1978","rating":{"count":22,"star":6.4}},{"idx":11,"no":"S1, Ep11","title":"When Lola Shines Golden","image":"https://m.media-amazon.com/images/M/MV5BYzVhM2FkNWItMGMwZi00Zjg2LTkyZjAtOTE1NDMwZmY1YzY4XkEyXkFqcGdeQXVyMTgwMzU4OQ@@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BYzVhM2FkNWItMGMwZi00Zjg2LTkyZjAtOTE1NDMwZmY1YzY4XkEyXkFqcGdeQXVyMTgwMzU4OQ@@.jpg","plot":"\"He cannot take his eyes off reality. Daiba must learn that the beautiful one who tempts him is his enemy.\"The Arcadia successfully makes its way to Venus. Along the way, they capture a Mazone pilot from a wrecked ship, Lola. Instead of detonating herself like the others, she just gives an ominous smile. Harlock orders Tadashi to keep an eye on her. Taking one glance at her, Tadashi becomes bloodlust and wants to kill her. However, shy hypnotizes Tadashi with visions of his late mother. Asides for foolishly divulging information on the Arcadia to her, he lets her ...","publishedDate":"6 Jun. 1978","rating":{"count":23,"star":6.8}},{"idx":12,"no":"S1, Ep12","title":"Mother, Be Eternal","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"\"Man have things they must over come with external help, just by themselves.\"Tadashi is upset at himself for talking about the Arcadia to Lola. Then he begins practicing like mad so he can shoot in time next battle. Examining Venus, they spot formations on a fossilized continent that look like Nazca drawings. They follow it onwards to the base and find drawings about Earth from over 180,000,000 years ago. Then, Alergias's forces come in a surprised attack. Tadashi sets off as he vows to kill Lola, and both sides begin a violent battle. There, he overcomes the visions ...","publishedDate":"13 Jun. 1978","rating":{"count":22,"star":6.2}},{"idx":13,"no":"S1, Ep13","title":"Witch Castle in the Sea of Death","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"\"This is the pirate way.\"The Arcadia heads back to Earth to investigate a third signal being emitted from the Sargasso Sea. There, the witch Aman, who was waiting for the Arcadia, wages an attack using a 1945 Imperial Japanese naval ship. Harlock, curious as to how this phenomenon occurred, sets off to investigate at the bottom of the sea. But, she was setting a trap for them, and inside her sphere, time passes at the rate of one Earth year per day. The entire crew soon falls asleep. At this rate, when they wake up, Earth will already have been invaded. However, the ...","publishedDate":"20 Jun. 1978","rating":{"count":20,"star":6.3}},{"idx":14,"no":"S1, Ep14","title":"The Sphinx's Gravestone","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"\"I can hear it coming from over there. Mayu is over there!\"Commander Kiruta takes Mayu with him. Desperate to find her, Harlock receives a message from Commander Kiruta. \"Fly to Cairo, Egypt.\", \"Board a Cessna.\", \"The Arcadia is to wait in the Valley of the Dead.\" Harlock finally makes it to the Sphinx. We learn that Commander Kiruta's family had to make deadly sacrifices for their father's discovery. That discovery was an ancient super-weapon left behind by the Mazone. Commander Kiruta thinks that he will kill the Arcadia and Harlock with that weapon, but the Arcadia...","publishedDate":"27 Jun. 1978","rating":{"count":21,"star":4}},{"idx":15,"no":"S1, Ep15","title":"Unrequited Love! The North Pole Aurora","image":"https://m.media-amazon.com/images/M/MV5BMTk2NTg2NTE3OV5BMl5BanBnXkFtZTgwNjY2MDU1MjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTk2NTg2NTE3OV5BMl5BanBnXkFtZTgwNjY2MDU1MjE@.jpg","plot":"\"I've got forty crewman with me, along with the invincible Arcadia!\"The Arcadia is at the north pole after spotting an aurora that closely resembles a runway. While landing, Harlock and Miime spots a person. Then, they encounter a Mazone soldier named Aurora, who has been waiting for over ten years to kill Harlock. As the Arcadia is ensnared in a trap and wedged into a crevasse, Aurora confesses her love for Harlock. This is due to the delusions she experienced after thinking of nothing but Harlock for over ten years. But, after Miime rescues Harlock from harm's way, ...","publishedDate":"4 Jul. 1978","rating":{"count":20,"star":7.2}},{"idx":16,"no":"S1, Ep16","title":"Kei: A Song of Farewell","image":"https://m.media-amazon.com/images/M/MV5BMTQ4ODM3ODk5NV5BMl5BanBnXkFtZTgwNjQ0MDU1MjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTQ4ODM3ODk5NV5BMl5BanBnXkFtZTgwNjQ0MDU1MjE@.jpg","plot":"\"This is Kei's problem. She has to take care of it.\"The operator, Kei Yuki, goes to visit her parents' grave. There, her father's ex-pupil, Kazuya, shows up. They had attempted to make a space colony not out of machines, but with nature exactly akin to Earth's. However, the experiment failed and Kazuya, the lone survivor, returned to blame her father who had lost his life there. But now he regrets this and wants to continue the research. However, Kei, who left the Arcadia to help him, is betrayed by Kazuya. It turns out he is a spy for the Mazone. Upon learning the ...","publishedDate":"11 Jul. 1978","rating":{"count":21,"star":7.3}},{"idx":17,"no":"S1, Ep17","title":"The Skeletal Hero","image":"https://m.media-amazon.com/images/M/MV5BMTc4MTM4NjQzN15BMl5BanBnXkFtZTgwMTY2MDU1MjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTc4MTM4NjQzN15BMl5BanBnXkFtZTgwMTY2MDU1MjE@.jpg","plot":"\"We swore that we'd die together on this ship. One man's pain is all of our pain.\"Upon finding a message in a bottle floating in space that contains an SOS message from Captain Yamanaka of the Braves ship, the Arcadia sets off for the Horsehead Nebula. Chief engineer Maji, who once served Captain Yamanaka, and Harlock, both acknowledge that Yamanaka is a fine warrior. Though Maji respected him, because Yamanaka saw that Maji's wife was a Mazone and shot her, they got into a fight and Maji left him. Even so, he still respects his former captain, and he heads for the ...","publishedDate":"18 Jul. 1978","rating":{"count":22,"star":6.8}},{"idx":18,"no":"S1, Ep18","title":"The Evil Shadow Soldiers","image":"https://m.media-amazon.com/images/M/MV5BMTkxOTY1Njk0OF5BMl5BanBnXkFtZTgwMzI2MDU1MjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTkxOTY1Njk0OF5BMl5BanBnXkFtZTgwMzI2MDU1MjE@.jpg","plot":"\"That sort of your weak sympathy is no help to the Chief engineer.\"A group of Mazone suddenly appear in the ship. They carelessly assume they'll just be holographs, but soon real Mazone appear and they begin fighting. During the battle, the Chief engineer realizes that one of the enemies is the daughter him and his wife had, Midori, who was taken away by the Mazone. The Chief engineer coolly tells the Mazone commander Patras that the only reason he boarded the Arcadia was to get his daughter back. He retorts, \"The Mazone have no need for fathers.\" This sends Maji into...","publishedDate":"25 Jul. 1978","rating":{"count":22,"star":6.5}},{"idx":19,"no":"S1, Ep19","title":"Queen Lafresia's Trap","image":"https://m.media-amazon.com/images/M/MV5BMjI5MjExNjI1MV5BMl5BanBnXkFtZTgwNTQ0MDU1MjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjI5MjExNjI1MV5BMl5BanBnXkFtZTgwNTQ0MDU1MjE@.jpg","plot":"\"Falling into the trap will be fun, as well. Will we become skeletons together?\"There are supposed to be forty-two crewman aboard the Arcadia. Searching their true colors, they try to read the minds of all at the Horsehead Nebula. After reading them all, they decide to take the next measures. Harlock and his crew finally realize that the light Yamanaka thought to be the Mazone base is actually a group of young stars. But, before they have time to sulk, they're attacked by a Mazone comet. The Arcadia escaped to Deathshadow Island to escape from this attack. Queen ...","publishedDate":"1 Aug. 1978","rating":{"count":21,"star":7.3}},{"idx":20,"no":"S1, Ep20","title":"The Dead Planet Jura","image":"https://m.media-amazon.com/images/M/MV5BMTUwNzgzNjE4MV5BMl5BanBnXkFtZTgwMTI2MDU1MjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTUwNzgzNjE4MV5BMl5BanBnXkFtZTgwMTI2MDU1MjE@.jpg","plot":"\"So, being an alcoholic is useful for once!\"Miime's old planet is named Jura, and it was once devastated by a nuclear attack. Making one of her occasional visits to her hometown, Miime and Harlock are once against ensnared in a Mazone trap. Receiving a mysterious, shape-changing flower, the entire crew passes out. Before they have time to recover, a Mazone battle unit comes attacking and they're suddenly in a bind. Furious over this cowardly way of attacking, Miime and Harlock head to where they believe their base to be. There, she meets her old friend Fuure, who ...","publishedDate":"8 Aug. 1978","rating":{"count":19,"star":5.7}},{"idx":21,"no":"S1, Ep21","title":"Gohrum! The Tragic Soldier","image":"https://m.media-amazon.com/images/M/MV5BMTQ2NTIxNTAzOF5BMl5BanBnXkFtZTgwNDg0MDU1MjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTQ2NTIxNTAzOF5BMl5BanBnXkFtZTgwNDg0MDU1MjE@.jpg","plot":"\"It's out of respect for a veteran. This is how I do things. I make no distinction between friend nor foe.\"An asteroid belt hits the Arcadia. Mazone soldiers who were hiding in there come invade the ship. However, they don't wish to destroy the Arcadia. Rather, they are men from another planet that was taken over by the Mazone. These men underwent military training by the Mazone. Discarding the fact that he took him hostage, Harlock shows the warrior Zol the utmost respect. Exchanging the word \"Gohrum\" to one another, words that they reserve for true heroes on his ...","publishedDate":"15 Aug. 1978","rating":{"count":19,"star":6.3}},{"idx":22,"no":"S1, Ep22","title":"Space Graveyard Deathshadow","image":"https://m.media-amazon.com/images/M/MV5BMTQzMDQwMDg0MV5BMl5BanBnXkFtZTgwMzY0MDU1MjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTQzMDQwMDg0MV5BMl5BanBnXkFtZTgwMzY0MDU1MjE@.jpg","plot":"\"The beauty of the ocean of space is without limit. But, on occasion, it can be merciless.\"Upon returning to Deathshadow Island with the memory device left behind by Zol, Harlock and his crew learn something huge about Queen Lafresia's flagship. They infer that they sent another pennant onto Mars and they head there at once. However, not knowing this place is the space graveyard Deathshadow, they fall into another Mazone trap. Due to the force of the planet, they cannot move. There is nothing they can do but wait for all their energy to be sapped. As the Mazone move ...","publishedDate":"22 Aug. 1978","rating":{"count":19,"star":6.6}},{"idx":23,"no":"S1, Ep23","title":"Yattaran: Song of the Model Lover","image":"https://m.media-amazon.com/images/M/MV5BMjE4NjUzNzIxOF5BMl5BanBnXkFtZTgwNDg2MDU1MjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjE4NjUzNzIxOF5BMl5BanBnXkFtZTgwNDg2MDU1MjE@.jpg","plot":"\"A little leak will sink a great ship.\"Upon victory, Harlock orders First mate Yattaran to secure the hostages. But, Yattaran ends up being the one who is captured! Dr. Zero, who has known Yattaran since elementary school, proceeds to tell the crew about his rarely seen genius and ability to analyze the structure of the Arcadia. The Mazone, Elza, sent on an intelligence gather mission, decides to use Yattaran's love of models to get information on the structure of the Arcadia by challenging him to a model building contest. He is to build a scale-model of the Arcadia. ...","publishedDate":"29 Aug. 1978","rating":{"count":19,"star":5.8}},{"idx":24,"no":"S1, Ep24","title":"The Shooting Star of Virgin Love","image":"https://m.media-amazon.com/images/M/MV5BMjMxMTM2OTg2M15BMl5BanBnXkFtZTgwNzI2MDU1MjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMjMxMTM2OTg2M15BMl5BanBnXkFtZTgwNzI2MDU1MjE@.jpg","plot":"\"Zol issued the attack order! Your father!\"A surprising couple, Zorba, the son of the warrior Zol, and a Mazone medic named Lucia, escaped from the Mazone fleet. There are members in the crew who doubt Lucia and think she may be a spy, but when they see that the Mazone are truly trying to recovery the two, they begin to trust her. Then the Mazone launch their general attack. Zorba is upset over his mother's execution, but Harlock yells at him and he become brave again. He decides to use himself as a decoy to protect the Arcadia. The two of them are hit by the Mazone ...","publishedDate":"5 Sep. 1978","rating":{"count":19,"star":6.6}},{"idx":25,"no":"S1, Ep25","title":"Doctor Zero and Mi","image":"https://m.media-amazon.com/images/M/MV5BMTUwNjQ2NjI3OV5BMl5BanBnXkFtZTgwNjY0MDU1MjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTUwNjQ2NjI3OV5BMl5BanBnXkFtZTgwNjY0MDU1MjE@.jpg","plot":"\"This is a gamble. But it's a gamble we will win.\"Doctor Zero becomes extremely resentful over Zorba and Lucia's murder. So, he sets off to do battle in the midst of a magnetic storm and leaves his pet cat to the ship's cook, Masu-san. He leaves alone in a fighter. Then, with the cat who snuck into the cockpit when he wasn't looking, he prepares for death in a violent dogfight. Shortly after, Tadashi informs Harlock that the Mazone mothership he shot down was actually a passenger ship. The Mazone are not just plotting an invasion but are on a mass exodus in search of ...","publishedDate":"12 Sep. 1978","rating":{"count":19,"star":6.4}},{"idx":26,"no":"S1, Ep26","title":"The Long Journey from Afar","image":"https://m.media-amazon.com/images/M/MV5BMTQ3MjczNjgzMl5BMl5BanBnXkFtZTgwNDg1MDU1MjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTQ3MjczNjgzMl5BMl5BanBnXkFtZTgwNDg1MDU1MjE@.jpg","plot":"\"You have awakened the lion that sleeps within me.\"Due to Harlock's unrelenting resistance, there is a growing resentment between the Mazone military and its civilians. There is a faction in the military saying the civilians are just a nuisance and should be cut off. But the queen has resigned herself to complete the exodus of all her peoples to Earth. When Tesius breaks away from the caravan with a group of Mazone, the queen sends her subordinate Cleo to deliver her punishment. She lets Tesius commit suicide rather than kill her...","publishedDate":"26 Sep. 1978","rating":{"count":19,"star":6.8}},{"idx":27,"no":"S1, Ep27","title":"The Will of the Arcadia","image":"https://m.media-amazon.com/images/M/MV5BMTcyNTg0OTIyMF5BMl5BanBnXkFtZTgwODc2MDU1MjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTcyNTg0OTIyMF5BMl5BanBnXkFtZTgwODc2MDU1MjE@.jpg","plot":"\"Queen Lafresia is a Mazone with a heart.\"Having a hunch as to the reason why Harlock so staunchly opposes them, Queen Lafresia sends someone on a mission to Earth to find out why. They threaten Commander Kiruta and find out about Mayu. Finally believing the warnings about the Mazone that Harlock spoke of, Kiruta pleads to the Prime Minister to defend the Earth. But the Prime Minister does not deem the Mazone a threat. Kiruta finally understands Harlock's impatience with him. Then, after appearing in front of Harlock via hologram, Queen Lafresia is called a coward by ...","publishedDate":"3 Oct. 1978","rating":{"count":19,"star":6.5}},{"idx":28,"no":"S1, Ep28","title":"The Ulysses Nebula","image":"https://m.media-amazon.com/images/M/MV5BMTgzNjcxODU0MV5BMl5BanBnXkFtZTgwOTQ2MDU1MjE@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BMTgzNjcxODU0MV5BMl5BanBnXkFtZTgwOTQ2MDU1MjE@.jpg","plot":"\"The human race started with two.\"In order to rescue Mayu, Harlock allows the will of the ship to choose its own course. It then sets course for the Human Planet within the seven planets of the Ulysses Nebula. Dr. Ain and thirty humans escaped to there. It's almost like a tropical paradise. Harlock and the crew are there to take respite but when they hear that many UFO's have been spotted overhead recently, they go off to investigate. But, the Mazone have reached there as well and Harlock and the crew are attacked. Miyu, who pretended to be one of them but is really a...","publishedDate":"10 Oct. 1978","rating":{"count":20,"star":6}},{"idx":29,"no":"S1, Ep29","title":"Life-and-Death Struggle on the Rainbow Planet","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"\"A man learns little by little while in battle.\"The Mazone come attacking the Arcadia which has had too much free time lately. Tadashi, thinking he may find clues to Mayu's whereabouts, gives chase in a fighter and is wrecked on the Rainbow Planet. A Mazone civilian saves him. Believing their story that they escaped in search of freedom, Tadashi befriends the girl, Kirika. Though he's hated the Mazone up until now, Tadashi gives a grass whistle to Kirika and they quickly grow close. But then he sees that it was all a trap to get close to him. He's saved by Harlock in ...","publishedDate":"17 Oct. 1978","rating":{"count":19,"star":5.3}},{"idx":30,"no":"S1, Ep30","title":"My Friend, My Youth","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"\"If you can imagine, I drank whiskey that time...\"While the Arcadia is being repaired at the dock of a Pirate Island, Tadashi and Tori-san come back with a pair of glasses. Harlock says they belonged to the man who built the Arcadia. Harlock met that man, Tochiro Oyama, in a bar in the Ulysses Nebula. The two of them got along great, but due to the influence of a mysterious woman named Emeralda, the two of them got a bad reputation and were sent off to the mines on Bad. The truth is Emeralda needed the help of the two men to rescue her younger brother Jimmy who was ...","publishedDate":"24 Oct. 1978","rating":{"count":19,"star":5.9}},{"idx":31,"no":"S1, Ep31","title":"The Arcadia's Secret History","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"\"We're all as one, together on the Arcadia.\"The Arcadia is rapidly being repaired on a Pirate Island while Lafresia continues her bloodthirsty hunt for it. While this is happening, Harlock tells Tadashi the secret story behind the Arcadia's origins. As fate would have it, Commander Kiruta captured and enlisted the services of a brilliant scientist named Tochiro to build a battleship to help capture Captain Harlock. However, Harlock saves Tochiro after he is in a pinch on Heavy Meldar, a planet which was being cultivated and they escape on the newly built Arcadia. ...","publishedDate":"31 Oct. 1978","rating":{"count":18,"star":5.8}},{"idx":32,"no":"S1, Ep32","title":"Call of the Star Flute","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"\"Earth is meaningless to me without Mayu.\"The Mazone plot to use Mayu to lure Harlock and the Arcadia to the Wind Planet and then attack with a powerful mine. As the Arcadia is making up its mind as to where they will go, they intercept a communication saying that the Mazone have sent advance troops to Earth. The crew asks Harlock if they can return to Earth. As Harlock is pondering what to do, the sound of Mayu's ocarina ominously comes to them from the Wind Planet, so they set their course to there. Thanks to the will of Tochiro, which remains on board the Arcadia, ...","publishedDate":"7 Nov. 1978","rating":{"count":17,"star":6.6}},{"idx":33,"no":"S1, Ep33","title":"The Lone Man's Charge","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"\"When a man is searching for his final resting ground, don't go running your mouth.\"Commander Kiruta learns of the existence of the Mazone and persistently tries to inform the Prime Minister of the impending doom. Nevertheless, the Prime Minister ignores his pleas and begins to think of Kiruta as a dangerous person who may pull off a coup d'?tat. Then, Kiruta encounters Commander Otawara in a drinking establishment once again. He was the former commander who was accused of being a murderer after killing his wife upon finding out she was a Mazone. Learning of the ...","publishedDate":"14 Nov. 1978","rating":{"count":17,"star":7.1}},{"idx":34,"no":"S1, Ep34","title":"The Galactic Lullaby","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"\"It's time for our showdown, Lafresia.\"The Arcadia is trapped due to an artificial gravity device. However, they escape and protect Mayu from the Mazone base. However, she is suffering from post-traumatic stress disorder after being held captive for so long, and if she stops playing her ocarina, she goes into terrible bouts of terror. Worried that she'll die at this rate, Harlock turns to the main central computer which harbors her father, Tochiro's soul, in order to save her. Finally, after the computer plays her a lullaby, she is able to go to sleep.","publishedDate":"21 Nov. 1978","rating":{"count":19,"star":4.2}},{"idx":35,"no":"S1, Ep35","title":"The Beautiful Mystery Woman","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"\"Mayu, come here. The Earth is beautiful.\"After rescuing Mayu, all that remains is the final showdown with Lafresia. Harlock decides that she cannot remain on the ship during the battle and to return her to Earth. At the same time, Commander Kiruta, after pleading dozens of times regarding the impending Mazone invasion to the Prime Minister, is accused of treason due to a plot by his secretary, Shizuka Namino. Kiruta is slated to be executed the following morning and there is nothing more he can do. However, Shizuka saves him from this fate. In order to save Shizuka ...","publishedDate":"28 Nov. 1978","rating":{"count":18,"star":4}},{"idx":36,"no":"S1, Ep36","title":"The Eve of the Showdown","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"\"Even within all this silence, a flame is toiling.\"The beautiful, dazzling Shizuka Namino becomes a bit of a celebrity on board the Arcadia after being rescued. However, she's really a spy sent by Queen Lafresia. Upon the Queen's orders, she takes photos of the ship with a camera in her earring and seeks to discover Harlock's true intentions. However, Harlock doesn't fall to her sexual advances and provokes Lafresia, almost as if he knows Shizuka's true identity. Lafresia, hearing his words over her earring transmitter, becomes infuriated. She suddenly sends her main ...","publishedDate":"5 Dec. 1978","rating":{"count":18,"star":5.8}},{"idx":37,"no":"S1, Ep37","title":"Tears on a Red Sweater","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"\"It's cold in space.\"Upon realizing that Harlock knew who Shizuka's real identity is, she deems that she has failed in her mission. Harlock was going to banish her from his ship but he sees Shizuka help someone out and reconsiders. He decides to let her stay on the Arcadia but she then tries to blow up the main computer! Harlock scrambles to get the bomb out of the way and almost dies! The truth is that Shizuka was in love with Harlock, and as she couldn't live her life as a failure, she wanted to die by Harlock's doing.","publishedDate":"19 Dec. 1978","rating":{"count":18,"star":6.1}},{"idx":38,"no":"S1, Ep38","title":"Farewell, Mayu","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"\"Commander Kiruta gave me his word. I have trust in a man's promise.\"The invasion Mazone forces finally begin their attack on Earth. With no power to resist, the air space on Earth is quickly dominated. The Arcadia passes the main Mazone fleet by utilizing an electromagnetic storm and quickly rushes to Mayu's school to get her to safety. Kiruta says that the elder Hasshi who took care of him when he was young, in Egypt, would be able to look after her. Harlock agrees to entrust Mayu to Hasshi. As they make their way through the battle field to deliver Mayu to Egypt, ...","publishedDate":"9 Jan. 1979","rating":{"count":17,"star":3.8}},{"idx":39,"no":"S1, Ep39","title":"Courage: The Death of the Commander","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"\"Have a drink and talk to me. Sometimes people need to clear the air between them.\"The Arcadia leaves for space with Kiruta on board, after he was injured while trying to save Mayu. Before the final showdown, Kiruta confesses his true feelings to Harlock. About how he rescued a bunch of juvenile delinquents who were branded criminals, and how he wanted to create a future for them. He then drums up the courage to ferociously fight and closely battles with Mazone who board the ship. He then sacrifices himself to put up a defense and to protect Tadashi and First mate, ...","publishedDate":"16 Jan. 1979","rating":{"count":18,"star":6.7}},{"idx":40,"no":"S1, Ep40","title":"And Then the Angels Sang","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"\"I want to have a drink with you. Once the battle is ended.\"After a bunch of skirmishes, the true battle finally begins. The Mazone use an underhanded tactic by camouflaging a medic ship and sneaking in to attack. Harlock then rescues a pregnant woman from a civilian ship that they accidentally attack. As this is more important than being friend or foe, they ignore the Queen's orders for the time being. Neither party attacks until the baby is safely born. Seeing this side of Harlock for the first time, the Queen decides to stop the petty tricks and to fight Harlock ...","publishedDate":"23 Jan. 1979","rating":{"count":18,"star":6.9}},{"idx":41,"no":"S1, Ep41","title":"Duel! The Queen Versus Harlock","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"\"I want to make a flower bloom. A flower of the future.\"Making its way past countless gunshots, the Arcadia finally arrives at Queen Lafresia's flagship. The crew sans First mate Yattaran makes a full assault on the ship. Harlock then confronts Queen Lafresia, who is wearing a battle uniform. They clash swords as she furiously battles the man who trying to crush her dream. Then, Harlock's friend who is in the Arcadia helps Harlock to victory. When Harlock sees the red blood flowing from Lafresia's veins, he decides to let her and the Mazone go. However, her final ...","publishedDate":"30 Jan. 1979","rating":{"count":18,"star":7}},{"idx":42,"no":"S1, Ep42","title":"Farewell, Cosmic Corsair","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"\"Mayu, plant flowers on this burnt field. Then call the butterflies and birds back here. Daiba, make history.\"Harlock and his crew go for their triumphant return to Earth, but, all that awaits them is an order that they've been banished from Earth. Harlock, thinking for the young crewmembers' sake, pleads to the Prime Minister to just pardon them and to disband as pirates. However, even that plea is rejected. At that moment, all the Mazone that were lying dormant on Earth arise. Harlock realizes that the Queen hinted at this happening but it was too late, cities are ...","publishedDate":"13 Feb. 1979","rating":{"count":16,"star":7.1}}]}],"href":"https://m.media-amazon.com/images/M/MV5BMDYzZjlmM2UtNTIwOC00NTJlLWEzYzMtMjg1ZTg3MTY3NDgxXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg","aired":"16/11/1979","rating_star":7.8,"rating_count":1240,"staff":"","duration":""}}