{"warezcdn":{"imdb":"tt0434694","name":"Mobile Suit Gundam SEED DESTINY","href":"https://embed.warezcdn.net/serie/tt0434694","title":"Kidô senshi Gundam Seed Destiny"},"imdb":{"id":"tt0434694","review_api_path":"/reviews/tt0434694","imdb":"https://www.imdb.com/title/tt0434694","contentType":"TVSeries","productionStatus":"Released","title":"Kidô senshi Gundam Seed Destiny","image":"https://m.media-amazon.com/images/M/MV5BZTVjODAzOWItOThhZS00M2FkLWFiOTQtYTIzMzQ2MjJiZWEyXkEyXkFqcGdeQXVyMjc2Nzg5OTQ@._V1_.jpg","images":["https://m.media-amazon.com/images/M/MV5BMmYzMTlmZWMtMDIzMy00NTgwLWI4NmQtMWRhYmIwZTRiOGJmXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTkyOTYxNDA1MV5BMl5BanBnXkFtZTcwMDYyMTIzMQ@@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTYxMjk2NDIxNF5BMl5BanBnXkFtZTcwNTUwODIzMQ@@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BNTY3ODIzMzU5NF5BMl5BanBnXkFtZTcwNDAzOTIzMQ@@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTM0MTg1NTgwNl5BMl5BanBnXkFtZTcwNjA1ODYzMQ@@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTk2NDcxMDg5OV5BMl5BanBnXkFtZTcwMTY0NjczMQ@@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMzcyMDU5ODM3MF5BMl5BanBnXkFtZTcwNzAyOTI0MQ@@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTU3OTIzODEzOV5BMl5BanBnXkFtZTcwNTMyOTI0MQ@@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTUzMDg1MDU5OV5BMl5BanBnXkFtZTcwMTU5NDU0MQ@@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMjExNzQxODQ5OF5BMl5BanBnXkFtZTcwOTMwNzk0MQ@@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BOTk1N2FhNGMtMDkxOC00YzY5LWFkZDMtMTAyYzg4NjhhODExXkEyXkFqcGdeQXVyMTQzMzU5MDg5._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMDQwNjQwMDYtM2NlYS00MmJkLThmMjUtZmVmYmFhYzM3YWQyXkEyXkFqcGdeQXVyMTQzMzU5MDg5._V1_.jpg","https://m.media-amazon.com/images/M/MV5BNTQwOTI3NzEtMTc5OS00M2Q0LWI4N2MtOThkNTcxYzFkZDM0XkEyXkFqcGdeQXVyOTA0MzY4MjY@._V1_.jpg"],"plot":"Two years after the war between the Earth Alliance and ZAFT, conflicts between the two nations heat up again. Shin Asuka, the new main character's eyes are full of sorrow as his family was killed in Orb during the war. Meanwhile, ...","rating":{"count":1462,"star":7.1},"award":{"wins":0,"nominations":0},"contentRating":"TV-14","genre":"Animation,Action,Drama","year":2004,"runtime":null,"releaseDeatiled":{"day":9,"month":10,"year":2004,"releaseLocation":{"country":"Japan","cca2":"JP"},"originLocations":[{"country":"Japan","cca2":"JP"}]},"spokenLanguages":[{"language":"Japanese","id":"ja"}],"filmingLocations":[],"actors":["Aaron Phillips","Sam Vincent","Alyson Leigh Rosenfeld"],"directors":[],"top_credits":[{"name":"Creators","value":["Yoshiyuki Tomino","Hajime Yatate"]},{"name":"Stars","value":["Aaron Phillips","Sam Vincent","Alyson Leigh Rosenfeld"]}],"seasons":[{"id":"1","name":"Season 1","episodes":[{"idx":1,"no":"S1, Ep1","title":"Enraged Eyes","image":"https://m.media-amazon.com/images/M/MV5BNTQwOTI3NzEtMTc5OS00M2Q0LWI4N2MtOThkNTcxYzFkZDM0XkEyXkFqcGdeQXVyOTA0MzY4MjY@._V1_UY126_UX224_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNTQwOTI3NzEtMTc5OS00M2Q0LWI4N2MtOThkNTcxYzFkZDM0XkEyXkFqcGdeQXVyOTA0MzY4MjY@.jpg","plot":"In the 72nd year of the Cosmic Era, mankind's long war of bitter hatred has come to a close. Although peace has been achieved, it has been at the cost of innocent blood and broken dreams. Among those who has suffered deeply from the loss of both is the young Coordinator Shinn Asuka. Caught in the conflagration of the final battle of ORB, Shinn could only watch as his family was consumed, victims of chance and misdirected anger. Now, filled with a rage of his own and a desire to never see the innocent slaughtered again, he has left the peaceful nation that was his home...","publishedDate":"9 Oct. 2004","rating":{"count":14,"star":7.8}},{"idx":2,"no":"S1, Ep2","title":"Those Who Call for War","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Though the skies above the Coordinator's armory of military secrets has been darkened by the hungry flames of newfound conflict, from those same skies a possible savior sweeps down bearing a sword of justice. Thrust into his first real battle, Shin immediately has to contend with a menacing threat. Three of the PLANT's most sophisticated and deadly combat mobile suits have been stolen, by a group of mysterious young pilots hell-bent on taking the weapons for purposes unknown. Tasked with stopping them, it is all he can do to try and prevent them from breaching the ...","publishedDate":"16 Oct. 2004","rating":{"count":11,"star":7.4}},{"idx":3,"no":"S1, Ep3","title":"Warning Shots","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Shinn and Rey struggle against the enemy commander Neo Roanoke. In order to help her pilots, ZAFT Captain Talia Gladys orders the newly constructed warship Minerva to launch from Armory One and join the battle. The enemy forces withdraw, and the Minerva gives chase. Although Cagalli and Athrun have ended up aboard the Minerva, the apologetic Chairman Durandal informs them that there is no time to send them home to Orb. Durandal gives Cagalli a tour of the ship, and she reacts with anger to the sight of all ZAFT's new weaponry.","publishedDate":"23 Oct. 2004","rating":{"count":11,"star":7.4}},{"idx":8,"no":"S1, Ep8","title":"Junction","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Once the Minerva arrives in Orb, Cagalli resumes her duties as Chief Representative. Her prime minister, Unato Ema Seiran, tells her of the damage caused by the fall of Junius Seven and urges her to approve an alliance with the Atlantic Federation. The engineers of Morgenroete begin repair work on the Minerva, supervised by the former Archangel captain Murrue Ramius. Athrun meets with his old friends Kira Yamato and Lacus Clyne, who have taken refuge in Orb after their island home was flooded by the fall of Junius Seven. At last Athrun decides to return to space to ...","publishedDate":"4 Dec. 2004","rating":{"count":7,"star":6.2}},{"idx":9,"no":"S1, Ep9","title":"Bared Fangs","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"The Atlantic Federation and its allies declare war on the PLANTs in response to the fall of Junius Seven. Although Chairman Durandal still hopes for a diplomatic solution, the ZAFT forces are mobilized to defend the PLANTs. Yzak and his comrade Dearka Elsman join the battle only to discover that they are fighting decoys while the Earth Forces attack the PLANTs with nuclear weapons. As the battle rages, Athrun waits on the sidelines for a chance to talk to Durandal. He is surprised to encounter a young woman who looks just like Lacus, and is even more stunned when the ...","publishedDate":"11 Dec. 2004","rating":{"count":6,"star":6.2}},{"idx":10,"no":"S1, Ep10","title":"A Father's Spell","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Chairman Durandal tells the horrified Athrun the details of the Earth Forces' latest attack on the PLANTs. Giving up his Alex Dino alias, Athrun admits his true identity and begs Durandal not to let this conflict escalate into another war. As the citizens of the PLANTs call for revenge, the impostor Lacus Clyne appears on their screens to calm their anger. Durandal admits that he has created a false Lacus to influence the PLANT citizens, and tells Athrun that he wishes to make use of his strengths as well. After offering Athrun the use of a powerful new Gundam, ...","publishedDate":"18 Dec. 2004","rating":{"count":6,"star":6.4}},{"idx":11,"no":"S1, Ep11","title":"The Chosen Path","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"The conflict continues to escalate as Earth Forces fleets encircle the ZAFT bases at Gibraltar and Carpentaria, and the PLANT Supreme Council decides to strike back in the name of self-defense. Despite her best intentions, Cagalli yields to her ministers' demands that Orb ally itself with the Atlantic Federation. The Minerva receives a warning message and prepares to leave Orb before it is too late. In the PLANTs, Athrun visits the grave of his old comrade Nicol Amalfi. He is escorted by Yzak and Dearka, who urge him to return to the ZAFT forces. And back in Orb, ...","publishedDate":"25 Dec. 2004","rating":{"count":6,"star":6.6}},{"idx":13,"no":"S1, Ep13","title":"Resurrected Wings","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Thanks to Shinn's fighting prowess, the Minerva has overcome the Earth Forces fleet. As the ship continues on to Carpentaria, the Orb government concludes its alliance with the Atlantic Federation. Yuna Roma Seiran, the son of Orb's prime minister, pressures Cagalli to accept his marriage proposal in order to unite their nation. Now that Orb has aligned itself with the Earth Forces, Kira and his friends are considering leaving for the PLANTs. But their plans are disrupted when their home is attacked by Coordinator special forces who have been sent to assassinate Lacus...","publishedDate":"8 Jan. 2005","rating":{"count":8,"star":8.4}},{"idx":15,"no":"S1, Ep15","title":"Return to the Battlefield","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Aboard the Archangel, Cagalli berates the crew for abducting her in the middle of her wedding ceremony. Kira gives Athrun's ring back to her, and gently asks Cagalli to join them in seeking a better answer to the world's problems. After learning that the Minerva has left Orb, Athrun at last rejoins the ship at Carpentaria, bringing with him new orders from Chairman Durandal. Talia is surprised to learn that Durandal has made her a FAITH member as well, and by the details of the Minerva's next assignment. Their new mission will take them into western Eurasia, where ...","publishedDate":"22 Jan. 2005","rating":{"count":7,"star":7}},{"idx":16,"no":"S1, Ep16","title":"Struggle in the Indian Ocean","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"As the Minerva makes its way through the Indian Ocean, it draws the attention of an old enemy, Neo Roanoke of the elite Phantom Pain taskforce. Neo calls in support from the nearby Earth Forces and launches an aerial assault on the Minerva. But while Shinn and Athrun battle the enemy in the air, the Minerva and its submarine escort come under attack from the water as well. Shinn is drawn away from the battlefield and discovers the construction site of an Earth Forces frontline base. He is outraged to realize that the Earth Forces are using the local civilians for ...","publishedDate":"5 Feb. 2005","rating":{"count":0,"star":0}},{"idx":18,"no":"S1, Ep18","title":"Attack the Lohengrin!","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"As the Minerva approaches the Lohengrin Gate, Athrun explains the battle plan to the other pilots. While the Minerva and the soldiers of the Mahamul base draw the attention of the Earth Forces, one pilot will attack the positron cannon via a hidden tunnel. Athrun selects Shinn to carry out this vital mission, and the hotheaded young pilot agrees after one of the local resistance fighters begs for his help. Using data provides by the resistance, Shinn flies the separated parts of the Impulse Gundam through the darkness of the narrow tunnel. As he does so, his comrades ...","publishedDate":"19 Feb. 2005","rating":{"count":7,"star":6.6}},{"idx":19,"no":"S1, Ep19","title":"The Hidden Truth","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"The Minerva continues on to the shore of the Black Sea and docks at the city of Diocuia. Recently liberated from the control of the Earth Forces, Diocuia is now the latest stop on Meer Campbell's morale-building concert tour. Chairman Durandal himself is also visiting the city, and he invites the Minerva's mobile suit pilots to a personal meeting. In his conversation with the Minerva pilots, Durandal reveals the dark secret behind the current conflict. He blames the fighting on the secret society known as Logos, a group of industrialists and arms dealers who incite ...","publishedDate":"26 Feb. 2005","rating":{"count":6,"star":5.8}},{"idx":20,"no":"S1, Ep20","title":"Past","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"This episode recounts Shinn's personal history. During the previous war, Shinn and his family lived peacefully in the neutral nation of Orb, but eventually even Orb was drawn into the conflict. Clinging to its ideals, Orb refused to submit to the demands of the Earth Alliance, and Shinn lost his family in the invasion that followed. Once the war was over, Shinn emigrated to the PLANTs and enlisted in the ZAFT forces. Still haunted by the fate of his family, he is determined to gain the power to protect those who are important to him.","publishedDate":"5 Mar. 2005","rating":{"count":7,"star":5.4}},{"idx":22,"no":"S1, Ep22","title":"Sword of the Blue Skies","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Yielding to pressure from the Earth Forces, the government of Orb has agreed to join the fight against ZAFT. An Orb expeditionary fleet commanded by Yuna Roma Seiran is dispatched to back up Neo Roanoke's Phantom Pain taskforce. Meanwhile, the tensions among the Minerva's pilots have begun to ease thanks to the influence of the cheerful newcomer Heine. Though Athrun is troubled by the prospect of fighting against Orb, he now has a better understanding of Shinn's feelings toward his homeland. The Minerva leaves the Black Sea to intercept the approaching Orb fleet, and ...","publishedDate":"19 Mar. 2005","rating":{"count":7,"star":7.5}},{"idx":23,"no":"S1, Ep23","title":"The Shadows of War","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"The battle between the Minerva and the Orb fleet has been disrupted by the sudden appearance of the Archangel and Kira's Freedom Gundam. Cagalli enters the battlefield and orders the Orb forces to cease fighting, but Neo pressures Yuna into continuing the battle, and the Orb fleet renews its attack on the damaged Minerva. Since the Orb forces have rejected Cagalli's appeal, Kira sends her back to the Archangel and begins disabling both sides' mobile suits. Athrun tries to reason with his old friend, but he is unable to establish contact with Kira as the battlefield ...","publishedDate":"26 Mar. 2005","rating":{"count":6,"star":8.4}},{"idx":24,"no":"S1, Ep24","title":"Differing Views","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"The battered Minerva retreats to a port on the Sea of Marmara to repair the damage it sustained in the Dardanelles battle. Troubled by the chaos his former comrades created during the fighting, Athrun decides to leave the Minerva and go in search of the Archangel so that he can talk to Kira and the others in person. The Minerva receives orders to investigate an abandoned Earth Forces research facility in the area. Shinn and Rey are sent to check out the facility, but Rey suffers a mysterious reaction as they explore the deserted Lodonia laboratory.","publishedDate":"2 Apr. 2005","rating":{"count":6,"star":7.8}},{"idx":25,"no":"S1, Ep25","title":"The Place of Sin","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Athrun has arranged a meeting with Kira and Cagalli, but the old friends no longer see eye to eye. Even after hearing of the assassination attempt on Lacus, Athrun still believes in Chairman Durandal's good intentions, and he returns to the Minerva after urging his friends to keep Orb from participating in the war. The Minerva travels to the Lodonia laboratory to retrieve Rey and continue the investigation. This abandoned facility proves to be a laboratory where the Earth Forces experimented on children to create Extended soldiers. At their own nearby base, the ...","publishedDate":"9 Apr. 2005","rating":{"count":6,"star":8.2}},{"idx":26,"no":"S1, Ep26","title":"The Promise","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"After running off alone to the Lodonia laboratory, the Extended soldier Stella Loussier has been captured by the Minerva's pilots. Shinn brings the injured Stella aboard the Minerva, but the ship's doctors are unable to treat her due to her abnormal physiology. They also discover that Stella's memories have also been modified, and she now has no recollection of meeting Shinn. Meanwhile, Lacus has decided to leave the Archangel and return to space in order to investigate the current situation in the PLANTs. Posing as the Lacus impersonator Meer Campbell, she steals a ...","publishedDate":"16 Apr. 2005","rating":{"count":6,"star":8.4}},{"idx":29,"no":"S1, Ep29","title":"Fates","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Lacus returns to space and joins her allies aboard the warship Eternal, which is now hidden inside a cluster of asteroids. Chairman Durandal orders his forces to continue searching for Lacus, insisting that she is merely an impostor. Alone in his office, Durandal ponders the chance meeting that brought Lacus and Kira together, and questions whether it was coincidence or fate. Thinking back on his own life and the choices he has made, he wonders whether he might have found happiness along another path. In his imagination, Durandal hears the mocking voice of Rau Le ...","publishedDate":"7 May 2005","rating":{"count":8,"star":4.5}},{"idx":30,"no":"S1, Ep30","title":"A Fleeting Dream","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"In the aftermath of the battle at Crete, the Archangel retrieves survivors from the Orb fleet, who ask to join Cagalli in her fight to restore Orb's ideals. Meanwhile, the Minerva is undergoing another round of repairs before continuing on to Gibraltar. While Athrun frets over his confrontation with Kira, Shinn has other matters on his mind. The enemy pilot Stella Loussier, who Shinn once promised to protect, is still a prisoner aboard the Minerva. As Stella's condition continues to deteriorate, Shinn decides on a desperate plan of action to save her life.","publishedDate":"14 May 2005","rating":{"count":6,"star":7.8}},{"idx":31,"no":"S1, Ep31","title":"The Endless Night","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Shinn and Rey have returned Stella to her allies in order to save her life. As punishment for defying military regulations, the two pilots are placed in detention while the ZAFT leadership determines their fate. To Talia's shock, her superiors decide to overlook the matter entirely, and she realizes that Durandal is intervening from behind the scenes to protect Shinn and Rey. Having failed in their mission to destroy the Minerva, Neo Roanoke and his Phantom Pain taskforce receive a new assignment. Stella is placed at the controls of the monstrous Destroy Gundam and ...","publishedDate":"21 May 2005","rating":{"count":6,"star":7.6}},{"idx":32,"no":"S1, Ep32","title":"Stella","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"The Destroy Gundam advances towards Berlin, crushing one city after another. The Archangel arrives to confront the Destroy, but even Kira's Freedom Gundam is no match for its overwhelming power. As the Minerva reaches the scene, Shinn joins the battle in his Impulse Gundam, but he hesitates in his attack when he learns that Stella is the pilot of this monstrous Gundam. In the middle of battle, Neo's mobile suit is shot down, sending Stella into a frenzy. Shinn continues calling out to Stella, trying to calm her down, but the sight of the Freedom sends her into a ...","publishedDate":"28 May 2005","rating":{"count":6,"star":8.4}},{"idx":33,"no":"S1, Ep33","title":"The World Revealed","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"After laying Stella's body to rest, Shinn returns to the Minerva with a new determination. When Athrun visits Shinn's room, he finds Shinn and Rey running combat simulations to prepare for a confrontation with the Freedom. Meanwhile, Neo Roanoke awakens aboard the Archangel. To his confusion, the Archangel crew insist that Neo is in fact their lost comrade Mu La Flaga, but he has no memories of his life as Mu. The situation then takes a new turn as Chairman Durandal begins a worldwide broadcast...","publishedDate":"4 Jun. 2005","rating":{"count":6,"star":6.6}},{"idx":34,"no":"S1, Ep34","title":"Nightmare","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Chairman Durandal has revealed the existence of Logos to the public, throwing the world into a state of confusion. Kira and Cagalli fear that their homeland is now in danger, and the Archangel begins making its way back to Orb. However, the Archangel itself is now a target. In the wake of Durandal's announcement, the ship and its crew have been designated as dangerous elements, and the Minerva is ordered to join the ZAFT forces in an attack on the Archangel. After Murrue rejects Talia's offer of surrender, the two ships engage each other in battle, and Shinn and Kira ...","publishedDate":"11 Jun. 2005","rating":{"count":6,"star":8}},{"idx":35,"no":"S1, Ep35","title":"Eve of Chaos","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Although the Archangel has escaped the Minerva's attack, the Freedom has been destroyed, and the ship itself badly damaged. After retrieving Kira, the Archangel continues on to Orb, while Shinn returns to the Minerva and receives a hero's welcome. Responding to Chairman Durandal's speech, the people of Earth have risen up against Logos, forcing Lord Djibril and his comrades to flee to the Earth Forces stronghold known as Heaven's Base. The Minerva arrives at Gibraltar to join the ZAFT forces which are gathering for an attack on Heaven's Base, and Shinn and Athrun are ...","publishedDate":"18 Jun. 2005","rating":{"count":6,"star":6.8}},{"idx":36,"no":"S1, Ep36","title":"Athrun on the Run","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Chairman Durandal, accompanied by Meer Campbell, presents Shinn and Athrun with a pair of powerful new Gundams. Shinn is delighted with this gift, but Athrun is still upset that they were ordered to attack the Archangel. Meer is worried by Athrun's reaction, and her fears are confirmed when she overhears Durandal and Rey discussing their plans for Athrun. Thanks to Meer's warning, Athrun makes a getaway just before Durandal can have him arrested, but Meer chooses to continue playing the role of Lacus Clyne rather than escape with him. With the help of an unexpected ...","publishedDate":"25 Jun. 2005","rating":{"count":9,"star":7.6}},{"idx":37,"no":"S1, Ep37","title":"Thunder in the Dark","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"As Athrun and Meyrin escape from Gibraltar in a stolen mobile suit, Shinn and Rey pursue them in the new Destiny and Legend Gundams. Claiming that the fugitives have stolen classified information, Chairman Durandal orders Shinn and Rey to shoot them down. Rey tells the horrified Shinn that the traitors must be destroyed for the sake of Durandal's dream of peace. The crew of the Minerva are shocked by this turn of events, and Lunamaria is heartbroken by the loss of her sister. Even as they grieve, Durandal issues an ultimatum to the Earth Forces at Heaven's Base, ...","publishedDate":"2 Jul. 2005","rating":{"count":6,"star":6.4}},{"idx":38,"no":"S1, Ep38","title":"A New Flag","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"The ZAFT forces gather around Heaven's Base as they wait for the Earth Forces to respond to Chairman Durandal's ultimatum. Aboard the Minerva, Lunamaria channels her grief into anger at Logos, while Shinn does his best to comfort her. Neither of them suspects that Athrun and Meyrin are now alive and well aboard the Archangel. Without warning, the Earth Forces open fire on the ZAFT fleet. Five monstrous Destroy Gundams lead the attack, while Heaven's Base deploys a secret weapon against the ZAFT forces descending from orbit. Only the power of the Minerva and its pilots...","publishedDate":"9 Jul. 2005","rating":{"count":6,"star":7.4}},{"idx":40,"no":"S1, Ep40","title":"Legacy of Gold","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Shinn and Rey receive medals for their exploits at Heaven's Base, and Chairman Durandal awards them their own FAITH insignia. But a new crisis is already beginning, as ZAFT has discovered that Lord Djibril has taken refuge in Orb. When the Seiran family refuses to turn over the fugitive, Durandal responds by launching an armed invasion. Cagalli watches these events in horror. Although the Archangel is still undergoing repair, Kira is in space, and Athrun is recovering from his injuries, she is determined to defend her homeland. As Cagalli prepares to enter battle, she...","publishedDate":"23 Jul. 2005","rating":{"count":9,"star":8.3}},{"idx":41,"no":"S1, Ep41","title":"Refrain","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Aboard the Archangel, the injured Athrun thinks back upon the path he has followed to this point. Even though he saw the pointlessness of war during the previous conflict, he rejoined ZAFT and fought alongside the Minerva crew in order to bring the new war to an end. Now that Athrun has realized the sinister intentions of Chairman Durandal, he has rejoined his old friends. Meanwhile, Kira considers his own situation. Despite his hatred of war, he has returned to the battlefield in order to halt Durandal's plans. Placing his hopes in Lacus and Cagalli, he fights to ...","publishedDate":"30 Jul. 2005","rating":{"count":6,"star":7.2}},{"idx":42,"no":"S1, Ep42","title":"Freedom and Justice","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Cagalli and her golden mobile suit Akatsuki have turned the tide of battle in Orb's favor, but she now finds herself facing enemy reinforcements, in the form of the Minerva and Shinn's Destiny Gundam. Even as the Archangel rushes to Cagalli's aid, Kira and Lacus return from space with a pair of new Gundams. While the Archangel clashes with the Minerva, Kira uses his new Strike Freedom Gundam to fend off the Destiny, forcing Shinn to retreat. During this lull in the fighting, Cagalli prepares the Orb defense forces for the next wave of attacks, while Athrun and Neo ...","publishedDate":"6 Aug. 2005","rating":{"count":6,"star":7.4}},{"idx":45,"no":"S1, Ep45","title":"Prelude to Revolution","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Although the Requiem cannon has missed the PLANT capital of Aprilius, it has wreaked vast destruction on the surrounding PLANTs. In response, ZAFT sends its lunar orbital fleet to attack Requiem's first relay station, while the Minerva rushes to the Daedalus base to capture the cannon itself. As the Earth Forces prepare to fire a second shot, the Minerva and its Gundam pilots desperately fight their way through the enemy lines. But this time, Shinn and Rey are merely decoys, for the success of the operation and the survival of the PLANTs rest on Lunamaria's shoulders.","publishedDate":"27 Aug. 2005","rating":{"count":6,"star":7.6}},{"idx":46,"no":"S1, Ep46","title":"The Song of Truth","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"With the Daedalus base captured, Lord Djibril eliminated, and the Requiem relay stations safely under ZAFT control, Chairman Durandal's victory now appears complete. As the world awaits Durandal's next move, the Archangel heads for the free lunar city of Copernicus to monitor the situation. Once the Archangel reaches its destination, Kira, Athrun, Lacus, and Meyrin pay a visit to Copernicus and receive an urgent message from Meer Campbell. Although the message is clearly a trap, Lacus insists on meeting her impersonator in person, and the four friends make their way ...","publishedDate":"3 Sep. 2005","rating":{"count":6,"star":6.4}},{"idx":50,"no":"S1, Ep50","title":"The Final Power","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Having eliminated Requiem's first relay station, the Archangel and Eternal rush to the moon to join the attack on the Daedalus base, only to find their way barred by the mobile fortress Messiah. Kira tells Athrun and the Archangel to continue on and destroy the Requiem cannon, while he and the Eternal stay behind to deal with Messiah. The Archangel races toward the Daedalus base, with the Minerva and Shinn's Destiny Gundam in hot pursuit, and Athrun is forced to battle Shinn and Lunamaria in order to protect the Archangel. Meanwhile, the Eternal leads the attack on ...","publishedDate":"1 Oct. 2005","rating":{"count":11,"star":9.2}}]}],"href":"https://m.media-amazon.com/images/M/MV5BZTVjODAzOWItOThhZS00M2FkLWFiOTQtYTIzMzQ2MjJiZWEyXkEyXkFqcGdeQXVyMjc2Nzg5OTQ@._V1_.jpg","aired":"9/10/2004","rating_star":7.1,"rating_count":1462,"staff":"","duration":""}}