{"warezcdn":{"imdb":"tt0144069","name":"Street Fighter II: Victory","href":"https://embed.warezcdn.net/serie/tt0144069","title":"Street Fighter II: V"},"imdb":{"id":"tt0144069","review_api_path":"/reviews/tt0144069","imdb":"https://www.imdb.com/title/tt0144069","contentType":"TVSeries","productionStatus":"Released","title":"Street Fighter II: V","image":"https://m.media-amazon.com/images/M/MV5BYmJiMTI1ODItZGExZi00ZGI5LWE2NjUtNjU4NTY4NzkxNjg3XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg","images":["https://m.media-amazon.com/images/M/MV5BYjg0OGU1MWMtZWI5Yy00NzliLTg5ODEtMjcxZjViNDUzODdhXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTIwZjk2NDAtNTIyZi00NzdiLWJlOWQtZTA2M2JhMWVjNGEyXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTgxMDAzNTc1OV5BMl5BanBnXkFtZTYwNDE4MTk4._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTMzODIyNjcxOF5BMl5BanBnXkFtZTYwNDM2Mjk4._V1_.jpg","https://m.media-amazon.com/images/M/MV5BNzE5MTk5MDg5Ml5BMl5BanBnXkFtZTYwMTE2NTA5._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTY4MDc2MDExMV5BMl5BanBnXkFtZTYwNzYwODA5._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTQyMjMzNzI1MV5BMl5BanBnXkFtZTYwODU1OTA5._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTQ4NjU2NDQ1OF5BMl5BanBnXkFtZTYwNzM4NTE5._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMjc1NDY0NzQzNl5BMl5BanBnXkFtZTYwMzE0NjE5._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTkyMTU0OTQwNV5BMl5BanBnXkFtZTYwNDgxODE5._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTI2MTMyMzkxNl5BMl5BanBnXkFtZTYwMDA3NTI5._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMjE2NTAzMTQ1MF5BMl5BanBnXkFtZTYwODIzNDQ5._V1_.jpg","https://m.media-amazon.com/images/M/MV5BMTkxMzIxMzU0Nl5BMl5BanBnXkFtZTcwOTI3MTAwMQ@@._V1_.jpg"],"plot":"Based off of the video game, on an island off the coast of Japan, Ryu, a martial artist, was given an invitation and some American money from his friend Ken Masters, telling him to come to the United States. Ryu arrives in San Fra...","rating":{"count":2365,"star":7.5},"award":{"wins":0,"nominations":0},"contentRating":"TV-Y7","genre":"Animation,Action,Adventure","year":1995,"runtime":null,"releaseDeatiled":{"day":10,"month":4,"year":1995,"releaseLocation":{"country":"Japan","cca2":"JP"},"originLocations":[{"country":"Japan","cca2":"JP"}]},"spokenLanguages":[{"language":"Japanese","id":"ja"},{"language":"English","id":"en"}],"filmingLocations":[],"actors":["Tesshô Genda","Skip Stellrecht","Kirk Thornton"],"directors":[],"top_credits":[{"name":"Stars","value":["Tesshô Genda","Skip Stellrecht","Kirk Thornton"]}],"seasons":[{"id":"1","name":"Season 1","episodes":[{"idx":1,"no":"S1, Ep1","title":"The Beginning of a Journey","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"One day on makunai island (off the coast of Japan) Ryu receives a letter from his pen pal from the United States, Ken. It is an invitation for Ryu to come to meet Ken in San Francisco. Ryu accepts this invitation. When Ryu arrives in San Francisco, Ken picks him up and brings him to his house. Then, at night, Ken decides to scope San Francisco for bars, then Ken flirts with one of the air force pilots' girlfriends and gets into a fight. Ken defeats the pilot, but he and Ryu are unaware of their next opponent.","publishedDate":"10 Apr. 1995","rating":{"count":62,"star":7.6}},{"idx":2,"no":"S1, Ep2","title":"The King of the Air Force","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"As Ken defeats an air force pilot in the bar, the pilot's commander going by the name of Guile steps in and sees what Ken has done. However, Ryu wants to have his turn at kicking butt. However, Guile dodges Ryu's attacks and defeats Ryu easily. Ken, angry and out for revenge on Guile, Ken searches every air force base to find Guile, Ken eventually finds him and confronts Guile. Unfortunately for Ken, he suffers the same fate as Ryu. Then, both Ryu and Ken realize that Guile is nothing like any of the opponents that they are use to fighting in karate tournaments, they ...","publishedDate":"17 Apr. 1995","rating":{"count":51,"star":7.7}},{"idx":3,"no":"S1, Ep3","title":"Landing in Hong Kong","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Ryu and Ken take a trip to Hong Kong where their tour guide, Chun Li takes them to an underground fighting arena.","publishedDate":"24 Apr. 1995","rating":{"count":43,"star":7.3}},{"idx":4,"no":"S1, Ep4","title":"Darkness at Kowloon Palace","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Ryu, Ken and Chun-Li try to escape from Kowloon Palace. Then, they are being attacked by street fighters from all sides. So, they realize that they have to fight in order to survive. then, Chun-Li's father Captain Dorai, comes in to assist them.","publishedDate":"1 May 1995","rating":{"count":40,"star":7.2}},{"idx":5,"no":"S1, Ep5","title":"Hot Blooded Fei-Long","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"After escaping from Kowloon Palace, Ryu, Ken and Chun-Li decide to have an easy day in Hong Kong. First, they have breakfast. Then, Chun-Li suggested to go see her friend, the martial arts superstar Fei-Long, perform in his latest movie while it is in still production. To Ryu and Ken's surprise, Fei-Long decides to choose one of them in a fight scene in the movie. He chooses Ken. Then, they fight, and it turns out to be one of the best fight scenes ever shot.","publishedDate":"8 May 1995","rating":{"count":38,"star":7.1}},{"idx":6,"no":"S1, Ep6","title":"Appearance of the Secret Technique","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"It is another lazy Hong Kong day for Ryu, Ken and Chun-Li. This time, the 3 decide to go to Hong Kong's malls. Ken and Chun-Li were fascinated, but it easily bores Ryu. Then, Ryu spots an old man struggling to breathe, he aids the old man. Suddenly, a mysterious blue aura radiates from the old man's body, and just like that, the old man feels better. The old man decides to help Ryu, he tells him of a legend of a mystical energy called \"Ki\", and he even shows Ryu on how to perform a special fighting technique, though Ryu still does not believe in it. Then, he rejoins ...","publishedDate":"22 May 1995","rating":{"count":38,"star":7.4}},{"idx":7,"no":"S1, Ep7","title":"Revenge of the Ashura","image":"https://m.media-amazon.com/images/M/MV5BYjg0OGU1MWMtZWI5Yy00NzliLTg5ODEtMjcxZjViNDUzODdhXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BYjg0OGU1MWMtZWI5Yy00NzliLTg5ODEtMjcxZjViNDUzODdhXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"For several unrelenting days, Captain Dorai is hunting down a powerful underground drug ring known as \"Ashura\". Dorai has already arrested several Ashura members. Now, the Ashura are going to act revenge on Dorai. By doing so, they intend to kidnap his daughter, Chun-Li. One day after school, Chun-Li was spotted by a clown who tried to apprehend her, but, then fought back. Ryu and Ken soon joined to stop the criminals. The Ashura then tried to finish off Dorai at his own home, who was unknowingly waiting for them. Then, Ryu, Ken, Chun-Li and Fei-Long came to help him....","publishedDate":"19 May 1995","rating":{"count":35,"star":7.3}},{"idx":8,"no":"S1, Ep8","title":"Trap, Prison, and the Scream of Truth","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Ryu and Ken are chasing down the Ashura. They have tracked them to Thailand. Unfortunately, no sooner that Ryu and Ken arrive in Thailand, Ryu is arrested for drug possession. Since there is no evidence that Ryu is innocent, Ryu was sent to prison, there he faced the warden, Nuchit. Meanwhile, Ken is trying to search for the man who set Ryu up with the drugs. Then Ryu gets into trouble with the other prisoners and fights with them. Ryu defeats the prisoners, but then, he will face a tough prisoner.","publishedDate":"25 May 1995","rating":{"count":33,"star":7.6}},{"idx":9,"no":"S1, Ep9","title":"The Superstar of Muay Thai","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"After Ryu defeated several prisoners, he is faced with a bug strong prisoner. He is Sagat, the former Muay Thai kick boxing champion. Sagat was not happy that Ryu defeated the prisoners. So, Ryu and Sagat fought. At first, Sagat had Ryu pinned down, then Ryu retaliated. Afgter the fight, Sagat tells Ryu on how he had it all, and why he was in prison, he as well as Ryu was set up by the Ashura. Meanwhile ,Ken finally finds the person who set up Ryu with the drugs. Then, Ryu was free from prison. Now, he helps Ken to defeat the Ashura.","publishedDate":"1 Jun. 1995","rating":{"count":35,"star":7.5}},{"idx":10,"no":"S1, Ep10","title":"Dark Omen","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Ryu and Ken are still hot on the trail of the Ashura. Now, Captain Dorai comes to help Ryu and Ken. Then, Ryu and Ken were attacked by a sniper. They quickly escape and jump onto a back of a truck to infiltrate the hideout. Then, they are faced with the head of the Ashura. Ryu and Ken fight the leader and his henchmen and defeating them, and thus, down falling the Ashura for good. Then, Ryu meets Sagat who is now released from prison. Sagat finds out that Ryu is finding somebody who knows about the \"Ki\". Sagat tells Ryu and Ken to go to India to seek the one named, ...","publishedDate":"8 Jun. 1995","rating":{"count":32,"star":7.1}},{"idx":11,"no":"S1, Ep11","title":"Visitation of the Beasts","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Ryu and Ken head for India. They take a boat up the Ganges river, where they find a doctor with a makeshift hospital who is being harassed by some local people who want the hospital gone. Ryu and Ken help the doctor and then, with some of Ken's fortune, the doctor can build a better hospital. Ryu and Ken continue their journey up the river and find a village where Dhalsim lives. but, Dhalsim refuses to teach them about the \"Ki\". Then, a group of treasure hunters enter a forbidden temple to steal an ancient artifact, but they suspect that there is a monster that guards...","publishedDate":"15 Jun. 1995","rating":{"count":32,"star":7.4}},{"idx":12,"no":"S1, Ep12","title":"The Deadly Phantom Faceoff","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Ryu and Ken try to stop the treasure hunters from stealing the artifact. But, the hunters tell Ryu and Ken to steal it for them, but they do not want to go in there without Dhalsim's permission, but Dhalsim tells them to go into the forbidden temple. But, as they enter the temple, Ryu and Ken are surrounded by mysterious smoke and are in some kind of strange place, just then, Ryu is faced by a giant living statue, and Ken is faced by another living statue. Ryu and Ken try to fight these statues, but no matter how hard Ryu and Ken fight, they can't defeat the statues. ...","publishedDate":"22 Jun. 1995","rating":{"count":33,"star":7.7}},{"idx":13,"no":"S1, Ep13","title":"The Legend of Hodou-Ken","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"After Ryu and Ken completed their test in the forbidden temple, Dhalsim decides to take the 2 men under his wing in teaching them about an energy called \"Hadou\". While learning about Hadou, Ryu experiences a surging of energy in his body. Ryu then tries to shoot it out with the technique he learned from Yo Sen-Ko from Hong Kong. Unfortunately, the energy explodes out of Ryu, meaning that he did not have control. So, Ryu returns to the forbidden temple to try to control the Hadou. After a series of tests, he finally knows how to shoot out the Haodu, what he shot out ...","publishedDate":"29 Jun. 1995","rating":{"count":31,"star":7.5}},{"idx":14,"no":"S1, Ep14","title":"The Bloodthirsty Prince","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Ryu and Ken arrive in Barcelona, Spain to meet up with Chun-Li and her father Captain Dorai to attend a meeting with Interpol. Ryu and Ken were presented with awards for helping Dorai in apprehending the Asura. After that, Ryu, Ken and Chun-Li decide to go around Barcelona. They go to see a bull fight with one of the finest matadors around, Vega. Vega also is somewhat disturbingly interested in Chun-Li, but Chun-Li dislikes his methods of defeating a bull. That night, Vega sneaks into the hotel where Ryu, Ken and Chun-Li are staying, and appears right in Chun-Li's ...","publishedDate":"6 Jul. 1995","rating":{"count":34,"star":7.6}},{"idx":15,"no":"S1, Ep15","title":"The Clash of the Titans","image":"https://m.media-amazon.com/images/M/MV5BNjQ4ZTVjZmMtZmJjNy00Mzg3LWE3ZTEtZTYwMDJlY2NmYWIxXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UX224_CR0,0,224,126_AL_.jpg","image_large":"https://m.media-amazon.com/images/M/MV5BNjQ4ZTVjZmMtZmJjNy00Mzg3LWE3ZTEtZTYwMDJlY2NmYWIxXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg","plot":"The next morning in Barcelona, Ryu, Ken and Chun-Li are trying to find out who was in Chun-Li's room on the previous night. Then, the trio receives an invitation to a formal ball. Ryu was not interested and decided to stay and train on his Hadou-Ken, while Ken and Chun-Li accepted the invitation. Then during the ball Vega shows up and Chun-Li is somehow dazed at Vega's appearance. Ken found out that it was Vega that was in Chun-Li's room and doped her with some drug. Vega asks Ken to fight him, Ken accepts. They fight, then Ken discovers that he is going to have to ...","publishedDate":"13 Jul. 1995","rating":{"count":34,"star":7.8}},{"idx":16,"no":"S1, Ep16","title":"The Unveiled Ruler","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"As the fight between Ken and Vega continues. The leader of a criminal organization known as \"Shado Law\" comes out of hiding. He is known as \"M. Bison\". Meanwhile, Ryu is on the beach trying to learn how to control his Hadou-Ken. As for Ken and his fight with Vega, Ken is becoming severely injured from Vega's claw.","publishedDate":"20 Jul. 1995","rating":{"count":36,"star":7.9}},{"idx":17,"no":"S1, Ep17","title":"The Despot's Commander","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Ryu and Ken have both triumphed, as Ryu finally perfects his Hadou-Ken (unfortunately, he passes out soon thereafter), Ken defeats Vega in dramatic fashion. Chun-Li soon recovers from her trance and consoles a badly injured Ken. M. Bison is impressed of what he saw and orders to see Ken. Both Ken and Vega are on stretchers to be taken care of. But, Chun-Li soon realizes that she and Ken are walking into a trap set by Bison. Chun-Li is confronted by Bison, but, somehow Chun-Li's attacks do not seem to hurt Bison at all and easily knocked away.","publishedDate":"27 Jul. 1995","rating":{"count":31,"star":7.4}},{"idx":18,"no":"S1, Ep18","title":"The Beautiful Assassin","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Chun-Li continues to fight with M. Bison, but he somehow knocks out Chun-Li. Ken (while sedated) experiences some of the fight. Now, that Bison has both Ken and Chun-Li, he sends a ransom video to Ken's father. This is when Mr. Masters calls on several air force pilots to find Ken. It is Guile and his partner Nash. Guile quickly realizes that they are the same Ryu and Ken he fought previously. But, he agrees to find them. Meanwhile, a Shado Law agent (who is posing as an Interpol agent) is beginning his mission to finish off Captain Dorai. He plans to do so with the ...","publishedDate":"4 Aug. 1995","rating":{"count":32,"star":6.9}},{"idx":19,"no":"S1, Ep19","title":"Special Orders to the Iron Men","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Guile and Nash head for Barcelona to find any leads of Ken's disappearance, but found nothing. Meanwhile a Russian wrestler named, Zangief is ordered to move in and capture Ryu (who is still unconscious on the beach). But, Ryu wakes up in time to fight Zangief.","publishedDate":"11 Aug. 1995","rating":{"count":30,"star":6.8}},{"idx":20,"no":"S1, Ep20","title":"Unknown Explosive Force","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Ryu fights Zangief, but he is still too weak from performing his Hadou-Ken, and is easily defeated. Meanwhile, Cammy finally strikes at Captain Dorai and Dorai is badly hurt from Cammy's sharp cross string and falls into a flatbed truck. Then, Guile and Nash did discover some leads of Ken. a bait shop owner said that a man (possibly M. Bison) took a man and a girl out to sea somewhere. So, Guile and Nash rent a fishing boat and head out to sea. Meanwhile, Ryu wakes up in a strange room. Then he is confronted by M. Bison. Ryu then fights M. Bison. Then, Ryu tries to ...","publishedDate":"18 Aug. 1995","rating":{"count":30,"star":6.9}},{"idx":21,"no":"S1, Ep21","title":"Compulsion Towards Vengence","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"On an Island off the coast of Portugal, M. Bison'a scientists have completed their latest invention, the Cyber Chip, which is implanted to a person's forehead. Once implanted, this gives Bison the ability to control the subject, he can have complete control over the subject as well, over their actions, their thoughts, even their emotions. Meanwhile, Guile and Nash wait patiently until night to move in on the island where Bison is keeping Ken hostage. As for Ken, he slowly regains consciousness. Meanwhile, Fei-Long arrives in Barcelona, only to find out what had ...","publishedDate":"25 Aug. 1995","rating":{"count":29,"star":7}},{"idx":22,"no":"S1, Ep22","title":"Rising Dragon, Into the Sky","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"With the help of another form of Hadou, Ken finally regains consciousness, then he realizes that he is in chains. Again, with the help of Hadou, he breaks free. Now, Ken knows that he has to find Chun-Li. Then, Ken realizes that Ryu is captured by M. Bison as well. Meanwhile, Fei-long goes to the hospital where Captain Dorai is, but, there is nothing that Fei-Long can do right now. Then, Ken uses the Hadou again to begin his exploration of his friends, it is Ken's powerful move, the Hadou Shoryuken. However, Guile and Nash witness this event and decide to move in ...","publishedDate":"1 Sep. 1995","rating":{"count":29,"star":7}},{"idx":23,"no":"S1, Ep23","title":"The Icy Light in Their Eyes","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Ken is free from capture and is now infiltrating M. Bison's secret base to find his friends Chun-Li and Ryu. Meanwhile, Guile and Nash are beginning their own infiltration. At the hospital in Barcelona, Balrog has received information that captain Dorai is dead. But Balrog wants to be sure of that, so he orders Cammy to kill him while at the hospital. Back at the base, Ken has entered and finds Chun-Li (who is now a cyber warrior). He witnesses her killing a test soldier.","publishedDate":"8 Sep. 1995","rating":{"count":29,"star":6.7}},{"idx":24,"no":"S1, Ep24","title":"Nightmare Reunion","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Ken finds both Ryu and Chun-Li. Unfortunately, they are being controlled by M. Bison. As Ryu steps into the test arena, Bison wants to use his Hadou-Ken. Ken realizes that he must get Ryu out of there. Meanwhile, Guile and Nash have invaded deep into the base. They decide to split up to cover more ground. They also planted plastic explosives to cover their escape. But it was not long at all before Guile encounters Zangief. Then, Ken decides to use his Shoryuken to break through into the arena. Then he is encountered by Ryu, who is ordered to fight Ken.","publishedDate":"15 Sep. 1995","rating":{"count":28,"star":7}},{"idx":25,"no":"S1, Ep25","title":"Fight to the Finish: Round 1","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"Ryu, who is controlled by M.Bison, has been ordered to fight Ken. But Ken is reluctant and pushes him back. Meanwhile somewhere in the base, Guile fights Zangief, and Guile is experiencing the power of Zangief. In the hospital in Barcelona, Cammy comes in and uses knockout gas on the doctors so she can move in on an injured Captain Dorai. But, what she does not know that Fei-Long is waiting for her and they fight. So, 3 fights happen at the same time.","publishedDate":"22 Sep. 1995","rating":{"count":32,"star":7}},{"idx":26,"no":"S1, Ep26","title":"Fight to the Finish: Round 2","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"The 3 fights continue. During the Ryu and Ken fight, Ken realizes that Ryu is not going to stop until he is dead, so he must fight back. In the Guile and Zangief fight, Zangief begins to gain the upper hand but a quick retaliation from Guile is what leads Guile to victory over Zangief. During the Cammy and Fei-Long fight, that fight continues, Fei-Long will not stop. Meanwhile, Nash finds where M.Bison is hiding, he goes in and tries to shoot at Bison, but Bison somehow deflects it. Then, Bison uses his powers again to kill of Nash. Meanwhile, during the Ryu and Ken ...","publishedDate":"29 Sep. 1995","rating":{"count":31,"star":7.3}},{"idx":27,"no":"S1, Ep27","title":"Fight to the Finish: Round 3","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"As Guile defeats Zangief, he finds Nash, who was killed by M.Bison. Guile is broken over the death of his friend and partner. With rage, he attacks Bison, but Bison pushes Guile back. Then he orders Chun-Li to attack Guile. Meanwhile, at the hospital in Barcelona, Fei-Long decides to reason with Cammy, he tells her that she has been deceived by Shado Law, then she turns on Balrog. Back at the base, Ryu and ken focus their Hadou and their moves collide, causing a massive explosion, knocking both Ryu and Ken out and dislodging the Cyber-Chip from Ryu's head.","publishedDate":"6 Oct. 1995","rating":{"count":29,"star":7.4}},{"idx":28,"no":"S1, Ep28","title":"Fight to the Finish: Round 4","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"The massive explosion caused by the collision of the 2 Hadou forces is causing the base to collapse. Now, the Cyber-Chip that was planted in Ryu's forehead is dislodged, which means that Ryu is free from Bison's control. Ken tells him what is going on and now go to find Chun-Li and Bison. The 2 find Bison and Chun-Li and were surprised to find Guile there as well. Then, bison tells everybody on the base to evacuate. Because he has chosen the fighters that he wants to fight in an epic battle of Shado Law. He has chosen Ryu and Ken.","publishedDate":"13 Oct. 1995","rating":{"count":29,"star":7.4}},{"idx":29,"no":"S1, Ep29","title":"Fight to the Finish: Final Round","image":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","image_large":"https://m.media-amazon.com/images/G/01/IMDb/spinning-progress.gif","plot":"M.Bison has chosen Ryu and Ken to a fight to the death. Now, there in a strange dome. Ryu and Ken realize that Bison has a power known as psycho power. Which means that Bison is immune to regular attacks. Once he defeats Ryu and Ken, Bison can conquer the world. Ryu and Ken know that they can not let this happen. They battle Bison. But, Bison uses his special move, the psycho crusher. It seems like Ryu and Ken have no chance of defeating Bison. They quickly realize that they have to use the Hadou to defeat Bison. Meanwhile Guile and Chun-Li resume their fight outside....","publishedDate":"20 Oct. 1995","rating":{"count":33,"star":7.7}}]}],"href":"https://m.media-amazon.com/images/M/MV5BYmJiMTI1ODItZGExZi00ZGI5LWE2NjUtNjU4NTY4NzkxNjg3XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg","aired":"10/4/1995","rating_star":7.5,"rating_count":2365,"staff":"","duration":""}}